#ifndef UE4SS_SDK_ABP_Player_HPP
#define UE4SS_SDK_ABP_Player_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_1320;                                                        // 0x0004 (size: 0x8)
    FName __NameProperty_1321;                                                        // 0x000C (size: 0x8)
    FName __NameProperty_1322;                                                        // 0x0014 (size: 0x8)
    FName __NameProperty_1323;                                                        // 0x001C (size: 0x8)
    FName __NameProperty_1324;                                                        // 0x0024 (size: 0x8)
    FName __NameProperty_1325;                                                        // 0x002C (size: 0x8)
    FName __NameProperty_1326;                                                        // 0x0034 (size: 0x8)
    TArray<float> __ArrayProperty_1327;                                               // 0x0040 (size: 0x10)
    EAlphaBlendOption __EnumProperty_1328;                                            // 0x0050 (size: 0x1)
    TArray<float> __ArrayProperty_1329;                                               // 0x0058 (size: 0x10)
    TEnumAsByte<ERefPoseType> __ByteProperty_1330;                                    // 0x0068 (size: 0x1)
    TArray<float> __ArrayProperty_1331;                                               // 0x0070 (size: 0x10)
    FName __NameProperty_1332;                                                        // 0x0080 (size: 0x8)
    FName __NameProperty_1333;                                                        // 0x0088 (size: 0x8)
    int32 __IntProperty_1334;                                                         // 0x0090 (size: 0x4)
    FName __NameProperty_1335;                                                        // 0x0094 (size: 0x8)
    int32 __IntProperty_1336;                                                         // 0x009C (size: 0x4)
    FName __NameProperty_1337;                                                        // 0x00A0 (size: 0x8)
    int32 __IntProperty_1338;                                                         // 0x00A8 (size: 0x4)
    FName __NameProperty_1339;                                                        // 0x00AC (size: 0x8)
    int32 __IntProperty_1340;                                                         // 0x00B4 (size: 0x4)
    FName __NameProperty_1341;                                                        // 0x00B8 (size: 0x8)
    int32 __IntProperty_1342;                                                         // 0x00C0 (size: 0x4)
    FName __NameProperty_1343;                                                        // 0x00C4 (size: 0x8)
    int32 __IntProperty_1344;                                                         // 0x00CC (size: 0x4)
    FName __NameProperty_1345;                                                        // 0x00D0 (size: 0x8)
    int32 __IntProperty_1346;                                                         // 0x00D8 (size: 0x4)
    FName __NameProperty_1347;                                                        // 0x00DC (size: 0x8)
    int32 __IntProperty_1348;                                                         // 0x00E4 (size: 0x4)
    FName __NameProperty_1349;                                                        // 0x00E8 (size: 0x8)
    int32 __IntProperty_1350;                                                         // 0x00F0 (size: 0x4)
    FName __NameProperty_1351;                                                        // 0x00F4 (size: 0x8)
    int32 __IntProperty_1352;                                                         // 0x00FC (size: 0x4)
    FName __NameProperty_1353;                                                        // 0x0100 (size: 0x8)
    int32 __IntProperty_1354;                                                         // 0x0108 (size: 0x4)
    class UBlendProfile* __BlendProfile_1355;                                         // 0x0110 (size: 0x8)
    class UCurveFloat* __CurveFloat_1356;                                             // 0x0118 (size: 0x8)
    EAlphaBlendOption __EnumProperty_1357;                                            // 0x0120 (size: 0x1)
    EBlendListTransitionType __EnumProperty_1358;                                     // 0x0121 (size: 0x1)
    TArray<float> __ArrayProperty_1359;                                               // 0x0128 (size: 0x10)
    bool __BoolProperty_1360;                                                         // 0x0138 (size: 0x1)
    float __FloatProperty_1361;                                                       // 0x013C (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_1362;                              // 0x0140 (size: 0x2C)
    float __FloatProperty_1363;                                                       // 0x016C (size: 0x4)
    bool __BoolProperty_1364;                                                         // 0x0170 (size: 0x1)
    EAnimSyncMethod __EnumProperty_1365;                                              // 0x0171 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_1366;                            // 0x0172 (size: 0x1)
    FName __NameProperty_1367;                                                        // 0x0174 (size: 0x8)
    FName __NameProperty_1368;                                                        // 0x017C (size: 0x8)
    int32 __IntProperty_1369;                                                         // 0x0184 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_1370;                                       // 0x0188 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x01A8 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0228 (size: 0x18)

}; // Size: 0x240

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    bool __BoolProperty;                                                              // 0x0001 (size: 0x1)
    bool __BoolProperty_0;                                                            // 0x0002 (size: 0x1)
    TArray<float> __ArrayProperty_1;                                                  // 0x0008 (size: 0x10)
    bool __BoolProperty_2;                                                            // 0x0018 (size: 0x1)
    bool __BoolProperty_3;                                                            // 0x0019 (size: 0x1)
    bool __BoolProperty_4;                                                            // 0x001A (size: 0x1)
    bool __BoolProperty_5;                                                            // 0x001B (size: 0x1)
    float __FloatProperty_6;                                                          // 0x001C (size: 0x4)
    float __FloatProperty_7;                                                          // 0x0020 (size: 0x4)
    bool __BoolProperty_8;                                                            // 0x0024 (size: 0x1)
    bool __BoolProperty_9;                                                            // 0x0025 (size: 0x1)
    bool __BoolProperty_10;                                                           // 0x0026 (size: 0x1)
    bool __BoolProperty_11;                                                           // 0x0027 (size: 0x1)
    float __FloatProperty_12;                                                         // 0x0028 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x002C (size: 0x4)
    float __FloatProperty_14;                                                         // 0x0030 (size: 0x4)
    float __FloatProperty_15;                                                         // 0x0034 (size: 0x4)
    bool __BoolProperty_16;                                                           // 0x0038 (size: 0x1)
    bool __BoolProperty_17;                                                           // 0x0039 (size: 0x1)
    bool __BoolProperty_18;                                                           // 0x003A (size: 0x1)
    bool __BoolProperty_19;                                                           // 0x003B (size: 0x1)
    TArray<float> __ArrayProperty_20;                                                 // 0x0040 (size: 0x10)
    bool __BoolProperty_21;                                                           // 0x0050 (size: 0x1)
    bool __BoolProperty_22;                                                           // 0x0051 (size: 0x1)
    bool __BoolProperty_23;                                                           // 0x0052 (size: 0x1)
    bool __BoolProperty_24;                                                           // 0x0053 (size: 0x1)
    TArray<float> __ArrayProperty_25;                                                 // 0x0058 (size: 0x10)
    bool __BoolProperty_26;                                                           // 0x0068 (size: 0x1)
    bool __BoolProperty_27;                                                           // 0x0069 (size: 0x1)
    bool __BoolProperty_28;                                                           // 0x006A (size: 0x1)
    float __FloatProperty_29;                                                         // 0x006C (size: 0x4)
    float __FloatProperty_30;                                                         // 0x0070 (size: 0x4)
    float __FloatProperty_31;                                                         // 0x0074 (size: 0x4)
    float __FloatProperty_32;                                                         // 0x0078 (size: 0x4)
    bool __BoolProperty_33;                                                           // 0x007C (size: 0x1)
    float __FloatProperty_34;                                                         // 0x0080 (size: 0x4)
    float __FloatProperty_35;                                                         // 0x0084 (size: 0x4)
    bool __BoolProperty_36;                                                           // 0x0088 (size: 0x1)
    float __FloatProperty_37;                                                         // 0x008C (size: 0x4)
    bool __BoolProperty_38;                                                           // 0x0090 (size: 0x1)
    bool __BoolProperty_39;                                                           // 0x0091 (size: 0x1)
    float __FloatProperty_40;                                                         // 0x0094 (size: 0x4)
    float __FloatProperty_41;                                                         // 0x0098 (size: 0x4)
    float __FloatProperty_42;                                                         // 0x009C (size: 0x4)
    float __FloatProperty_43;                                                         // 0x00A0 (size: 0x4)
    float __FloatProperty_44;                                                         // 0x00A4 (size: 0x4)
    float __FloatProperty_45;                                                         // 0x00A8 (size: 0x4)
    float __FloatProperty_46;                                                         // 0x00AC (size: 0x4)
    float __FloatProperty_47;                                                         // 0x00B0 (size: 0x4)
    float __FloatProperty_48;                                                         // 0x00B4 (size: 0x4)
    float __FloatProperty_49;                                                         // 0x00B8 (size: 0x4)
    bool __BoolProperty_50;                                                           // 0x00BC (size: 0x1)
    bool __BoolProperty_51;                                                           // 0x00BD (size: 0x1)
    bool __BoolProperty_52;                                                           // 0x00BE (size: 0x1)
    bool __BoolProperty_53;                                                           // 0x00BF (size: 0x1)

}; // Size: 0xC0

class UABP_Player_C : public UPalAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0610 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0618 (size: 0xC0)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x06D8 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x06E0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_7;                                              // 0x06E8 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_6;                        // 0x0708 (size: 0xC8)
    FAnimNode_Root AnimGraphNode_Root_6;                                              // 0x07D0 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_5;                        // 0x07F0 (size: 0xC8)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;     // 0x08B8 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;     // 0x08D8 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16;                         // 0x08F8 (size: 0x108)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28;                       // 0x0A00 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41;                           // 0x0A48 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40;                           // 0x0A70 (size: 0x28)
    FAnimNode_Fabrik AnimGraphNode_Fabrik;                                            // 0x0AA0 (size: 0x1F0)
    FAnimNode_Root AnimGraphNode_Root_5;                                              // 0x0C90 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4;                        // 0x0CB0 (size: 0xC8)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_18;                                 // 0x0D78 (size: 0x128)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;     // 0x0EA0 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17;                                 // 0x0EC0 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16;                                 // 0x0FE8 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15;                                 // 0x1110 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14;                                 // 0x1238 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13;                                 // 0x1360 (size: 0x128)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_5;                                    // 0x1490 (size: 0x270)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_4;                                    // 0x1700 (size: 0x270)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_3;                                    // 0x1970 (size: 0x270)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2;                                    // 0x1BE0 (size: 0x270)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15;                         // 0x1E50 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39;                           // 0x1F58 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27;                       // 0x1F80 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38;                           // 0x1FC8 (size: 0x28)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;     // 0x1FF0 (size: 0x20)
    FAnimNode_Root AnimGraphNode_Root_4;                                              // 0x2010 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3;                        // 0x2030 (size: 0xC8)
    FAnimNode_LookAt AnimGraphNode_LookAt;                                            // 0x2100 (size: 0x250)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26;                       // 0x2350 (size: 0x48)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;     // 0x2398 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14;                         // 0x23B8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37;                           // 0x24C0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36;                           // 0x24E8 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;     // 0x2510 (size: 0x20)
    FAnimNode_Root AnimGraphNode_Root_3;                                              // 0x2530 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2;                        // 0x2550 (size: 0xC8)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_1;                                    // 0x2620 (size: 0x270)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;     // 0x2890 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;     // 0x28B0 (size: 0x20)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK;                                      // 0x28D0 (size: 0x270)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12;                                 // 0x2B40 (size: 0x128)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25;                       // 0x2C68 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13;                         // 0x2CB0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35;                           // 0x2DB8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34;                           // 0x2DE0 (size: 0x28)
    FAnimNode_Root AnimGraphNode_Root_2;                                              // 0x2E08 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_1;                        // 0x2E28 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24;                       // 0x2EF0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x2F38 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23;                       // 0x2F80 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x2FC8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_14;                                             // 0x3010 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12;                         // 0x3058 (size: 0x108)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9;                      // 0x3160 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33;                           // 0x3240 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32;                           // 0x3268 (size: 0x28)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2;      // 0x3290 (size: 0x118)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31;                           // 0x33A8 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22;                       // 0x33D0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30;                           // 0x3418 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_13;                                             // 0x3440 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_12;                                             // 0x3488 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x34D0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_11;                                             // 0x3518 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29;                           // 0x3560 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x3588 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11;                                 // 0x35A8 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10;                                 // 0x36D0 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9;                                  // 0x37F8 (size: 0x128)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x3920 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_10;                                             // 0x3940 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21;                       // 0x3988 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28;                           // 0x39D0 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;                      // 0x39F8 (size: 0xE0)
    FAnimNode_Slot AnimGraphNode_Slot_9;                                              // 0x3AD8 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11;                         // 0x3B20 (size: 0x108)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x3C28 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20;                       // 0x3C70 (size: 0x48)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8;                                  // 0x3CB8 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7;                                  // 0x3DE0 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6;                                  // 0x3F08 (size: 0x128)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10;                         // 0x4030 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27;                           // 0x4138 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7;                                // 0x4160 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26;                           // 0x4228 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19;                       // 0x4250 (size: 0x48)
    FAnimNode_Root AnimGraphNode_Root_1;                                              // 0x4298 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x42B8 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9;                          // 0x4380 (size: 0x108)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x4488 (size: 0xE0)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_1;      // 0x4568 (size: 0x118)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x4680 (size: 0x118)
    FAnimNode_Slot AnimGraphNode_Slot_8;                                              // 0x4798 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8;                          // 0x47E0 (size: 0x108)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7;                          // 0x48E8 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x49F0 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5;                                  // 0x4A10 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x4B38 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x4C60 (size: 0x128)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x4D88 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x4DA8 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x4DC8 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x4EF0 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x5018 (size: 0x128)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x5140 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x5160 (size: 0x108)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18;                       // 0x5268 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17;                       // 0x52B0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;                       // 0x52F8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;                       // 0x5340 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25;                           // 0x5388 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0x53B0 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x53F8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24;                           // 0x5500 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0x5528 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23;                           // 0x5570 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22;                           // 0x5598 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_7;                                              // 0x55C0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_6;                                              // 0x5608 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0x5650 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x5698 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21;                           // 0x5778 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20;                           // 0x57A0 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x57C8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19;                           // 0x58D0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18;                           // 0x58F8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x5920 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x5948 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x5970 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0x5998 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x59E0 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x5A08 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x5AE8 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_5;                                              // 0x5B10 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x5B58 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x5B80 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0x5BA8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x5BF0 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x5C18 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x5D20 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6;                                // 0x5D48 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x5E10 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x5E38 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x5E80 (size: 0x108)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x5F88 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x5FD0 (size: 0x48)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5;                                // 0x6018 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x60E0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x6128 (size: 0x48)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4;                                // 0x6170 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x6238 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x6260 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x6288 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x62B0 (size: 0x48)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x62F8 (size: 0xC8)
    FAnimNode_RefPose AnimGraphNode_IdentityPose;                                     // 0x63C0 (size: 0x10)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x63D0 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x63F8 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x64D8 (size: 0x48)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x6520 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x6540 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x6648 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x6670 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x66B8 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x6798 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x67C0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x6808 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x6830 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x6858 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x6880 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x68A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x68D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x68F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x6920 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x6948 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x6970 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x6998 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x69C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x69E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x6A10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x6A38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x6A60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x6A88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x6AB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x6AD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x6B00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x6B28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x6B50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x6B78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x6BA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x6BC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x6BF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x6C18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x6C40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x6C68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x6C90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x6CB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x6CE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x6D08 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0x6D30 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x6DA0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x6DC0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x6E30 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x6E50 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x6EC0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x6EE0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x6F28 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x6F48 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_LocalRefPose;                                     // 0x6F90 (size: 0x10)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x6FA0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x6FC0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x7008 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x7028 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x7070 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x7090 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x70D8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x7120 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x7168 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x7188 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x71D0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x72B0 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x7320 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x7368 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x73D8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x73F8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x7440 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x7488 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x74D0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x7518 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x75F8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x7640 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x7688 (size: 0x20)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3;                                // 0x76A8 (size: 0xC8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x7770 (size: 0x70)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2;                                // 0x77E0 (size: 0xC8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_1;                                // 0x78A8 (size: 0xC8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x7970 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x79E0 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x7A50 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x7AC0 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x7B30 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x7BA0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x7BE8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x7C30 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x7C50 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x7C98 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x7CE0 (size: 0x48)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x7D28 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x7DF0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x7E38 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x7E80 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x7EC8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x7EE8 (size: 0xC8)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_6;                        // 0x7FB0 (size: 0xC8)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_5;                        // 0x8078 (size: 0xC8)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4;                        // 0x8140 (size: 0xC8)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3;                        // 0x8208 (size: 0xC8)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2;                        // 0x82D0 (size: 0xC8)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_1;                        // 0x8398 (size: 0xC8)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer;                          // 0x8460 (size: 0xC8)
    FAnimNode_ControlRig AnimGraphNode_ControlRig;                                    // 0x8528 (size: 0x470)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x8998 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x89E0 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x8AC0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x8BC8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x8BF0 (size: 0x28)
    float K2Node_PropertyAccess_36;                                                   // 0x8C18 (size: 0x4)
    bool K2Node_PropertyAccess_34;                                                    // 0x8C1C (size: 0x1)
    FRotator K2Node_PropertyAccess_31;                                                // 0x8C20 (size: 0x18)
    float K2Node_PropertyAccess_30;                                                   // 0x8C38 (size: 0x4)
    float K2Node_PropertyAccess_29;                                                   // 0x8C3C (size: 0x4)
    FVector K2Node_PropertyAccess_28;                                                 // 0x8C40 (size: 0x18)
    bool K2Node_PropertyAccess_27;                                                    // 0x8C58 (size: 0x1)
    FRotator K2Node_PropertyAccess_25;                                                // 0x8C60 (size: 0x18)
    FVector K2Node_PropertyAccess_24;                                                 // 0x8C78 (size: 0x18)
    FVector K2Node_PropertyAccess_23;                                                 // 0x8C90 (size: 0x18)
    FVector K2Node_PropertyAccess_22;                                                 // 0x8CA8 (size: 0x18)
    bool K2Node_PropertyAccess_21;                                                    // 0x8CC0 (size: 0x1)
    bool K2Node_PropertyAccess_20;                                                    // 0x8CC1 (size: 0x1)
    bool K2Node_PropertyAccess_19;                                                    // 0x8CC2 (size: 0x1)
    bool K2Node_PropertyAccess_18;                                                    // 0x8CC3 (size: 0x1)
    bool K2Node_PropertyAccess_17;                                                    // 0x8CC4 (size: 0x1)
    bool K2Node_PropertyAccess_16;                                                    // 0x8CC5 (size: 0x1)
    EPalCharacterMovementCustomMode K2Node_PropertyAccess_15;                         // 0x8CC6 (size: 0x1)
    FVector K2Node_PropertyAccess_14;                                                 // 0x8CC8 (size: 0x18)
    FTransform K2Node_PropertyAccess_13;                                              // 0x8CE0 (size: 0x60)
    bool K2Node_PropertyAccess_12;                                                    // 0x8D40 (size: 0x1)
    class APalWeaponBase* K2Node_PropertyAccess_11;                                   // 0x8D48 (size: 0x8)
    bool K2Node_PropertyAccess_10;                                                    // 0x8D50 (size: 0x1)
    bool K2Node_PropertyAccess_9;                                                     // 0x8D51 (size: 0x1)
    class APalWeaponBase* K2Node_PropertyAccess_8;                                    // 0x8D58 (size: 0x8)
    bool K2Node_PropertyAccess_7;                                                     // 0x8D60 (size: 0x1)
    bool K2Node_PropertyAccess_6;                                                     // 0x8D61 (size: 0x1)
    bool K2Node_PropertyAccess_5;                                                     // 0x8D62 (size: 0x1)
    bool K2Node_PropertyAccess_4;                                                     // 0x8D63 (size: 0x1)
    FRidingAnimationInfo K2Node_PropertyAccess_3;                                     // 0x8D68 (size: 0x20)
    float K2Node_PropertyAccess_2;                                                    // 0x8D88 (size: 0x4)
    FWeaponAnimationInfo K2Node_PropertyAccess_1;                                     // 0x8D90 (size: 0x258)
    FWeaponAnimationInfo K2Node_PropertyAccess;                                       // 0x8FE8 (size: 0x258)
    float __CustomProperty_ClavicleAdjustFloat_3EAAD7D248100B118DCFE280A191AF83;      // 0x9240 (size: 0x4)
    double Speed;                                                                     // 0x9248 (size: 0x8)
    bool IsAim;                                                                       // 0x9250 (size: 0x1)
    FVector2D VelocityXY;                                                             // 0x9258 (size: 0x10)
    bool IsGliding;                                                                   // 0x9268 (size: 0x1)
    FRotator AimRotatorForSpine;                                                      // 0x9270 (size: 0x18)
    bool IsShooting;                                                                  // 0x9288 (size: 0x1)
    FRotator AimRotatorArm;                                                           // 0x9290 (size: 0x18)
    bool IsRiding;                                                                    // 0x92A8 (size: 0x1)
    FWeaponAnimationInfo WeaponInfo;                                                  // 0x92B0 (size: 0x258)
    FWeaponAnimationInfo PrevWeaponInfo;                                              // 0x9508 (size: 0x258)
    double ChangeWeaponWeight;                                                        // 0x9760 (size: 0x8)
    double Right;                                                                     // 0x9768 (size: 0x8)
    double Forward;                                                                   // 0x9770 (size: 0x8)
    double Pitch;                                                                     // 0x9778 (size: 0x8)
    double Yaw;                                                                       // 0x9780 (size: 0x8)
    bool isCrouch;                                                                    // 0x9788 (size: 0x1)
    bool isAttachLeftHand;                                                            // 0x9789 (size: 0x1)
    bool IsSliding;                                                                   // 0x978A (size: 0x1)
    bool IsRequestSliding;                                                            // 0x978B (size: 0x1)
    bool IsEnableSkySliding;                                                          // 0x978C (size: 0x1)
    bool IsSprint;                                                                    // 0x978D (size: 0x1)
    FRidingAnimationInfo RidingAnimationInfo;                                         // 0x9790 (size: 0x20)
    bool HasWeapon;                                                                   // 0x97B0 (size: 0x1)
    double KawaiiWeight;                                                              // 0x97B8 (size: 0x8)
    FRotator Cloth01_FrontBagRotator;                                                 // 0x97C0 (size: 0x18)
    bool IsReloading;                                                                 // 0x97D8 (size: 0x1)
    bool IsJumpPreliminary;                                                           // 0x97D9 (size: 0x1)
    bool IsEndJump;                                                                   // 0x97DA (size: 0x1)
    FTransform LeftHandTransform;                                                     // 0x97E0 (size: 0x60)
    bool IsValidSprintAnimation;                                                      // 0x9840 (size: 0x1)
    class AActor* RidingActor;                                                        // 0x9848 (size: 0x8)
    bool RiderModelIsBackward;                                                        // 0x9850 (size: 0x1)
    bool UseRidingAO;                                                                 // 0x9851 (size: 0x1)
    FRotator AimRotatorForSpine_Ride_WS;                                              // 0x9858 (size: 0x18)
    bool IsDead;                                                                      // 0x9870 (size: 0x1)
    bool FootIKEnable;                                                                // 0x9871 (size: 0x1)
    bool IsLookatEnable;                                                              // 0x9872 (size: 0x1)
    FVector LookAtTarget;                                                             // 0x9878 (size: 0x18)
    double LookatInTime;                                                              // 0x9890 (size: 0x8)
    double LookatOutTime;                                                             // 0x9898 (size: 0x8)
    bool IsClimbing;                                                                  // 0x98A0 (size: 0x1)
    class UAnimSequence* UniqueRideAnim;                                              // 0x98A8 (size: 0x8)
    bool IsUniqueRiding;                                                              // 0x98B0 (size: 0x1)
    FVector Ride_IKPosHandR;                                                          // 0x98B8 (size: 0x18)
    FVector Ride_IKPosHandL;                                                          // 0x98D0 (size: 0x18)
    FVector Ride_IKPosFootR;                                                          // 0x98E8 (size: 0x18)
    FVector Ride_IKPosFootL;                                                          // 0x9900 (size: 0x18)
    FRotator Ride_SpineAddRotate;                                                     // 0x9918 (size: 0x18)
    double Ride_HipForwardAdd;                                                        // 0x9930 (size: 0x8)
    double Ride_SpineWeight;                                                          // 0x9938 (size: 0x8)
    double UniqueRide_RightHandWeight;                                                // 0x9940 (size: 0x8)
    FVector RideIK_Pole_HandR;                                                        // 0x9948 (size: 0x18)
    FVector RideIK_Pole_HandL;                                                        // 0x9960 (size: 0x18)
    FVector RideIK_Pole_FootR;                                                        // 0x9978 (size: 0x18)
    FVector RideIK_Pole_FootL;                                                        // 0x9990 (size: 0x18)
    bool IsUniqueRideIK;                                                              // 0x99A8 (size: 0x1)
    double UniqueRide_LeftHandWeight;                                                 // 0x99B0 (size: 0x8)
    class UNiagaraComponent* FootStepEffect;                                          // 0x99B8 (size: 0x8)
    bool IsWalking;                                                                   // 0x99C0 (size: 0x1)
    float ClavicleAdjustDegree;                                                       // 0x99C4 (size: 0x4)
    class UAnimSequence* GlidingAS;                                                   // 0x99C8 (size: 0x8)
    double BlendTime_ForEagleGlider;                                                  // 0x99D0 (size: 0x8)
    bool IsDedicatedServer;                                                           // 0x99D8 (size: 0x1)
    class APalCharacter* TSCached_OwnerCharacter;                                     // 0x99E0 (size: 0x8)
    class UPalShooterComponent* TSCached_ShooterComponent;                            // 0x99E8 (size: 0x8)
    class UPalCharacterMovementComponent* TSCached_MovementComponent;                 // 0x99F0 (size: 0x8)
    class UPalLookAtComponent* TSCached_LookAtComponent;                              // 0x99F8 (size: 0x8)
    class UPalFootIKComponent* TSCached_FootIkComponent;                              // 0x9A00 (size: 0x8)
    class UPalSkeletalMeshComponent* TSCached_SkeletalMeshComponent;                  // 0x9A08 (size: 0x8)
    FRotator TSCache_CameraRotator;                                                   // 0x9A10 (size: 0x18)

    void ClothLayer(FPoseLink InPose, FPoseLink& ClothLayer);
    void LeftHandAttach(FPoseLink InPose, FPoseLink& LeftHandAttach);
    void UniqueRideFullBodyIK(FPoseLink InPose_3, FPoseLink& UniqueRideFullBodyIK);
    void Lookat(FPoseLink InPose_2, FPoseLink& Lookat);
    void FootIK(FPoseLink InPose_1, FPoseLink& FootIK);
    void RidingOverride(FPoseLink InPose_0, FPoseLink& RidingOverride);
    void WeaponUpperOverride(FPoseLink InPose, FPoseLink& WeaponUpperOverride);
    void AnimGraph(FPoseLink& AnimGraph);
    void TempFixLeftHandAttach();
    void GameThreadUpdate(double DeltaTime);
    void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
    void GetFootStepEffectScale(double& Scale);
    void CanSpawnFootStepEffect(bool& CanSpawn);
    void GetFootStepCharacterSpeed(double& CharacterSpeed);
    void StopFootStepEffect();
    void StartFootStepEffect();
