#ifndef UE4SS_SDK_ABP_Palmi_HPP
#define UE4SS_SDK_ABP_Palmi_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_1354;                                                        // 0x0004 (size: 0x8)
    TArray<float> __ArrayProperty_1355;                                               // 0x0010 (size: 0x10)
    FName __NameProperty_1356;                                                        // 0x0020 (size: 0x8)
    FName __NameProperty_1357;                                                        // 0x0028 (size: 0x8)
    FName __NameProperty_1358;                                                        // 0x0030 (size: 0x8)
    FName __NameProperty_1359;                                                        // 0x0038 (size: 0x8)
    FName __NameProperty_1360;                                                        // 0x0040 (size: 0x8)
    FName __NameProperty_1361;                                                        // 0x0048 (size: 0x8)
    TArray<float> __ArrayProperty_1362;                                               // 0x0050 (size: 0x10)
    FName __NameProperty_1363;                                                        // 0x0060 (size: 0x8)
    FName __NameProperty_1364;                                                        // 0x0068 (size: 0x8)
    FName __NameProperty_1365;                                                        // 0x0070 (size: 0x8)
    FName __NameProperty_1366;                                                        // 0x0078 (size: 0x8)
    FName __NameProperty_1367;                                                        // 0x0080 (size: 0x8)
    FName __NameProperty_1368;                                                        // 0x0088 (size: 0x8)
    FName __NameProperty_1369;                                                        // 0x0090 (size: 0x8)
    FName __NameProperty_1370;                                                        // 0x0098 (size: 0x8)
    FName __NameProperty_1371;                                                        // 0x00A0 (size: 0x8)
    FName __NameProperty_1372;                                                        // 0x00A8 (size: 0x8)
    int32 __IntProperty_1373;                                                         // 0x00B0 (size: 0x4)
    FName __NameProperty_1374;                                                        // 0x00B4 (size: 0x8)
    int32 __IntProperty_1375;                                                         // 0x00BC (size: 0x4)
    FName __NameProperty_1376;                                                        // 0x00C0 (size: 0x8)
    int32 __IntProperty_1377;                                                         // 0x00C8 (size: 0x4)
    FName __NameProperty_1378;                                                        // 0x00CC (size: 0x8)
    int32 __IntProperty_1379;                                                         // 0x00D4 (size: 0x4)
    FName __NameProperty_1380;                                                        // 0x00D8 (size: 0x8)
    int32 __IntProperty_1381;                                                         // 0x00E0 (size: 0x4)
    class UBlendProfile* __BlendProfile_1382;                                         // 0x00E8 (size: 0x8)
    class UCurveFloat* __CurveFloat_1383;                                             // 0x00F0 (size: 0x8)
    EAlphaBlendOption __EnumProperty_1384;                                            // 0x00F8 (size: 0x1)
    EBlendListTransitionType __EnumProperty_1385;                                     // 0x00F9 (size: 0x1)
    TArray<float> __ArrayProperty_1386;                                               // 0x0100 (size: 0x10)
    bool __BoolProperty_1387;                                                         // 0x0110 (size: 0x1)
    float __FloatProperty_1388;                                                       // 0x0114 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_1389;                              // 0x0118 (size: 0x2C)
    float __FloatProperty_1390;                                                       // 0x0144 (size: 0x4)
    bool __BoolProperty_1391;                                                         // 0x0148 (size: 0x1)
    EAnimSyncMethod __EnumProperty_1392;                                              // 0x0149 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_1393;                            // 0x014A (size: 0x1)
    FName __NameProperty_1394;                                                        // 0x014C (size: 0x8)
    FName __NameProperty_1395;                                                        // 0x0154 (size: 0x8)
    FName __NameProperty_1396;                                                        // 0x015C (size: 0x8)
    int32 __IntProperty_1397;                                                         // 0x0164 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_1398;                                       // 0x0168 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0188 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0208 (size: 0x18)

}; // Size: 0x220

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    bool __BoolProperty;                                                              // 0x0001 (size: 0x1)
    bool __BoolProperty_0;                                                            // 0x0002 (size: 0x1)
    TArray<float> __ArrayProperty_1;                                                  // 0x0008 (size: 0x10)
    bool __BoolProperty_2;                                                            // 0x0018 (size: 0x1)
    bool __BoolProperty_3;                                                            // 0x0019 (size: 0x1)
    bool __BoolProperty_4;                                                            // 0x001A (size: 0x1)
    bool __BoolProperty_5;                                                            // 0x001B (size: 0x1)
    float __FloatProperty_6;                                                          // 0x001C (size: 0x4)
    float __FloatProperty_7;                                                          // 0x0020 (size: 0x4)
    bool __BoolProperty_8;                                                            // 0x0024 (size: 0x1)
    bool __BoolProperty_9;                                                            // 0x0025 (size: 0x1)
    bool __BoolProperty_10;                                                           // 0x0026 (size: 0x1)
    bool __BoolProperty_11;                                                           // 0x0027 (size: 0x1)
    float __FloatProperty_12;                                                         // 0x0028 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x002C (size: 0x4)
    float __FloatProperty_14;                                                         // 0x0030 (size: 0x4)
    float __FloatProperty_15;                                                         // 0x0034 (size: 0x4)
    bool __BoolProperty_16;                                                           // 0x0038 (size: 0x1)
    bool __BoolProperty_17;                                                           // 0x0039 (size: 0x1)
    bool __BoolProperty_18;                                                           // 0x003A (size: 0x1)
    bool __BoolProperty_19;                                                           // 0x003B (size: 0x1)
    bool __BoolProperty_20;                                                           // 0x003C (size: 0x1)
    bool __BoolProperty_21;                                                           // 0x003D (size: 0x1)
    bool __BoolProperty_22;                                                           // 0x003E (size: 0x1)
    bool __BoolProperty_23;                                                           // 0x003F (size: 0x1)
    bool __BoolProperty_24;                                                           // 0x0040 (size: 0x1)
    float __FloatProperty_25;                                                         // 0x0044 (size: 0x4)
    float __FloatProperty_26;                                                         // 0x0048 (size: 0x4)
    float __FloatProperty_27;                                                         // 0x004C (size: 0x4)
    float __FloatProperty_28;                                                         // 0x0050 (size: 0x4)
    bool __BoolProperty_29;                                                           // 0x0054 (size: 0x1)
    float __FloatProperty_30;                                                         // 0x0058 (size: 0x4)
    float __FloatProperty_31;                                                         // 0x005C (size: 0x4)
    bool __BoolProperty_32;                                                           // 0x0060 (size: 0x1)
    float __FloatProperty_33;                                                         // 0x0064 (size: 0x4)
    bool __BoolProperty_34;                                                           // 0x0068 (size: 0x1)
    bool __BoolProperty_35;                                                           // 0x0069 (size: 0x1)
    float __FloatProperty_36;                                                         // 0x006C (size: 0x4)
    float __FloatProperty_37;                                                         // 0x0070 (size: 0x4)
    float __FloatProperty_38;                                                         // 0x0074 (size: 0x4)
    float __FloatProperty_39;                                                         // 0x0078 (size: 0x4)
    float __FloatProperty_40;                                                         // 0x007C (size: 0x4)
    float __FloatProperty_41;                                                         // 0x0080 (size: 0x4)
    float __FloatProperty_42;                                                         // 0x0084 (size: 0x4)
    float __FloatProperty_43;                                                         // 0x0088 (size: 0x4)
    float __FloatProperty_44;                                                         // 0x008C (size: 0x4)
    float __FloatProperty_45;                                                         // 0x0090 (size: 0x4)
    bool __BoolProperty_46;                                                           // 0x0094 (size: 0x1)
    bool __BoolProperty_47;                                                           // 0x0095 (size: 0x1)
    bool __BoolProperty_48;                                                           // 0x0096 (size: 0x1)

}; // Size: 0x97

class UABP_Palmi_C : public UPalAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0610 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0618 (size: 0x98)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x06B0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x06B8 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_7;                                              // 0x06C0 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_6;                        // 0x06E0 (size: 0xC8)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;     // 0x07A8 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;     // 0x07C8 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16;                         // 0x07E8 (size: 0x108)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25;                       // 0x08F0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39;                           // 0x0938 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38;                           // 0x0960 (size: 0x28)
    FAnimNode_Fabrik AnimGraphNode_Fabrik;                                            // 0x0990 (size: 0x1F0)
    FAnimNode_Root AnimGraphNode_Root_6;                                              // 0x0B80 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_5;                        // 0x0BA0 (size: 0xC8)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_19;                                 // 0x0C68 (size: 0x128)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;     // 0x0D90 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_18;                                 // 0x0DB0 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17;                                 // 0x0ED8 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16;                                 // 0x1000 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15;                                 // 0x1128 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14;                                 // 0x1250 (size: 0x128)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_5;                                    // 0x1380 (size: 0x270)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_4;                                    // 0x15F0 (size: 0x270)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_3;                                    // 0x1860 (size: 0x270)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2;                                    // 0x1AD0 (size: 0x270)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15;                         // 0x1D40 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37;                           // 0x1E48 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24;                       // 0x1E70 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36;                           // 0x1EB8 (size: 0x28)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;     // 0x1EE0 (size: 0x20)
    FAnimNode_Root AnimGraphNode_Root_5;                                              // 0x1F00 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4;                        // 0x1F20 (size: 0xC8)
    FAnimNode_LookAt AnimGraphNode_LookAt;                                            // 0x1FF0 (size: 0x250)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23;                       // 0x2240 (size: 0x48)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;     // 0x2288 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14;                         // 0x22A8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35;                           // 0x23B0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34;                           // 0x23D8 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;     // 0x2400 (size: 0x20)
    FAnimNode_Root AnimGraphNode_Root_4;                                              // 0x2420 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3;                        // 0x2440 (size: 0xC8)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_1;                                    // 0x2510 (size: 0x270)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;     // 0x2780 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;     // 0x27A0 (size: 0x20)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK;                                      // 0x27C0 (size: 0x270)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13;                                 // 0x2A30 (size: 0x128)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22;                       // 0x2B58 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13;                         // 0x2BA0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33;                           // 0x2CA8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32;                           // 0x2CD0 (size: 0x28)
    FAnimNode_Root AnimGraphNode_Root_3;                                              // 0x2CF8 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2;                        // 0x2D18 (size: 0xC8)
    FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_7;                            // 0x2DE0 (size: 0x790)
    FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_6;                            // 0x3570 (size: 0x790)
    FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_5;                            // 0x3D00 (size: 0x790)
    FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_4;                            // 0x4490 (size: 0x790)
    FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_3;                            // 0x4C20 (size: 0x790)
    FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_2;                            // 0x53B0 (size: 0x790)
    FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_1;                            // 0x5B40 (size: 0x790)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12;                                 // 0x62D0 (size: 0x128)
    FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics;                              // 0x6400 (size: 0x790)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;     // 0x6B90 (size: 0x20)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8;                                // 0x6BB0 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12;                         // 0x6C78 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31;                           // 0x6D80 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30;                           // 0x6DA8 (size: 0x28)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;     // 0x6DD0 (size: 0x20)
    FAnimNode_Root AnimGraphNode_Root_2;                                              // 0x6DF0 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_1;                        // 0x6E10 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21;                       // 0x6ED8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x6F20 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20;                       // 0x6F68 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x6FB0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_11;                                             // 0x6FF8 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11;                         // 0x7040 (size: 0x108)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;                      // 0x7148 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29;                           // 0x7228 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28;                           // 0x7250 (size: 0x28)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2;      // 0x7278 (size: 0x118)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27;                           // 0x7390 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19;                       // 0x73B8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26;                           // 0x7400 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_10;                                             // 0x7428 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_9;                                              // 0x7470 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x74B8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_8;                                              // 0x7500 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25;                           // 0x7548 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x7570 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11;                                 // 0x7590 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10;                                 // 0x76B8 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9;                                  // 0x77E0 (size: 0x128)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x7908 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_7;                                              // 0x7928 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18;                       // 0x7970 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24;                           // 0x79B8 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x79E0 (size: 0xE0)
    FAnimNode_Slot AnimGraphNode_Slot_6;                                              // 0x7AC0 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10;                         // 0x7B08 (size: 0x108)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x7C10 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17;                       // 0x7C58 (size: 0x48)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8;                                  // 0x7CA0 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7;                                  // 0x7DC8 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6;                                  // 0x7EF0 (size: 0x128)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9;                          // 0x8018 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23;                           // 0x8120 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7;                                // 0x8148 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22;                           // 0x8210 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;                       // 0x8238 (size: 0x48)
    FAnimNode_Root AnimGraphNode_Root_1;                                              // 0x8280 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x82A0 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8;                          // 0x8368 (size: 0x108)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x8470 (size: 0xE0)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_1;      // 0x8550 (size: 0x118)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x8668 (size: 0x118)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21;                           // 0x8780 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7;                          // 0x87A8 (size: 0x108)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x88B0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20;                           // 0x89B8 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x89E0 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5;                                  // 0x8A00 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x8B28 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x8C50 (size: 0x128)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x8D78 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x8D98 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x8DB8 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x8EE0 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x9008 (size: 0x128)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x9130 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x9150 (size: 0x108)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;                       // 0x9258 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0x92A0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0x92E8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19;                           // 0x9330 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6;                                // 0x9358 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0x9420 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x9468 (size: 0x108)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0x9570 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18;                           // 0x95B8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x95E0 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_5;                                              // 0x9608 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x9650 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0x9698 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x96E0 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x97C0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x97E8 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x9810 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x9918 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x9940 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x9968 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x9990 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x99B8 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x99E0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x9A28 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x9A50 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x9B30 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x9B58 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x9BA0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x9BC8 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x9BF0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x9C38 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x9C60 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x9D68 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5;                                // 0x9D90 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x9E58 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x9E80 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x9EC8 (size: 0x108)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x9FD0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0xA018 (size: 0x48)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4;                                // 0xA060 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0xA128 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0xA170 (size: 0x48)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0xA1B8 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0xA1D8 (size: 0x108)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0xA2E0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0xA328 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0xA408 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0xA430 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0xA458 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0xA4A0 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0xA580 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0xA5A8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0xA5F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0xA618 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0xA640 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0xA668 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0xA690 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0xA6B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0xA6E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0xA708 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0xA730 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0xA758 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0xA780 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0xA7A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0xA7D0 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0xA7F8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0xA868 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0xA888 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0xA8F8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0xA918 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0xA988 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0xA9A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0xA9D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0xA9F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0xAA20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0xAA48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0xAA70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0xAA98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0xAAC0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0xAAE8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0xAB30 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0xAB50 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0xAB98 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0xABB8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0xAC00 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0xAC20 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0xAC68 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0xAC88 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0xAD50 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0xAD70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0xAD98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0xADC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0xADE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0xAE10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0xAE38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0xAE60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0xAE88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0xAEB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0xAED8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0xAF00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0xAF28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0xAF50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0xAF78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0xAFA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0xAFC8 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0xAFF0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0xB038 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0xB080 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0xB0C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0xB0E8 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0xB130 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0xB210 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0xB280 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0xB2C8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0xB338 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0xB358 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0xB3A0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0xB3E8 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0xB4C8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0xB510 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0xB558 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0xB578 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0xB5C0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0xB608 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0xB650 (size: 0x20)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3;                                // 0xB670 (size: 0xC8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0xB738 (size: 0x70)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2;                                // 0xB7A8 (size: 0xC8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_1;                                // 0xB870 (size: 0xC8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0xB938 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0xB9A8 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0xBA18 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0xBA88 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0xBAF8 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0xBB68 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0xBBB0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0xBBF8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0xBC18 (size: 0x48)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0xBC60 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0xBD28 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0xBD70 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0xBDB8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0xBE00 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0xBE20 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0xBEE8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0xBF08 (size: 0xC8)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_6;                        // 0xBFD0 (size: 0xC8)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_5;                        // 0xC098 (size: 0xC8)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4;                        // 0xC160 (size: 0xC8)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3;                        // 0xC228 (size: 0xC8)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2;                        // 0xC2F0 (size: 0xC8)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_1;                        // 0xC3B8 (size: 0xC8)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer;                          // 0xC480 (size: 0xC8)
    double Speed;                                                                     // 0xC548 (size: 0x8)
    bool IsAim;                                                                       // 0xC550 (size: 0x1)
    FVector2D VelocityXY;                                                             // 0xC558 (size: 0x10)
    bool IsGliding;                                                                   // 0xC568 (size: 0x1)
    FRotator AimRotatorForSpine;                                                      // 0xC570 (size: 0x18)
    bool IsShooting;                                                                  // 0xC588 (size: 0x1)
    FRotator AimRotatorArm;                                                           // 0xC590 (size: 0x18)
    bool IsRiding;                                                                    // 0xC5A8 (size: 0x1)
    FWeaponAnimationInfo WeaponInfo;                                                  // 0xC5B0 (size: 0x258)
    FWeaponAnimationInfo PrevWeaponInfo;                                              // 0xC808 (size: 0x258)
    double ChangeWeaponWeight;                                                        // 0xCA60 (size: 0x8)
    double Right;                                                                     // 0xCA68 (size: 0x8)
    double Forward;                                                                   // 0xCA70 (size: 0x8)
    double Pitch;                                                                     // 0xCA78 (size: 0x8)
    double Yaw;                                                                       // 0xCA80 (size: 0x8)
    bool isCrouch;                                                                    // 0xCA88 (size: 0x1)
    bool isAttachLeftHand;                                                            // 0xCA89 (size: 0x1)
    bool IsSliding;                                                                   // 0xCA8A (size: 0x1)
    bool IsRequestSliding;                                                            // 0xCA8B (size: 0x1)
    bool IsEnableSkySliding;                                                          // 0xCA8C (size: 0x1)
    bool IsSprint;                                                                    // 0xCA8D (size: 0x1)
    int32 WeaponNum;                                                                  // 0xCA90 (size: 0x4)
    FRidingAnimationInfo RidingAnimationInfo;                                         // 0xCA98 (size: 0x20)
    bool HasWeapon;                                                                   // 0xCAB8 (size: 0x1)
    double KawaiiWeight;                                                              // 0xCAC0 (size: 0x8)
    FRotator Cloth01_FrontBagRotator;                                                 // 0xCAC8 (size: 0x18)
    bool IsReloading;                                                                 // 0xCAE0 (size: 0x1)
    bool IsJumpPreliminary;                                                           // 0xCAE1 (size: 0x1)
    bool IsEndJump;                                                                   // 0xCAE2 (size: 0x1)
    FTransform LeftHandTransform;                                                     // 0xCAF0 (size: 0x60)
    bool IsValidSprintAnimation;                                                      // 0xCB50 (size: 0x1)
    class AActor* RidingActor;                                                        // 0xCB58 (size: 0x8)
    bool RiderModelIsBackward;                                                        // 0xCB60 (size: 0x1)
    bool UseRidingAO;                                                                 // 0xCB61 (size: 0x1)
    FRotator AimRotatorForSpine_Ride_WS;                                              // 0xCB68 (size: 0x18)
    bool IsDead;                                                                      // 0xCB80 (size: 0x1)
    bool FootIKEnable;                                                                // 0xCB81 (size: 0x1)
    bool IsLookatEnable;                                                              // 0xCB82 (size: 0x1)
    FVector LookAtTarget;                                                             // 0xCB88 (size: 0x18)
    double LookatInTime;                                                              // 0xCBA0 (size: 0x8)
    double LookatOutTime;                                                             // 0xCBA8 (size: 0x8)
    bool IsClimbing;                                                                  // 0xCBB0 (size: 0x1)
    class UAnimSequence* UniqueRideAnim;                                              // 0xCBB8 (size: 0x8)
    bool IsUniqueRiding;                                                              // 0xCBC0 (size: 0x1)
    FVector Ride_IKPosHandR;                                                          // 0xCBC8 (size: 0x18)
    FVector Ride_IKPosHandL;                                                          // 0xCBE0 (size: 0x18)
    FVector Ride_IKPosFootR;                                                          // 0xCBF8 (size: 0x18)
    FVector Ride_IKPosFootL;                                                          // 0xCC10 (size: 0x18)
    FRotator Ride_SpineAddRotate;                                                     // 0xCC28 (size: 0x18)
    double Ride_HipForwardAdd;                                                        // 0xCC40 (size: 0x8)
    double Ride_SpineWeight;                                                          // 0xCC48 (size: 0x8)
    double UniqueRide_RightHandWeight;                                                // 0xCC50 (size: 0x8)
    FVector RideIK_Pole_HandR;                                                        // 0xCC58 (size: 0x18)
    FVector RideIK_Pole_HandL;                                                        // 0xCC70 (size: 0x18)
    FVector RideIK_Pole_FootR;                                                        // 0xCC88 (size: 0x18)
    FVector RideIK_Pole_FootL;                                                        // 0xCCA0 (size: 0x18)
    bool IsUniqueRideIK;                                                              // 0xCCB8 (size: 0x1)
    double UniqueRide_LeftHandWeight;                                                 // 0xCCC0 (size: 0x8)
    class UNiagaraComponent* FootStepEffect;                                          // 0xCCC8 (size: 0x8)
    bool IsWalking;                                                                   // 0xCCD0 (size: 0x1)

    void LeftHandAttach(FPoseLink InPose, FPoseLink& LeftHandAttach);
    void UniqueRideFullBodyIK(FPoseLink InPose_3, FPoseLink& UniqueRideFullBodyIK);
    void Lookat(FPoseLink InPose_2, FPoseLink& Lookat);
    void FootIK(FPoseLink InPose_1, FPoseLink& FootIK);
    void Kawaii(FPoseLink Input_Kawaii, FPoseLink& Kawaii);
    void RidingOverride(FPoseLink InPose_0, FPoseLink& RidingOverride);
    void WeaponUpperOverride(FPoseLink InPose, FPoseLink& WeaponUpperOverride);
    void AnimGraph(FPoseLink& AnimGraph);
    void GetFootStepEffectScale(double& Scale);
    void CanSpawnFootStepEffect(bool& CanSpawn);
    void GetFootStepCharacterSpeed(double& CharacterSpeed);
    void StopFootStepEffect();
    void StartFootStepEffect();
    void UpdateFootStepEffect(double DeltaTime);
    void PlaySound(FName SoundId);
