#ifndef UE4SS_SDK_BP_BuildObject_MachineVending01_Iron_HPP
#define UE4SS_SDK_BP_BuildObject_MachineVending01_Iron_HPP

class ABP_BuildObject_MachineVending01_Iron_C : public APalBuildObject
{
    class UBillboardComponent* Billboard3;                                            // 0x0580 (size: 0x8)
    class UArrowComponent* Arrow3;                                                    // 0x0588 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0590 (size: 0x8)
    class UBillboardComponent* Billboard2;                                            // 0x0598 (size: 0x8)
    class UArrowComponent* Arrow2;                                                    // 0x05A0 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x05A8 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x05B0 (size: 0x8)
    class UBillboardComponent* Billboard1;                                            // 0x05B8 (size: 0x8)
    class UArrowComponent* Arrow1;                                                    // 0x05C0 (size: 0x8)
    class UBillboardComponent* Billboard;                                             // 0x05C8 (size: 0x8)
    class UArrowComponent* Arrow;                                                     // 0x05D0 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SM_VendingMachine2;                                   // 0x05E0 (size: 0x8)
    class USceneComponent* Meshs;                                                     // 0x05E8 (size: 0x8)
    class UBP_InteractableBox_C* BP_InteractableBox;                                  // 0x05F0 (size: 0x8)
    class UBoxComponent* BuildWorkableBounds;                                         // 0x05F8 (size: 0x8)
    class UBoxComponent* CheckOverlapCollision;                                       // 0x0600 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0608 (size: 0x8)

}; // Size: 0x610

#endif
