#ifndef UE4SS_SDK_BP_BuildObject_Desk01_Iron_HPP
#define UE4SS_SDK_BP_BuildObject_Desk01_Iron_HPP

class ABP_BuildObject_Desk01_Iron_C : public APalBuildObject
{
    class UStaticMeshComponent* SM_Hummer_2;                                          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_Wrench_2;                                          // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SM_AVI_Deco_01;                                       // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SM_Pivot_Table_Lamp;                                  // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SM_Docs_Case_01;                                      // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SM_Radio_02;                                          // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SM_Screw_1;                                           // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SM_Screw_5;                                           // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_Screw_3;                                           // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_Ratchet;                                           // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* SM_Monkwrench_1_closed;                               // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* SM_Monkwrench_2_closed;                               // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* SM_Wrench_6;                                          // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* SM_Wrench_8;                                          // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* SM_Wrench_10;                                         // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* SM_Wrench_4;                                          // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* SM_AVI_Desk_01;                                       // 0x0600 (size: 0x8)
    class USceneComponent* Meshes;                                                    // 0x0608 (size: 0x8)
    class UBP_InteractableBox_C* BP_InteractableBox;                                  // 0x0610 (size: 0x8)
    class UBoxComponent* BuildWorkableBounds;                                         // 0x0618 (size: 0x8)
    class UBoxComponent* CheckOverlapCollision;                                       // 0x0620 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0628 (size: 0x8)

}; // Size: 0x630

#endif
