#ifndef UE4SS_SDK_BP_BuildObject_Factory_Comfortable_01_HPP
#define UE4SS_SDK_BP_BuildObject_Factory_Comfortable_01_HPP

class ABP_BuildObject_Factory_Comfortable_01_C : public APalBuildObject
{
    class UPalWorkFacingComponent* WorkFacing4;                                       // 0x0580 (size: 0x8)
    class UPalWorkFacingComponent* WorkFacing3;                                       // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SM_OfficeStuff01_Merged;                              // 0x0590 (size: 0x8)
    class UPalWorkFacingComponent* WorkFacing1;                                       // 0x0598 (size: 0x8)
    class UPalWorkFacingComponent* WorkFacing2;                                       // 0x05A0 (size: 0x8)
    class UPalWorkFacingComponent* WorkFacing;                                        // 0x05A8 (size: 0x8)
    class UBP_InteractableBox_C* BP_InteractableBox;                                  // 0x05B0 (size: 0x8)
    class UPalMapObjectItemConverterParameterComponent* ItemConverterParameter;       // 0x05B8 (size: 0x8)
    class UBoxComponent* BuildWorkableBounds;                                         // 0x05C0 (size: 0x8)
    class UBoxComponent* CheckOverlapCollision;                                       // 0x05C8 (size: 0x8)
    class USceneComponent* Root;                                                      // 0x05D0 (size: 0x8)

}; // Size: 0x5D8

#endif
