#ifndef UE4SS_SDK_BP_BuildObject_TableCircular01_Stone_HPP
#define UE4SS_SDK_BP_BuildObject_TableCircular01_Stone_HPP

class ABP_BuildObject_TableCircular01_Stone_C : public APalBuildObject
{
    class UStaticMeshComponent* SM_teaspoon1;                                         // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_teadish1;                                          // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SM_teacup_tea1;                                       // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SM_doily;                                             // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SM_lilies_vase;                                       // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SM_teadish;                                           // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* SM_teaspoon;                                          // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* SM_teacup_tea;                                        // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* SM_lilies;                                            // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* SM_dining_table;                                      // 0x05C8 (size: 0x8)
    class USceneComponent* Meshs;                                                     // 0x05D0 (size: 0x8)
    class UBP_InteractableBox_C* BP_InteractableBox;                                  // 0x05D8 (size: 0x8)
    class UBoxComponent* BuildWorkableBounds;                                         // 0x05E0 (size: 0x8)
    class UBoxComponent* CheckOverlapCollision;                                       // 0x05E8 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x05F0 (size: 0x8)

}; // Size: 0x5F8

#endif
