#ifndef UE4SS_SDK_BP_BuildObject_TableSquare01_Iron_HPP
#define UE4SS_SDK_BP_BuildObject_TableSquare01_Iron_HPP

class ABP_BuildObject_TableSquare01_Iron_C : public APalBuildObject
{
    class UStaticMeshComponent* Sm_apple_01;                                          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* Sm_apple_02;                                          // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Sm_apple_03;                                          // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SM_Fruit_Plate;                                       // 0x0598 (size: 0x8)
    class UStaticMeshComponent* SM_Dining_Table_02;                                   // 0x05A0 (size: 0x8)
    class USceneComponent* Meshes;                                                    // 0x05A8 (size: 0x8)
    class UBP_InteractableBox_C* BP_InteractableBox;                                  // 0x05B0 (size: 0x8)
    class UBoxComponent* BuildWorkableBounds;                                         // 0x05B8 (size: 0x8)
    class UBoxComponent* CheckOverlapCollision;                                       // 0x05C0 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x05C8 (size: 0x8)

}; // Size: 0x5D0

#endif
