#ifndef UE4SS_SDK_BP_BuildObject_WoodHouse_HPP
#define UE4SS_SDK_BP_BuildObject_WoodHouse_HPP

class ABP_BuildObject_WoodHouse_C : public APalBuildObject
{
    class UBoxComponent* BuildWorkableBounds;                                         // 0x0580 (size: 0x8)
    class UBP_InteractableBox_C* BP_InteractableBox;                                  // 0x0588 (size: 0x8)
    class UBoxComponent* CheckOverlapCollision;                                       // 0x0590 (size: 0x8)
    class UChildActorComponent* SM_box_b_20;                                          // 0x0598 (size: 0x8)
    class UChildActorComponent* SM_bag_b2_111;                                        // 0x05A0 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_a3_18;                                 // 0x05A8 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_c3;                                    // 0x05B0 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b3;                                    // 0x05B8 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_c2;                                    // 0x05C0 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b36;                                   // 0x05C8 (size: 0x8)
    class UChildActorComponent* SM_roof_c2_93;                                        // 0x05D0 (size: 0x8)
    class UChildActorComponent* SM_chair_29;                                          // 0x05D8 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b35;                                   // 0x05E0 (size: 0x8)
    class UChildActorComponent* SM_box_a2_117;                                        // 0x05E8 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b7;                                    // 0x05F0 (size: 0x8)
    class UChildActorComponent* SM_floor_a2;                                          // 0x05F8 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b30;                                   // 0x0600 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_c12;                                   // 0x0608 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b29;                                   // 0x0610 (size: 0x8)
    class UChildActorComponent* SM_wall_a4;                                           // 0x0618 (size: 0x8)
    class UChildActorComponent* SM_roof_a4_8;                                         // 0x0620 (size: 0x8)
    class UChildActorComponent* SM_floor_A_99;                                        // 0x0628 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b17;                                   // 0x0630 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_c11;                                   // 0x0638 (size: 0x8)
    class UChildActorComponent* SM_floor_a4;                                          // 0x0640 (size: 0x8)
    class UChildActorComponent* SM_floor_a3;                                          // 0x0648 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b16_72;                                // 0x0650 (size: 0x8)
    class UChildActorComponent* SM_roof_a8;                                           // 0x0658 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b20;                                   // 0x0660 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b6;                                    // 0x0668 (size: 0x8)
    class UChildActorComponent* SM_wall_a8;                                           // 0x0670 (size: 0x8)
    class UBoxComponent* VirtualMeshCollision;                                        // 0x0678 (size: 0x8)
    class UChildActorComponent* SM_wall_a7;                                           // 0x0680 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b19;                                   // 0x0688 (size: 0x8)
    class UChildActorComponent* SM_roof_a12;                                          // 0x0690 (size: 0x8)
    class UChildActorComponent* SM_wall_a5;                                           // 0x0698 (size: 0x8)
    class UChildActorComponent* SM_wall_a6;                                           // 0x06A0 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_c4;                                    // 0x06A8 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_c8;                                    // 0x06B0 (size: 0x8)
    class UChildActorComponent* SM_floor_a5;                                          // 0x06B8 (size: 0x8)
    class UChildActorComponent* SM_wall_window_a_19;                                  // 0x06C0 (size: 0x8)
    class UChildActorComponent* SM_wall_door_a_16;                                    // 0x06C8 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b22;                                   // 0x06D0 (size: 0x8)
    class UChildActorComponent* SM_Wall_A_4;                                          // 0x06D8 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b23;                                   // 0x06E0 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b10;                                   // 0x06E8 (size: 0x8)
    class UChildActorComponent* SM_roof_a5_13;                                        // 0x06F0 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b33;                                   // 0x06F8 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_a_87;                                  // 0x0700 (size: 0x8)
    class UChildActorComponent* SM_roof_b5_84;                                        // 0x0708 (size: 0x8)
    class UChildActorComponent* SM_steps_56;                                          // 0x0710 (size: 0x8)
    class UChildActorComponent* SM_roof_a9;                                           // 0x0718 (size: 0x8)
    class UChildActorComponent* SM_roof_a3_6;                                         // 0x0720 (size: 0x8)
    class UChildActorComponent* SM_roof_b3;                                           // 0x0728 (size: 0x8)
    class UChildActorComponent* SM_roof_b_43;                                         // 0x0730 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b18;                                   // 0x0738 (size: 0x8)
    class UChildActorComponent* SM_floor_a6;                                          // 0x0740 (size: 0x8)
    class UChildActorComponent* SM_roof_a7_15;                                        // 0x0748 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b11;                                   // 0x0750 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b21;                                   // 0x0758 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b5;                                    // 0x0760 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b_25;                                  // 0x0768 (size: 0x8)
    class UChildActorComponent* SM_roof_a11;                                          // 0x0770 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b4;                                    // 0x0778 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b14;                                   // 0x0780 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_a2;                                    // 0x0788 (size: 0x8)
    class UChildActorComponent* SM_roof_b6;                                           // 0x0790 (size: 0x8)
    class UChildActorComponent* SM_roof_a2_4;                                         // 0x0798 (size: 0x8)
    class UChildActorComponent* SM_roof_a_2;                                          // 0x07A0 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b31_22;                                // 0x07A8 (size: 0x8)
    class UChildActorComponent* SM_wall_a2_28;                                        // 0x07B0 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b2;                                    // 0x07B8 (size: 0x8)
    class UChildActorComponent* SM_wall_a3;                                           // 0x07C0 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b15;                                   // 0x07C8 (size: 0x8)
    class UChildActorComponent* SM_roof_b2;                                           // 0x07D0 (size: 0x8)
    class UChildActorComponent* SM_roof_c3;                                           // 0x07D8 (size: 0x8)
    class UChildActorComponent* SM_roof_a6_14;                                        // 0x07E0 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_c6;                                    // 0x07E8 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_c5;                                    // 0x07F0 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b26;                                   // 0x07F8 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_c10;                                   // 0x0800 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b8;                                    // 0x0808 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_c9;                                    // 0x0810 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b32;                                   // 0x0818 (size: 0x8)
    class UChildActorComponent* SM_roof_a10;                                          // 0x0820 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b9;                                    // 0x0828 (size: 0x8)
    class UChildActorComponent* SM_roof_b4;                                           // 0x0830 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b12;                                   // 0x0838 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b13;                                   // 0x0840 (size: 0x8)
    class UChildActorComponent* SM_box_b2;                                            // 0x0848 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b34;                                   // 0x0850 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_a4_24;                                 // 0x0858 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b28;                                   // 0x0860 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_b27;                                   // 0x0868 (size: 0x8)
    class UChildActorComponent* SM_wooden_beam_c7;                                    // 0x0870 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0878 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x0880 (size: 0x8)

}; // Size: 0x888

#endif
