#ifndef UE4SS_SDK_BP_BuildObject_HighTechKitchen_HPP
#define UE4SS_SDK_BP_BuildObject_HighTechKitchen_HPP

class ABP_BuildObject_HighTechKitchen_C : public APalBuildObject
{
    class UNiagaraComponent* NS_CookingSmoke;                                         // 0x0580 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0588 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0590 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0598 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x05B8 (size: 0x8)
    class UPalWorkFacingComponent* PalWorkFacing2;                                    // 0x05C0 (size: 0x8)
    class UPalWorkFacingComponent* PalWorkFacing1;                                    // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x05D0 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x05E8 (size: 0x8)
    class UBP_InteractableBox_C* BP_InteractableBox;                                  // 0x05F0 (size: 0x8)
    class UPalMapObjectItemConverterParameterComponent* ItemConverterParameter;       // 0x05F8 (size: 0x8)
    class UBoxComponent* BuildWorkableBounds;                                         // 0x0600 (size: 0x8)
    class UBoxComponent* CheckOverlapCollision;                                       // 0x0608 (size: 0x8)
    class USceneComponent* Root;                                                      // 0x0610 (size: 0x8)

}; // Size: 0x618

#endif
