#ifndef UE4SS_SDK_BP_Cutscene_DebrisB_HPP
#define UE4SS_SDK_BP_Cutscene_DebrisB_HPP

class ABP_Cutscene_DebrisB_C : public ABP_CutsceneCharacterBase_C
{
    class UStaticMeshComponent* SM_BoatWreckage_Debris20;                             // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris19;                             // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris18;                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris17;                             // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris16;                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris15;                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris13;                             // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris12;                             // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris11;                             // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris10;                             // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris09;                             // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris08;                             // 0x0300 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris07;                             // 0x0308 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris06;                             // 0x0310 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris05;                             // 0x0318 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris04;                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris03;                             // 0x0328 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris02;                             // 0x0330 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Debris01;                             // 0x0338 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Boat_chunk02;                         // 0x0340 (size: 0x8)
    class UStaticMeshComponent* SM_BoatWreckage_Boat_chunk01;                         // 0x0348 (size: 0x8)

}; // Size: 0x350

#endif
