#ifndef UE4SS_SDK_BP_Ladder_HPP
#define UE4SS_SDK_BP_Ladder_HPP

class ABP_Ladder_C : public AActor
{
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0290 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0298 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBlocks_WoodBlocks_low_019;                     // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent03;                                // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* SM_WoodBlocks_WoodBlocks_low_015;                     // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent04;                                // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent07;                                // 0x02D8 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x02E0 (size: 0x8)

}; // Size: 0x2E8

#endif
