#ifndef UE4SS_SDK_BP_master_vine_spline_HPP
#define UE4SS_SDK_BP_master_vine_spline_HPP

class ABP_master_vine_spline_C : public AActor
{
    class USplineComponent* Spline1;                                                  // 0x0290 (size: 0x8)
    class USceneComponent* spline_mesh;                                               // 0x0298 (size: 0x8)
    class UMeshComponent* MeshComponent;                                              // 0x02A0 (size: 0x8)
    class UMaterialInstanceDynamic* Dynamic Material;                                 // 0x02A8 (size: 0x8)
    class UMaterialInstanceDynamic* Dynamic Material1;                                // 0x02B0 (size: 0x8)
    bool Draw Final (Disable for Preview - Better Performance);                       // 0x02B8 (size: 0x1)
    bool Draw Meshes (Disable for quicker spline creation);                           // 0x02B9 (size: 0x1)
    double Start_Scale;                                                               // 0x02C0 (size: 0x8)
    double End_Scale;                                                                 // 0x02C8 (size: 0x8)
    FVector2D Lastscale Value;                                                        // 0x02D0 (size: 0x10)
    FVector2D Firstscale Value;                                                       // 0x02E0 (size: 0x10)
    int32 Index Number;                                                               // 0x02F0 (size: 0x4)
    class USplineMeshComponent* SplineMesh1;                                          // 0x02F8 (size: 0x8)
    class UStaticMesh* SplineMesh;                                                    // 0x0300 (size: 0x8)
    class UStaticMesh* EndMesh;                                                       // 0x0308 (size: 0x8)
    double Spline_Start;                                                              // 0x0310 (size: 0x8)
    double SplineEnd;                                                                 // 0x0318 (size: 0x8)
    double SplineLength;                                                              // 0x0320 (size: 0x8)
    class UMaterialInterface* Choose Material;                                        // 0x0328 (size: 0x8)
    class UMaterialInterface* Choose Material_LOD2;                                   // 0x0330 (size: 0x8)
    double vertical_tiling_amount;                                                    // 0x0338 (size: 0x8)
    double horizontal_tiling_amount;                                                  // 0x0340 (size: 0x8)
    double Tesselation Scale;                                                         // 0x0348 (size: 0x8)
    double Tesselation_Fade_Distance;                                                 // 0x0350 (size: 0x8)
    int32 GetNumSplinePoints;                                                         // 0x0358 (size: 0x4)
    bool Add_Branches;                                                                // 0x035C (size: 0x1)
    int32 Number_of_Branches;                                                         // 0x0360 (size: 0x4)
    double Branches_Start_Distance_Along_Spline;                                      // 0x0368 (size: 0x8)
    double wind_intensity;                                                            // 0x0370 (size: 0x8)
    double Min_Branch_Scale;                                                          // 0x0378 (size: 0x8)
    double Max_Branch_Scale;                                                          // 0x0380 (size: 0x8)
    double Pitch;                                                                     // 0x0388 (size: 0x8)
    double Pitch_Variation;                                                           // 0x0390 (size: 0x8)
    double Yaw;                                                                       // 0x0398 (size: 0x8)
    double Yaw_Variation;                                                             // 0x03A0 (size: 0x8)
    double Roll;                                                                      // 0x03A8 (size: 0x8)
    double Roll_Variation;                                                            // 0x03B0 (size: 0x8)
    class UStaticMesh* Branch_Mesh1;                                                  // 0x03B8 (size: 0x8)
    class UStaticMesh* Branch_Mesh2;                                                  // 0x03C0 (size: 0x8)
    class UStaticMesh* Branch_Mesh3;                                                  // 0x03C8 (size: 0x8)
    class USplineMeshComponent* SplineMesh2;                                          // 0x03D0 (size: 0x8)
    class UStaticMesh* Branch_Mesh4;                                                  // 0x03D8 (size: 0x8)
    TArray<FTree_Twist_Data> Vine_Twist_Per_Spline_Point;                             // 0x03E0 (size: 0x10)
    double Spline Start2;                                                             // 0x03F0 (size: 0x8)
    double SplineEnd2;                                                                // 0x03F8 (size: 0x8)
    FVector2D Firstscale Value2;                                                      // 0x0400 (size: 0x10)
    int32 Last Index;                                                                 // 0x0410 (size: 0x4)
    class UPhysicsConstraintComponent* Physics_Constraint;                            // 0x0418 (size: 0x8)
    int32 2;                                                                          // 0x0420 (size: 0x4)
    class UStaticMeshComponent* BranchMesh1;                                          // 0x0428 (size: 0x8)
    class UStaticMeshComponent* BranchMesh2;                                          // 0x0430 (size: 0x8)
    class UStaticMeshComponent* BranchMesh3;                                          // 0x0438 (size: 0x8)
    double Vertex_Wind_Distance1;                                                     // 0x0440 (size: 0x8)
    double Vertex_Wind_Distance2;                                                     // 0x0448 (size: 0x8)
    double Vertex_Wind_Distance3;                                                     // 0x0450 (size: 0x8)
    class UStaticMeshComponent* BranchMesh4;                                          // 0x0458 (size: 0x8)

    void UserConstructionScript();
}; // Size: 0x460

#endif
