#ifndef UE4SS_SDK_BP_NPCCamp_WelfareGroup_Forest1_TypeC_HPP
#define UE4SS_SDK_BP_NPCCamp_WelfareGroup_Forest1_TypeC_HPP

class ABP_NPCCamp_WelfareGroup_Forest1_TypeC_C : public ABP_NPCCampPresetBase_C
{
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Believer_Forest_TypeC;     // 0x02C0 (size: 0x8)
    class UChildActorComponent* BP_pal_b00_building_Lordenfel_Tall_Torch_Lit_04;      // 0x02C8 (size: 0x8)
    class UChildActorComponent* BP_pal_b00_building_Lordenfel_Tall_Torch_Lit_03;      // 0x02D0 (size: 0x8)
    class UChildActorComponent* BP_pal_b00_building_Lordenfel_Tall_Torch_Lit_02;      // 0x02D8 (size: 0x8)
    class UChildActorComponent* BP_pal_b00_building_Lordenfel_Tall_Torch_Lit_01;      // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* SM_LilyQueenStatue;                                   // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* SM_ConservationGroupBannerA2;                         // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* SM_ConservationGroupBannerB1;                         // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* SM_ConservationGroupBannerB;                          // 0x0300 (size: 0x8)
    class UStaticMeshComponent* SM_ConservationGroupBannerA1;                         // 0x0308 (size: 0x8)
    class UStaticMeshComponent* SM_ConservationGroupBannerA;                          // 0x0310 (size: 0x8)
    class UStaticMeshComponent* SM_ConservationGroupTent_06;                          // 0x0318 (size: 0x8)
    class UStaticMeshComponent* SM_ConservationGroupTent_04;                          // 0x0320 (size: 0x8)
    class UStaticMeshComponent* SM_ConservationGroupTent_03;                          // 0x0328 (size: 0x8)
    class UNiagaraComponent* Smoke;                                                   // 0x0330 (size: 0x8)
    class UStaticMeshComponent* SM_ConservationGroupTent_05;                          // 0x0338 (size: 0x8)
    class UStaticMeshComponent* SM_ConservationGroupTent_01;                          // 0x0340 (size: 0x8)
    class UStaticMeshComponent* SM_ConservationGroupTent_02;                          // 0x0348 (size: 0x8)
    class UChildActorComponent* BP_Fireplace;                                         // 0x0350 (size: 0x8)
    class UChildActorComponent* BP_PalCapturedCage;                                   // 0x0358 (size: 0x8)

}; // Size: 0x360

#endif
