#ifndef UE4SS_SDK_BP_NPCCamp_Hunter_Grass_HPP
#define UE4SS_SDK_BP_NPCCamp_Hunter_Grass_HPP

class ABP_NPCCamp_Hunter_Grass_C : public ABP_NPCCampPresetBase_C
{
    class UChildActorComponent* BP_GangCamp_GangTorch3;                               // 0x02C0 (size: 0x8)
    class UChildActorComponent* BP_GangCamp_GangTorch2;                               // 0x02C8 (size: 0x8)
    class UChildActorComponent* BP_GangCamp_GangTorch1;                               // 0x02D0 (size: 0x8)
    class UChildActorComponent* BP_GangCamp_GangTorch;                                // 0x02D8 (size: 0x8)
    class UNiagaraComponent* Smoke;                                                   // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* SM_GangFlag1;                                         // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* SM_GangFlag;                                          // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* SM_Wooden_barricade2;                                 // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* SM_GangFenceB1;                                       // 0x0300 (size: 0x8)
    class UStaticMeshComponent* SM_GangTent03;                                        // 0x0308 (size: 0x8)
    class UStaticMeshComponent* SM_GangTent02;                                        // 0x0310 (size: 0x8)
    class UStaticMeshComponent* SM_GangTent01;                                        // 0x0318 (size: 0x8)
    class UStaticMeshComponent* SM_GangFenceC;                                        // 0x0320 (size: 0x8)
    class UStaticMeshComponent* SM_GangFenceA1;                                       // 0x0328 (size: 0x8)
    class UStaticMeshComponent* SM_GangFenceD;                                        // 0x0330 (size: 0x8)
    class UStaticMeshComponent* SM_GangFenceB;                                        // 0x0338 (size: 0x8)
    class UStaticMeshComponent* SM_GangFenceA;                                        // 0x0340 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Hunter_Grass;              // 0x0348 (size: 0x8)
    class UStaticMeshComponent* SM_Wooden_barricade1;                                 // 0x0350 (size: 0x8)
    class UStaticMeshComponent* SM_Wooden_barricade;                                  // 0x0358 (size: 0x8)
    class UChildActorComponent* BP_Fireplace;                                         // 0x0360 (size: 0x8)
    class UStaticMeshComponent* SM_Bed_rug1;                                          // 0x0368 (size: 0x8)
    class UStaticMeshComponent* SM_Bed_rug;                                           // 0x0370 (size: 0x8)
    class UChildActorComponent* BP_PalCapturedCage;                                   // 0x0378 (size: 0x8)

}; // Size: 0x380

#endif
