#ifndef UE4SS_SDK_BP_PalMapObjectSpawner_SkillFruits_Desert_HPP
#define UE4SS_SDK_BP_PalMapObjectSpawner_SkillFruits_Desert_HPP

class ABP_PalMapObjectSpawner_SkillFruits_Desert_C : public APalMapObjectSpawnerMultiItem
{
    class UNiagaraComponent* NS_SkillFruitsTree;                                      // 0x0330 (size: 0x8)
    class UStaticMeshComponent* SM_FlowerMerge;                                       // 0x0338 (size: 0x8)
    class UPointLightComponent* PointLight;                                           // 0x0340 (size: 0x8)
    class UStaticMeshComponent* SM_SkillFruitsTree;                                   // 0x0348 (size: 0x8)
    class UPalMapObjectSpawnerDamageReactionComponent* DamageReaction;                // 0x0350 (size: 0x8)
    class UBP_MapObjectSpawnerLocationComponent_SkillFruits_C* LocationComponent_SkillFruits2; // 0x0358 (size: 0x8)
    class UBP_MapObjectSpawnerLocationComponent_SkillFruits_C* LocationComponent_SkillFruits1; // 0x0360 (size: 0x8)
    class UBP_MapObjectSpawnerLocationComponent_SkillFruits_C* LocationComponent_SkillFruits; // 0x0368 (size: 0x8)

}; // Size: 0x370

#endif
