#ifndef UE4SS_SDK_BP_pal_b00_Lordenfel_Gate_02_HPP
#define UE4SS_SDK_BP_pal_b00_Lordenfel_Gate_02_HPP

class ABP_pal_b00_Lordenfel_Gate_02_C : public AActor
{
    class UStaticMeshComponent* StaticMeshComponent13;                                // 0x0290 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent12;                                // 0x0298 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent9;                                 // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent8;                                 // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent7;                                 // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent6;                                 // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent5;                                 // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent4;                                 // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent3;                                 // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent2;                                 // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent1;                                 // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* SM_Wooden_Door_02_L1;                                 // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* SM_Wooden_Door_02_R1;                                 // 0x02F0 (size: 0x8)
    class USceneComponent* DefaultSceneRoot2;                                         // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* SM_Wooden_Door_02_L;                                  // 0x0300 (size: 0x8)
    class UStaticMeshComponent* SM_Wooden_Door_02_R;                                  // 0x0308 (size: 0x8)
    class USceneComponent* DefaultSceneRoot1;                                         // 0x0310 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent0;                                 // 0x0318 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0320 (size: 0x8)

}; // Size: 0x328

#endif
