#ifndef UE4SS_SDK_BP_pal_b00_Lordenfel_Bridge_Tall_HPP
#define UE4SS_SDK_BP_pal_b00_Lordenfel_Bridge_Tall_HPP

class ABP_pal_b00_Lordenfel_Bridge_Tall_C : public AActor
{
    class UStaticMeshComponent* SM_Ballustrade_Ruined_015;                            // 0x0290 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_06;                                    // 0x0298 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_Ruined_014;                            // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_Ruined_013;                            // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_Ruined_012;                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_Ruined_011;                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_05;                                    // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_Ruined_010;                            // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_04;                                    // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_Ruined_09;                             // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_Ruined_08;                             // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_03;                                    // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_Ruined_07;                             // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_Ruined_06;                             // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_02;                                    // 0x0300 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_Ruined_05;                             // 0x0308 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_Ruined_03;                             // 0x0310 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_01;                                    // 0x0318 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_Ruined_02;                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* SM_Ballustrade_Ruined_04;                             // 0x0328 (size: 0x8)
    class UStaticMeshComponent* SM_Trim_05a1;                                         // 0x0330 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_020;                          // 0x0338 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_019;                          // 0x0340 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_018;                          // 0x0348 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_017;                          // 0x0350 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_016;                          // 0x0358 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_015;                          // 0x0360 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_014;                          // 0x0368 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_013;                          // 0x0370 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_012;                          // 0x0378 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_011;                          // 0x0380 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_010;                          // 0x0388 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_09;                           // 0x0390 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_08;                           // 0x0398 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_07;                           // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_06;                           // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_05;                           // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_04;                           // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_03;                           // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* SM_Trim_05a;                                          // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_02;                           // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_Extension_01;                           // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* SM_Bridge_10m_01;                                     // 0x03E0 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x03E8 (size: 0x8)

}; // Size: 0x3F0

#endif
