#ifndef UE4SS_SDK_BP_pal_b00_hurou_HPP
#define UE4SS_SDK_BP_pal_b00_hurou_HPP

class ABP_pal_b00_hurou_C : public AActor
{
    class UStaticMeshComponent* SM_Pal_b00_hurou_pPlane15;                            // 0x0290 (size: 0x8)
    class UStaticMeshComponent* SM_Pal_b00_hurou_pPlane14;                            // 0x0298 (size: 0x8)
    class UStaticMeshComponent* SM_Pal_b00_hurou_pCylinder4;                          // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* SM_pal_b00_grass_Lodenfel_Column_Ruined_014;          // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* Sphere7;                                              // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* SM_pal_b00_grass_Lodenfel_Column_Ruined_013;          // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* Sphere6;                                              // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* SM_pal_b00_grass_Lodenfel_Column_Ruined_011;          // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* SM_pal_b00_grass_Lodenfel_Column_Ruined_012;          // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* Sphere5;                                              // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* SM_pal_b00_grass_Lodenfel_Column_Ruined_09;           // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* Sphere4;                                              // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* SM_pal_b00_grass_Lodenfel_Column_Ruined_010;          // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* Sphere3;                                              // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Sphere2;                                              // 0x0300 (size: 0x8)
    class UStaticMeshComponent* SM_pal_b00_grass_Lodenfel_Column_Ruined_08;           // 0x0308 (size: 0x8)
    class UStaticMeshComponent* Sphere1;                                              // 0x0310 (size: 0x8)
    class UStaticMeshComponent* SM_pal_b00_grass_Lodenfel_Column_Ruined_07;           // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Sphere;                                               // 0x0320 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0328 (size: 0x8)

}; // Size: 0x330

#endif
