#ifndef UE4SS_SDK_BP_pal_b00_building_Lordenfel_Candelabra_Hanging_Lit_02_HPP
#define UE4SS_SDK_BP_pal_b00_building_Lordenfel_Candelabra_Hanging_Lit_02_HPP

class ABP_pal_b00_building_Lordenfel_Candelabra_Hanging_Lit_02_C : public AStaticMeshActor
{
    class UPointLightComponent* PointLight;                                           // 0x02A0 (size: 0x8)
    class UParticleSystemComponent* PS_Candle_Fire_FX_08;                             // 0x02A8 (size: 0x8)
    class UParticleSystemComponent* PS_Candle_Fire_FX_07;                             // 0x02B0 (size: 0x8)
    class UParticleSystemComponent* PS_Candle_Fire_FX_06;                             // 0x02B8 (size: 0x8)
    class UParticleSystemComponent* PS_Candle_Fire_FX_05;                             // 0x02C0 (size: 0x8)
    class UParticleSystemComponent* PS_Candle_Fire_FX_04;                             // 0x02C8 (size: 0x8)
    class UParticleSystemComponent* PS_Candle_Fire_FX_03;                             // 0x02D0 (size: 0x8)
    class UParticleSystemComponent* PS_Candle_Fire_FX_02;                             // 0x02D8 (size: 0x8)
    class UParticleSystemComponent* PS_Candle_Fire_FX_01;                             // 0x02E0 (size: 0x8)

}; // Size: 0x2E8

#endif
