#ifndef UE4SS_SDK_BP_SquadNPCSpawner_ForCamp_Hunter_Grass2_TypeB_HPP
#define UE4SS_SDK_BP_SquadNPCSpawner_ForCamp_Hunter_Grass2_TypeB_HPP

class ABP_SquadNPCSpawner_ForCamp_Hunter_Grass2_TypeB_C : public ABP_SquadNPCSpawner_ForCampBase_C
{
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent4;                   // 0x0460 (size: 0x8)
    class UBP_NPCPathWalkPointComponent_1_C* BP_NPCPathWalkPointComponent_1;          // 0x0468 (size: 0x8)
    class UBP_NPCPathWalkPointComponent_1_C* BP_NPCPathWalkPointComponent_6;          // 0x0470 (size: 0x8)
    class UBP_NPCPathWalkPointComponent_1_C* BP_NPCPathWalkPointComponent_5;          // 0x0478 (size: 0x8)
    class UBP_NPCPathWalkPointComponent_1_C* BP_NPCPathWalkPointComponent_4;          // 0x0480 (size: 0x8)
    class UBP_NPCPathWalkPointComponent_1_C* BP_NPCPathWalkPointComponent_3;          // 0x0488 (size: 0x8)
    class UBP_NPCPathWalkPointComponent_1_C* BP_NPCPathWalkPointComponent_2;          // 0x0490 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent3;                   // 0x0498 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent2;                   // 0x04A0 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent1;                   // 0x04A8 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent;                    // 0x04B0 (size: 0x8)

}; // Size: 0x4B8

#endif
