#ifndef UE4SS_SDK_BPP_LI_pal_b01Remains_02_HPP
#define UE4SS_SDK_BPP_LI_pal_b01Remains_02_HPP

class ABPP_LI_pal_b01Remains_02_C : public APackedLevelActor
{
    class UInstancedStaticMeshComponent* InstancedStaticMesh2;                        // 0x0320 (size: 0x8)
    class UInstancedStaticMeshComponent* InstancedStaticMesh1;                        // 0x0328 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh6; // 0x0330 (size: 0x8)
    class UInstancedStaticMeshComponent* InstancedStaticMesh;                         // 0x0338 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh5; // 0x0340 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh4; // 0x0348 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh3; // 0x0350 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh2; // 0x0358 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh1; // 0x0360 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh; // 0x0368 (size: 0x8)

}; // Size: 0x370

#endif
