#ifndef UE4SS_SDK_Pal_HPP
#define UE4SS_SDK_Pal_HPP

#include "Pal_enums.hpp"

struct FActionDynamicParameter
{
    class AActor* ActionTarget;                                                       // 0x0000 (size: 0x8)
    FTransform StartTransform;                                                        // 0x0010 (size: 0x60)
    FVector ActionVelocity;                                                           // 0x0070 (size: 0x18)
    int32 GeneralPurposeIndex;                                                        // 0x0088 (size: 0x4)
    FVector DummyTargetLocation;                                                      // 0x0090 (size: 0x18)
    FGuid ActionID;                                                                   // 0x00A8 (size: 0x10)
    bool bIsAdjustTransform;                                                          // 0x00B8 (size: 0x1)
    FPalNetArchive Blackboard;                                                        // 0x00C0 (size: 0x10)
    int32 NetRandSeed;                                                                // 0x00D0 (size: 0x4)

}; // Size: 0xE0

struct FActorArray
{
    TArray<class AActor*> Actors;                                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FBuildingSurfaceMaterialSet
{
    class UMaterialInstance* Highlight;                                               // 0x0000 (size: 0x8)
    class UMaterialInstance* Error;                                                   // 0x0008 (size: 0x8)
    class UMaterialInstance* Building;                                                // 0x0010 (size: 0x8)
    class UMaterialInstance* BuildComplete;                                           // 0x0018 (size: 0x8)
    class UMaterialInstance* Dismantle;                                               // 0x0020 (size: 0x8)
    class UMaterialInstance* Damage;                                                  // 0x0028 (size: 0x8)
    class UCurveFloat* BuildCompleteAnimationCurve;                                   // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FBulletHoleDecalInfo
{
    TArray<class UMaterialInterface*> BulletHoleDecals;                               // 0x0000 (size: 0x10)
    FVector Decal_Size;                                                               // 0x0010 (size: 0x18)
    float Decal_Size_RandomMin;                                                       // 0x0028 (size: 0x4)
    float Decal_Size_RandomMax;                                                       // 0x002C (size: 0x4)

}; // Size: 0x30

struct FCaptureResult
{
    bool IsSuccess;                                                                   // 0x0000 (size: 0x1)
    int32 TestSuccessCount;                                                           // 0x0004 (size: 0x4)
    EFailedCaptureType FailedCaptureType;                                             // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FCharacterListForImportanceManager
{
    TArray<class APalCharacter*> CharacterList;                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCharacterParameterRepInfo : public FFastArraySerializerItem
{
    FGuid RequestGUID;                                                                // 0x000C (size: 0x10)
    FPalInstanceID ID;                                                                // 0x0020 (size: 0x30)
    class UPalIndividualCharacterParameter* Parameter;                                // 0x0050 (size: 0x8)

}; // Size: 0x58

struct FDelegateTickFunction : public FTickFunction
{
}; // Size: 0x38

struct FElementOfLayeredFlagContainer
{
    int32 Priority;                                                                   // 0x0000 (size: 0x4)
    FFlagContainer Container;                                                         // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FFastCharacterParameterRepInfoArray : public FFastArraySerializer
{
    TArray<FCharacterParameterRepInfo> Items;                                         // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FFastPalBaseCampRepInfoArray : public FFastArraySerializer
{
    TArray<FPalBaseCampRepInfo> Items;                                                // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FFastPalIndividualCharacterHandleIdArray : public FFastArraySerializer
{
    TArray<FPalIndividualCharacterHandleId> Items;                                    // 0x0108 (size: 0x10)

}; // Size: 0x118

struct FFastPalLocationRepInfoArray : public FFastArraySerializer
{
    TArray<FPalLocationRepInfo> Items;                                                // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FFixedPoint
{
    int32 Value;                                                                      // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FFixedPoint64
{
    int64 Value;                                                                      // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FFlagContainer
{
    TMap<class FName, class bool> Flags;                                              // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FFloatContainer
{
    TArray<FFloatContainer_FloatPair> Values;                                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FFloatContainer_FloatPair
{
    FName Key;                                                                        // 0x0000 (size: 0x8)
    float Value;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FFloatCounter
{
    float TriggerValue;                                                               // 0x0000 (size: 0x4)
    float CurrentStackValue;                                                          // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FFootIKSetting
{
    bool bIsEnableIK;                                                                 // 0x0000 (size: 0x1)
    FName RayCastBoneName;                                                            // 0x0004 (size: 0x8)
    float RayStartOffset;                                                             // 0x000C (size: 0x4)
    float RayEndOffset;                                                               // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FFootStampInfo
{
    TMap<class EPalFootType, class UMaterialInterface*> FootstepDecalMap;             // 0x0000 (size: 0x50)
    FVector FootstepDecal_Size;                                                       // 0x0050 (size: 0x18)
    FRotator FootstepDecal_InitialRotation;                                           // 0x0068 (size: 0x18)

}; // Size: 0x80

struct FFootStepEffectInfo
{
    TMap<TEnumAsByte<EPhysicalSurface>, TSoftObjectPtr<UNiagaraSystem>> PhysicalSurfaceToEffect; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FGameDateTime
{
    int64 Ticks;                                                                      // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FGeneralAnimationParameter
{
    float MoveSpeed;                                                                  // 0x0000 (size: 0x4)
    float MoveSpeedXY;                                                                // 0x0004 (size: 0x4)
    FVector Velocity;                                                                 // 0x0008 (size: 0x18)
    FVector InputVelocity;                                                            // 0x0020 (size: 0x18)
    FVector ClimbingVelocity;                                                         // 0x0038 (size: 0x18)
    bool bIsInAir;                                                                    // 0x0050 (size: 0x1)
    bool bIsSliding;                                                                  // 0x0051 (size: 0x1)
    bool bIsSwimming;                                                                 // 0x0052 (size: 0x1)
    float RangeForGround;                                                             // 0x0054 (size: 0x4)
    bool bIsNearGround;                                                               // 0x0058 (size: 0x1)
    TMap<class EPalGeneralAnimSequenceType, class UAnimSequence*> GeneralAnimSequenceMap; // 0x0060 (size: 0x50)
    TMap<class EPalGeneralBlendSpaceType, class UBlendSpace*> GeneralBlendSpaceMap;   // 0x00B0 (size: 0x50)
    float FootIKRootOffset;                                                           // 0x0100 (size: 0x4)
    TMap<EPalFootType, float> FootIKOffset;                                           // 0x0108 (size: 0x50)
    float MoveSpeedPlusByRotateYaw;                                                   // 0x0158 (size: 0x4)
    float YawSpeed;                                                                   // 0x015C (size: 0x4)
    float AdditiveAnimationRate;                                                      // 0x0160 (size: 0x4)
    bool DisableUpperOverrideFlag;                                                    // 0x0164 (size: 0x1)
    bool bTransportingObject;                                                         // 0x0165 (size: 0x1)

}; // Size: 0x168

struct FLayeredFlagContainer
{
    TArray<FElementOfLayeredFlagContainer> ContainerList;                             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FNetworkActorSpawnParameters
{
    class AActor* NetworkOwner;                                                       // 0x0000 (size: 0x8)
    FName Name;                                                                       // 0x0008 (size: 0x8)
    class AActor* Owner;                                                              // 0x0010 (size: 0x8)
    FVector SpawnLocation;                                                            // 0x0018 (size: 0x18)
    FRotator SpawnRotation;                                                           // 0x0030 (size: 0x18)
    FVector SpawnScale;                                                               // 0x0048 (size: 0x18)
    TSubclassOf<class AController> ControllerClass;                                   // 0x0060 (size: 0x8)
    ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingOverride;                // 0x0068 (size: 0x1)
    bool bAlwaysRelevant;                                                             // 0x0069 (size: 0x1)

}; // Size: 0x70

struct FPalACEWordFilterRequestData
{
    FString TargetString;                                                             // 0x0000 (size: 0x10)
    EPalACEWordFilterSceneType SceneType;                                             // 0x0010 (size: 0x1)
    FPalACEWordFilterRequestDataCallback Callback;                                    // 0x0018 (size: 0x10)
    void AsyncHTTPRequestFunction(const FString ResponseBody, bool bResponseOK, int32 ResponseCode);

}; // Size: 0x28

struct FPalAIActionBaseCampSleepActivelyParameter
{
    float WalkAroundTime;                                                             // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FPalAIActionDynamicParameter
{
    class AActor* GeneralActor1;                                                      // 0x0000 (size: 0x8)
    FVector GeneralVector1;                                                           // 0x0008 (size: 0x18)
    FVector GeneralVector2;                                                           // 0x0020 (size: 0x18)
    int32 GeneralIndex1;                                                              // 0x0038 (size: 0x4)
    bool GeneralBool1;                                                                // 0x003C (size: 0x1)
    int32 GeneralInteger1;                                                            // 0x0040 (size: 0x4)
    int32 GeneralInteger2;                                                            // 0x0044 (size: 0x4)
    EPalWazaID SelfDestructWaza;                                                      // 0x0048 (size: 0x1)

}; // Size: 0x50

struct FPalAIMoveRequest : public FAIMoveRequest
{
}; // Size: 0x68

struct FPalAISensorSearchQuery
{
}; // Size: 0x18

struct FPalAmbientSoundAreaData
{
    int32 AmbientPriority;                                                            // 0x0000 (size: 0x4)
    TArray<class UAkAudioEvent*> DayAmbientEvents;                                    // 0x0008 (size: 0x10)
    TArray<class UAkAudioEvent*> NightAmbientEvents;                                  // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FPalArenaStartParameter
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    FQuat Rot;                                                                        // 0x0020 (size: 0x20)
    EPalAudioStateGroup BattleBGMStateGroup;                                          // 0x0040 (size: 0x1)

}; // Size: 0x50

struct FPalArenaTestParameter
{
    class UPalArenaPartyAsset* Player1Data;                                           // 0x0000 (size: 0x8)
    class UPalArenaPartyAsset* Player2Data;                                           // 0x0008 (size: 0x8)
    class AActor* Player1StartPoint;                                                  // 0x0010 (size: 0x8)
    class AActor* Player2StartPoint;                                                  // 0x0018 (size: 0x8)
    TArray<class AActor*> Player1PalPoint;                                            // 0x0020 (size: 0x10)
    TArray<class AActor*> Player2PalPoint;                                            // 0x0030 (size: 0x10)
    EPalAudioStateGroup BattleBGMStateGroup;                                          // 0x0040 (size: 0x1)
    float RideDelayTime;                                                              // 0x0044 (size: 0x4)
    bool bRandomPartyMode;                                                            // 0x0048 (size: 0x1)
    int32 RandomPartyPalLevel;                                                        // 0x004C (size: 0x4)

}; // Size: 0x50

struct FPalArrowSettings
{
    FColor Color;                                                                     // 0x0000 (size: 0x4)
    float Size;                                                                       // 0x0004 (size: 0x4)
    float Thickness;                                                                  // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalAsyncSaveProcess
{
    EPalAsyncSaveProcessState State;                                                  // 0x0000 (size: 0x1)

}; // Size: 0x18

struct FPalAsyncSaveProcessParallel
{
    TMap<class FString, class FPalAsyncSaveProcess> ProcessMap;                       // 0x0000 (size: 0x50)

}; // Size: 0x60

struct FPalAudioFadeParameter
{
    EPalAudioFadeType FadeType;                                                       // 0x0000 (size: 0x1)
    float CurrentVolume;                                                              // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalAxisKeyConfigKeys : public FPalKeyConfigKeys
{
    FName AxisName;                                                                   // 0x0030 (size: 0x8)
    EPalKeyConfigAxisFilterType FilterType;                                           // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FPalBPClassDataRow : public FTableRowBase
{
    TSoftClassPtr<APalCharacter> BPClass;                                             // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FPalBaseCampCreateParameter
{
}; // Size: 0x170

struct FPalBaseCampFacilityCountPair
{
    EPalMapObjectWorkerAvailableFacilityType FacilityType;                            // 0x0000 (size: 0x1)
    int32 FacilityCount;                                                              // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalBaseCampFacilityUsageInfo
{
    EPalBaseCampFacilityUsageState State;                                             // 0x0000 (size: 0x1)
    FPalInstanceID ReservedIndividualId;                                              // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FPalBaseCampFacilityUsageInfoSet
{
    TMap<class FGuid, class FPalBaseCampFacilityUsageInfo> InfoMap;                   // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalBaseCampItemContainerInfo
{
    FPalContainerId ContainerId;                                                      // 0x0000 (size: 0x10)
    EPalBaseCampItemContainerType Type;                                               // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FPalBaseCampItemExistsInfo
{
    FGuid MapObjectModelInstanceId;                                                   // 0x0000 (size: 0x10)
    int32 itemNum;                                                                    // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalBaseCampLevelMasterData : public FTableRowBase
{
    int32 Level;                                                                      // 0x0008 (size: 0x4)
    int32 WorkerMaxNum;                                                               // 0x000C (size: 0x4)
    int32 BaseCampMaxNumInGuild;                                                      // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FPalBaseCampModuleResourceCollectWorkInfo
{
    FGuid WorkId;                                                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalBaseCampModuleTransportItemCharacterInfo
{
    TArray<FPalItemAndNum> ItemInfos;                                                 // 0x0000 (size: 0x10)
    FVector CharacterLocation;                                                        // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FPalBaseCampModuleTransportItemDepotParameter
{
    FGuid OwnerMapObjectConcreteModelInstanceId;                                      // 0x0000 (size: 0x10)
    FPalBoundsTransform DepotLocalBoundsTransform;                                    // 0x0010 (size: 0x80)
    FPalBaseCampModuleTransportItemRequirement Requirement;                           // 0x0090 (size: 0x48)

}; // Size: 0xE0

struct FPalBaseCampModuleTransportItemDirection
{
    FGuid RequiredMapObjectConcreteModelInstanceId;                                   // 0x0000 (size: 0x10)
    FGuid TransportTargetMapObjectConcreteModelInstanceId;                            // 0x0010 (size: 0x10)
    int32 MaxItemStackNum;                                                            // 0x0020 (size: 0x4)
    bool bRetunring;                                                                  // 0x0024 (size: 0x1)

}; // Size: 0x28

struct FPalBaseCampModuleTransportItemRequirement
{
    EPalBaseCampModuleTransportItemTransportPriority Priority;                        // 0x0000 (size: 0x1)
    TArray<FPalStaticItemIdAndNum> ItemInfo;                                          // 0x0008 (size: 0x10)
    TArray<EPalItemTypeA> ItemTypeA;                                                  // 0x0018 (size: 0x10)
    TArray<EPalItemTypeB> ItemTypeB;                                                  // 0x0028 (size: 0x10)
    TArray<EPalBaseCampModuleTransportItemTransportableItemExtraType> ItemExtraTypes; // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FPalBaseCampModuleTransportItemStatus
{
    FPalBaseCampModuleTransportItemRequirement Requirement;                           // 0x0000 (size: 0x48)
    bool bDepot;                                                                      // 0x0048 (size: 0x1)
    FPalBoundsTransform DepotLocalBoundsTransform;                                    // 0x0050 (size: 0x80)
    FGuid WorkId;                                                                     // 0x00D0 (size: 0x10)
    TMap<class FPalInstanceID, class FPalBaseCampModuleTransportItemDirection> DirectionMap; // 0x00E0 (size: 0x50)
    TMap<FName, int32> NotSatisfiedRequirementItemInfoMap;                            // 0x0130 (size: 0x50)

}; // Size: 0x180

struct FPalBaseCampModuleTransportItemTarget
{
    bool bTargetRemoved;                                                              // 0x0000 (size: 0x1)
    TMap<class FPalInstanceID, class FPalBaseCampModuleTransportItemTargetReservedInfo> ReservedInfoMap; // 0x0008 (size: 0x50)
    bool bNotExistMovePath;                                                           // 0x0058 (size: 0x1)
    bool bEnableObtainAnywhere;                                                       // 0x0059 (size: 0x1)
    TMap<FName, int32> NotReservedItemInfoMap;                                        // 0x0060 (size: 0x50)
    FGuid WorkId;                                                                     // 0x00B0 (size: 0x10)

}; // Size: 0xC0

struct FPalBaseCampModuleTransportItemTargetReservedInfo
{
    TArray<FPalStaticItemIdAndNum> ItemInfos;                                         // 0x0000 (size: 0x10)
    FGuid RequiredConcreteModelId;                                                    // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FPalBaseCampPassiveEffectMapObjectInfo
{
    TArray<FGuid> ConcreteModelInstanceIds;                                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalBaseCampPassiveEffectRepInfo : public FFastArraySerializerItem
{
    class UPalBaseCampPassiveEffectBase* Effect;                                      // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalBaseCampPassiveEffectWorkHardInfo
{
    float WorkSpeedRate;                                                              // 0x0000 (size: 0x4)
    float MoveSpeedRate;                                                              // 0x0004 (size: 0x4)
    float AffectSanityRate;                                                           // 0x0008 (size: 0x4)
    float DecreaseFullStomachRate;                                                    // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPalBaseCampRepInfo : public FFastArraySerializerItem
{
    FGuid ID;                                                                         // 0x000C (size: 0x10)
    class UPalBaseCampModel* BaseCamp;                                                // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalBaseCampSaveData : public FPalBinaryMemory
{
    FPalBaseCampSaveData_WorkerDirector WorkerDirector;                               // 0x0010 (size: 0x10)
    FPalBaseCampSaveData_WorkCollection WorkCollection;                               // 0x0020 (size: 0x10)
    TMap<class EPalBaseCampModuleType, class FPalBaseCampSaveData_Module> ModuleMap;  // 0x0030 (size: 0x50)

}; // Size: 0x80

struct FPalBaseCampSaveData_Module : public FPalBinaryMemory
{
}; // Size: 0x10

struct FPalBaseCampSaveData_Module_PassiveEffect : public FPalBinaryMemory
{
}; // Size: 0x10

struct FPalBaseCampSaveData_WorkCollection : public FPalBinaryMemory
{
}; // Size: 0x10

struct FPalBaseCampSaveData_WorkerDirector : public FPalBinaryMemory
{
}; // Size: 0x10

struct FPalBaseCampSignificanceInfo
{
    float DistanceInRangeFromPlayer;                                                  // 0x0000 (size: 0x4)
    float TickInterval;                                                               // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalBaseCampTaskCheckedData
{
    int32 completedTaskNum;                                                           // 0x0000 (size: 0x4)
    TMap<FName, int32> buildObjectNumMap;                                             // 0x0008 (size: 0x50)
    int32 workerNum;                                                                  // 0x0058 (size: 0x4)

}; // Size: 0x60

struct FPalBaseCampTaskDataSet
{
    TArray<FPalBaseCampTaskData_BuildObject> requireBuildObjects;                     // 0x0000 (size: 0x10)
    FPalBaseCampTaskData_WorkerNum requirePalNum;                                     // 0x0010 (size: 0x14)

}; // Size: 0x28

struct FPalBaseCampTaskDataSet_TableRow : public FTableRowBase
{
    int32 Level;                                                                      // 0x0008 (size: 0x4)
    int32 workerNum;                                                                  // 0x000C (size: 0x4)
    FName WorkerNum_IncompleteMsgID;                                                  // 0x0010 (size: 0x8)
    FName WorkerNum_CompleteMsgID;                                                    // 0x0018 (size: 0x8)
    FName BuildObject1;                                                               // 0x0020 (size: 0x8)
    int32 BuildObjectNum1;                                                            // 0x0028 (size: 0x4)
    FName BuildObject1_IncompleteMsgID;                                               // 0x002C (size: 0x8)
    FName BuildObject1_CompleteMsgID;                                                 // 0x0034 (size: 0x8)
    FName BuildObject2;                                                               // 0x003C (size: 0x8)
    int32 BuildObjectNum2;                                                            // 0x0044 (size: 0x4)
    FName BuildObject2_IncompleteMsgID;                                               // 0x0048 (size: 0x8)
    FName BuildObject2_CompleteMsgID;                                                 // 0x0050 (size: 0x8)
    FName BuildObject3;                                                               // 0x0058 (size: 0x8)
    int32 BuildObjectNum3;                                                            // 0x0060 (size: 0x4)
    FName BuildObject3_IncompleteMsgID;                                               // 0x0064 (size: 0x8)
    FName BuildObject3_CompleteMsgID;                                                 // 0x006C (size: 0x8)

}; // Size: 0x78

struct FPalBaseCampTaskData_BuildObject
{
    FName incompleteMsgID;                                                            // 0x0000 (size: 0x8)
    FName completeMsgID;                                                              // 0x0008 (size: 0x8)
    FPalDataTableRowName_MapObjectData mapObjectRowName;                              // 0x0010 (size: 0x8)
    int32 requireNum;                                                                 // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FPalBaseCampTaskData_WorkerNum
{
    FName incompleteMsgID;                                                            // 0x0000 (size: 0x8)
    FName completeMsgID;                                                              // 0x0008 (size: 0x8)
    int32 requireNum;                                                                 // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalBaseCampWorkAssignRequest
{
}; // Size: 0x30

struct FPalBaseCampWorkCollectionStashInfo
{
    FGameDateTime StashAtTime;                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalBaseCampWorkerEventMasterData : public FTableRowBase
{
    FName Debug_DisplayName;                                                          // 0x0008 (size: 0x8)
    EPalBaseCampWorkerEventPriority Priority;                                         // 0x0010 (size: 0x1)
    int32 TriggerSanity;                                                              // 0x0014 (size: 0x4)
    bool bAllowInterruptRecoverHungry;                                                // 0x0018 (size: 0x1)
    bool bAllowInterruptSleep;                                                        // 0x0019 (size: 0x1)
    bool bAssignableWork;                                                             // 0x001A (size: 0x1)
    bool bAssignableFixedWork;                                                        // 0x001B (size: 0x1)
    int32 TriggerSkipCount;                                                           // 0x001C (size: 0x4)
    EPalLogPriority logPriority;                                                      // 0x0020 (size: 0x1)
    EPalLogContentToneType LogTone;                                                   // 0x0021 (size: 0x1)
    bool Invalid;                                                                     // 0x0022 (size: 0x1)

}; // Size: 0x28

struct FPalBaseCampWorkerFindPreferredWorkInfoCache
{
    TArray<class UPalWorkBase*> SortedByPriorityDescWorks;                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalBaseCampWorkerMoveExtraParameter
{
}; // Size: 0x90

struct FPalBaseCampWorkerSickMasterData : public FTableRowBase
{
    EPalBaseCampWorkerSickType SickType;                                              // 0x0008 (size: 0x1)
    int32 EffectiveItemRank;                                                          // 0x000C (size: 0x4)
    EPalFacialEyeType Facial;                                                         // 0x0010 (size: 0x1)
    int32 WorkSpeed;                                                                  // 0x0014 (size: 0x4)
    int32 MoveSpeed;                                                                  // 0x0018 (size: 0x4)
    int32 SatietyDecrease;                                                            // 0x001C (size: 0x4)
    int32 RecoveryProbabilityPercentageInPalBox;                                      // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FPalBaseCampWorkerTaskCheckResponse
{
}; // Size: 0x50

struct FPalBelongInfo
{
}; // Size: 0x8

struct FPalBinaryMemory
{
    TArray<uint8> RawData;                                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalBodyInstanceParameter
{
    int32 InstanceBodyIndex;                                                          // 0x0000 (size: 0x4)
    int16 InstanceBoneIndex;                                                          // 0x0004 (size: 0x2)
    float LinearDamping;                                                              // 0x0008 (size: 0x4)
    float AngularDamping;                                                             // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPalBossBattleInstanceModelCreateParameter
{
    TSoftClassPtr<APalCutsceneActor> IntroCutsceneActor;                              // 0x0008 (size: 0x30)
    class UDataLayerAsset* ReservedDataLayerAsset;                                    // 0x0038 (size: 0x8)
    TSoftObjectPtr<UAkAudioEvent> BGMAudioEvent;                                      // 0x0040 (size: 0x30)
    class APalBossTower* BossTower;                                                   // 0x0070 (size: 0x8)

}; // Size: 0x1A0

struct FPalBossBattleLevelInstanceLoadOperator
{
}; // Size: 0x28

struct FPalBossBattleStaticInfo
{
    TSoftClassPtr<APalCutsceneActor> IntroCutscene;                                   // 0x0000 (size: 0x30)
    class UDataLayerAsset* DataLayerAsset;                                            // 0x0030 (size: 0x8)
    FPalDataTableRowName_PalMonsterData PalID;                                        // 0x0038 (size: 0x8)
    int32 Level;                                                                      // 0x0040 (size: 0x4)
    TSoftObjectPtr<UAkAudioEvent> BGMAudioEvent;                                      // 0x0048 (size: 0x30)

}; // Size: 0x78

struct FPalBossSpawnerSaveData
{
    TMap<class FName, class bool> RespawnDisableFlag;                                 // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalBoundsTransform
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    FQuat Rotation;                                                                   // 0x0020 (size: 0x20)
    FBoxSphereBounds Bounds;                                                          // 0x0040 (size: 0x38)

}; // Size: 0x80

struct FPalBuildInstallOtherOptions
{
}; // Size: 0x2

struct FPalBuildObjectData : public FTableRowBase
{
    FName MapObjectId;                                                                // 0x0008 (size: 0x8)
    EPalBuildObjectTypeA TypeA;                                                       // 0x0010 (size: 0x1)
    int32 RedialIndex;                                                                // 0x0014 (size: 0x4)
    EPalBuildObjectTypeB TypeB;                                                       // 0x0018 (size: 0x1)
    int32 Rank;                                                                       // 0x001C (size: 0x4)
    int32 BuildCapacity;                                                              // 0x0020 (size: 0x4)
    float RequiredBuildWorkAmount;                                                    // 0x0024 (size: 0x4)
    int32 AssetValue;                                                                 // 0x0028 (size: 0x4)
    EPalEnergyType RequiredEnergyType;                                                // 0x002C (size: 0x1)
    float ConsumeEnergySpeed;                                                         // 0x0030 (size: 0x4)
    FName Material1_Id;                                                               // 0x0034 (size: 0x8)
    int32 Material1_Count;                                                            // 0x003C (size: 0x4)
    FName Material2_Id;                                                               // 0x0040 (size: 0x8)
    int32 Material2_Count;                                                            // 0x0048 (size: 0x4)
    FName Material3_Id;                                                               // 0x004C (size: 0x8)
    int32 Material3_Count;                                                            // 0x0054 (size: 0x4)
    FName Material4_Id;                                                               // 0x0058 (size: 0x8)
    int32 Material4_Count;                                                            // 0x0060 (size: 0x4)
    FName OverrideDescMsgID;                                                          // 0x0064 (size: 0x8)
    bool bInstallAtReticle;                                                           // 0x006C (size: 0x1)
    float InstallNeighborThreshold;                                                   // 0x0070 (size: 0x4)
    bool bIsInstallOnlyOnBase;                                                        // 0x0074 (size: 0x1)
    bool bIsInstallOnlyInDoor;                                                        // 0x0075 (size: 0x1)
    bool bIsInstallOnlyHubAround;                                                     // 0x0076 (size: 0x1)
    int32 InstallMaxNumInBaseCamp;                                                    // 0x0078 (size: 0x4)
    bool bInstallableNoObstacleFromCamera;                                            // 0x007C (size: 0x1)

}; // Size: 0x80

struct FPalBuildObjectDataSetTypeB
{
    EPalBuildObjectTypeB TypeB;                                                       // 0x0000 (size: 0x1)
    TArray<FPalBuildObjectData> DataArray;                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalBuildObjectIconData : public FTableRowBase
{
    TSoftObjectPtr<UTexture2D> SoftIcon;                                              // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FPalBuildObjectMaterialArray
{
    TArray<class UMaterialInterface*> Materials;                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalBuildObjectMeshDefaultSetting
{
    FName ProfileName;                                                                // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalBuildRequestDebugParameter
{
    bool bNotConsumeMaterials;                                                        // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FPalCalcCharacterDamageInfo
{
    float OtomoRate;                                                                  // 0x0000 (size: 0x4)
    int32 DefenderLevel;                                                              // 0x0004 (size: 0x4)
    int32 DefenderDefence;                                                            // 0x0008 (size: 0x4)
    EPalElementType DefenderElementType1;                                             // 0x000C (size: 0x1)
    EPalElementType DefenderElementType2;                                             // 0x000D (size: 0x1)
    float ElementStatusMultiplay;                                                     // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalCameraDOFSetting
{
    float DepthOfFieldFocalDistance;                                                  // 0x0000 (size: 0x4)
    float DepthOfFieldDepthBlurAmount;                                                // 0x0004 (size: 0x4)
    float DepthOfFieldDepthBlurRadius;                                                // 0x0008 (size: 0x4)
    float DepthOfFieldFstop;                                                          // 0x000C (size: 0x4)
    float FOV;                                                                        // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalCaptureBallEffectSettingData
{
    int32 CaptureAbsorbToBall_ParticleCount;                                          // 0x0000 (size: 0x4)
    float CaptureAbsorbToBall_Scale;                                                  // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalCaptureBonusExpRaw : public FTableRowBase
{
    int32 BonusExp;                                                                   // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FPalCapturedCageInfoDatabaseRow : public FTableRowBase
{
    FName FieldName;                                                                  // 0x0008 (size: 0x8)
    FName PalID;                                                                      // 0x0010 (size: 0x8)
    float Weight;                                                                     // 0x0018 (size: 0x4)
    int32 MinLevel;                                                                   // 0x001C (size: 0x4)
    int32 MaxLevel;                                                                   // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FPalCellCoord
{
    int64 X;                                                                          // 0x0000 (size: 0x8)
    int64 Y;                                                                          // 0x0008 (size: 0x8)
    int64 Z;                                                                          // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalCharacterAsyncTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FPalCharacterCompleteDelegateParameter
{
    EPalCharacterCompleteDelegatePriority Priority;                                   // 0x0000 (size: 0x1)
    FPalCharacterCompleteDelegateParameterCompleteDelegate CompleteDelegate;          // 0x0004 (size: 0x10)
    void PalOnCharacterCompleteInitializeParameter(class APalCharacter* InCharacter);

}; // Size: 0x14

struct FPalCharacterContainerSaveData : public FPalBinaryMemory
{
    bool bReferenceSlot;                                                              // 0x0010 (size: 0x1)
    TArray<FPalCharacterSlotSaveData> Slots;                                          // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FPalCharacterContainerSlotInfo
{
    FPalInstanceID IndividualId;                                                      // 0x0000 (size: 0x30)
    FPalCharacterSlotId SlotID;                                                       // 0x0030 (size: 0x14)

}; // Size: 0x48

struct FPalCharacterCreationColorPresetDataRow : public FTableRowBase
{
    TArray<FLinearColor> Colors;                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalCharacterCreationEyeMaterialDataRow : public FTableRowBase
{
    TSoftObjectPtr<UMaterialInstance> EyeMaterialInstance;                            // 0x0008 (size: 0x30)
    TSoftObjectPtr<UTexture2D> IconTexture;                                           // 0x0038 (size: 0x30)
    FLinearColor ShiftUIDisplayEyeColor;                                              // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FPalCharacterCreationMakeInfoPresetDataRow : public FTableRowBase
{
    FPalPlayerDataCharacterMakeInfo PresetMakeInfo;                                   // 0x0008 (size: 0x94)

}; // Size: 0xA0

struct FPalCharacterCreationMeshPresetDataRow : public FTableRowBase
{
    TSoftObjectPtr<USkeletalMesh> SkeletalMesh;                                       // 0x0008 (size: 0x30)
    TSoftObjectPtr<USkeletalMesh> SkeletalMesh_MaleHead;                              // 0x0038 (size: 0x30)
    TSoftObjectPtr<UTexture2D> IconTexture;                                           // 0x0068 (size: 0x30)
    TSoftClassPtr<UAnimInstance> ABPAsset;                                            // 0x0098 (size: 0x30)
    FLinearColor ShiftUIDisplayEyeColor;                                              // 0x00C8 (size: 0x10)
    FLinearColor ShiftUIDisplayBodyColor;                                             // 0x00D8 (size: 0x10)
    FLinearColor ShiftUIDisplayBrowColor;                                             // 0x00E8 (size: 0x10)
    FLinearColor ShiftUIDisplayHairColor;                                             // 0x00F8 (size: 0x10)

}; // Size: 0x108

struct FPalCharacterCreationPresetDataRow : public FTableRowBase
{
    FPalPlayerDataCharacterMakeInfo MakeInfo;                                         // 0x0008 (size: 0x94)
    TSoftObjectPtr<UTexture2D> IconTexture;                                           // 0x00A0 (size: 0x30)

}; // Size: 0xD0

struct FPalCharacterIconDataRow : public FTableRowBase
{
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FPalCharacterList
{
    TArray<class APalCharacter*> CharacterList;                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalCharacterParameterDatabaseRow : public FTableRowBase
{
    FName OverrideNameTextID;                                                         // 0x0008 (size: 0x8)
    FName NamePrefixID;                                                               // 0x0010 (size: 0x8)
    FName OverridePartnerSkillTextID;                                                 // 0x0018 (size: 0x8)
    bool IsPal;                                                                       // 0x0020 (size: 0x1)
    EPalTribeID Tribe;                                                                // 0x0021 (size: 0x1)
    FName BPClass;                                                                    // 0x0024 (size: 0x8)
    int32 ZukanIndex;                                                                 // 0x002C (size: 0x4)
    FString ZukanIndexSuffix;                                                         // 0x0030 (size: 0x10)
    EPalSizeType Size;                                                                // 0x0040 (size: 0x1)
    int32 Rarity;                                                                     // 0x0044 (size: 0x4)
    EPalElementType ElementType1;                                                     // 0x0048 (size: 0x1)
    EPalElementType ElementType2;                                                     // 0x0049 (size: 0x1)
    EPalGenusCategoryType GenusCategory;                                              // 0x004A (size: 0x1)
    EPalOrganizationType Organization;                                                // 0x004B (size: 0x1)
    EPalWeaponType weapon;                                                            // 0x004C (size: 0x1)
    bool WeaponEquip;                                                                 // 0x004D (size: 0x1)
    int32 HP;                                                                         // 0x0050 (size: 0x4)
    int32 MeleeAttack;                                                                // 0x0054 (size: 0x4)
    int32 ShotAttack;                                                                 // 0x0058 (size: 0x4)
    int32 Defense;                                                                    // 0x005C (size: 0x4)
    int32 Support;                                                                    // 0x0060 (size: 0x4)
    int32 CraftSpeed;                                                                 // 0x0064 (size: 0x4)
    float EnemyMaxHPRate;                                                             // 0x0068 (size: 0x4)
    float EnemyReceiveDamageRate;                                                     // 0x006C (size: 0x4)
    float EnemyInflictDamageRate;                                                     // 0x0070 (size: 0x4)
    float CaptureRateCorrect;                                                         // 0x0074 (size: 0x4)
    float ExpRatio;                                                                   // 0x0078 (size: 0x4)
    float Price;                                                                      // 0x007C (size: 0x4)
    FName AIResponse;                                                                 // 0x0080 (size: 0x8)
    FName AISightResponse;                                                            // 0x0088 (size: 0x8)
    int32 SlowWalkSpeed;                                                              // 0x0090 (size: 0x4)
    int32 WalkSpeed;                                                                  // 0x0094 (size: 0x4)
    int32 RunSpeed;                                                                   // 0x0098 (size: 0x4)
    int32 RideSprintSpeed;                                                            // 0x009C (size: 0x4)
    int32 TransportSpeed;                                                             // 0x00A0 (size: 0x4)
    bool IsBoss;                                                                      // 0x00A4 (size: 0x1)
    bool IsTowerBoss;                                                                 // 0x00A5 (size: 0x1)
    bool IsRaidBoss;                                                                  // 0x00A6 (size: 0x1)
    EPalBattleBGMType BattleBGM;                                                      // 0x00A7 (size: 0x1)
    bool IgnoreLeanBack;                                                              // 0x00A8 (size: 0x1)
    bool IgnoreBlowAway;                                                              // 0x00A9 (size: 0x1)
    int32 MaxFullStomach;                                                             // 0x00AC (size: 0x4)
    float FullStomachDecreaseRate;                                                    // 0x00B0 (size: 0x4)
    int32 FoodAmount;                                                                 // 0x00B4 (size: 0x4)
    int32 ViewingDistance;                                                            // 0x00B8 (size: 0x4)
    int32 ViewingAngle;                                                               // 0x00BC (size: 0x4)
    float HearingRate;                                                                // 0x00C0 (size: 0x4)
    bool NooseTrap;                                                                   // 0x00C4 (size: 0x1)
    bool Nocturnal;                                                                   // 0x00C5 (size: 0x1)
    int32 BiologicalGrade;                                                            // 0x00C8 (size: 0x4)
    bool Predator;                                                                    // 0x00CC (size: 0x1)
    bool Edible;                                                                      // 0x00CD (size: 0x1)
    int32 Stamina;                                                                    // 0x00D0 (size: 0x4)
    int32 MaleProbability;                                                            // 0x00D4 (size: 0x4)
    int32 CombiRank;                                                                  // 0x00D8 (size: 0x4)
    int32 WorkSuitability_EmitFlame;                                                  // 0x00DC (size: 0x4)
    int32 WorkSuitability_Watering;                                                   // 0x00E0 (size: 0x4)
    int32 WorkSuitability_Seeding;                                                    // 0x00E4 (size: 0x4)
    int32 WorkSuitability_GenerateElectricity;                                        // 0x00E8 (size: 0x4)
    int32 WorkSuitability_Handcraft;                                                  // 0x00EC (size: 0x4)
    int32 WorkSuitability_Collection;                                                 // 0x00F0 (size: 0x4)
    int32 WorkSuitability_Deforest;                                                   // 0x00F4 (size: 0x4)
    int32 WorkSuitability_Mining;                                                     // 0x00F8 (size: 0x4)
    int32 WorkSuitability_OilExtraction;                                              // 0x00FC (size: 0x4)
    int32 WorkSuitability_ProductMedicine;                                            // 0x0100 (size: 0x4)
    int32 WorkSuitability_Cool;                                                       // 0x0104 (size: 0x4)
    int32 WorkSuitability_Transport;                                                  // 0x0108 (size: 0x4)
    int32 WorkSuitability_MonsterFarm;                                                // 0x010C (size: 0x4)
    FName PassiveSkill1;                                                              // 0x0110 (size: 0x8)
    FName PassiveSkill2;                                                              // 0x0118 (size: 0x8)
    FName PassiveSkill3;                                                              // 0x0120 (size: 0x8)
    FName PassiveSkill4;                                                              // 0x0128 (size: 0x8)

}; // Size: 0x130

struct FPalCharacterParameterStorageSaveData
{
    TArray<FPalCharacterStoredParameterInfoSaveData> StoredParameterInfoSaveData;     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalCharacterParameter_Work
{
    FGuid MapObjectInstanceIdApproachTo;                                              // 0x0000 (size: 0x10)
    bool bApproachToAssignedLocation;                                                 // 0x0010 (size: 0x1)
    float RepairRequiredWorkAmount;                                                   // 0x0014 (size: 0x4)
    FFlagContainer NotWorkableFlag;                                                   // 0x0028 (size: 0x50)

}; // Size: 0x78

struct FPalCharacterSlotId
{
    FPalContainerId ContainerId;                                                      // 0x0000 (size: 0x10)
    int32 SlotIndex;                                                                  // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalCharacterSlotSaveData : public FPalBinaryMemory
{
    FPalInstanceID IndividualId;                                                      // 0x0010 (size: 0x30)
    EPalTribeID PermissionTribeID;                                                    // 0x0040 (size: 0x1)

}; // Size: 0x48

struct FPalCharacterSlotUpdateInfo
{
    FPalContainerId ContainerId;                                                      // 0x0000 (size: 0x10)
    int32 SlotIndex;                                                                  // 0x0010 (size: 0x4)
    FPalInstanceID InstanceId;                                                        // 0x0018 (size: 0x30)

}; // Size: 0x48

struct FPalCharacterStoredParameterId
{
    FGuid ID;                                                                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalCharacterStoredParameterInfo
{
    FPalIndividualCharacterSaveParameter SaveParameter;                               // 0x0000 (size: 0x280)
    FGameDateTime StoredAt;                                                           // 0x0280 (size: 0x8)
    FGuid LostPlayerUId;                                                              // 0x0288 (size: 0x10)

}; // Size: 0x298

struct FPalCharacterStoredParameterInfoSaveData
{
    FPalCharacterStoredParameterId ID;                                                // 0x0000 (size: 0x10)
    FPalIndividualCharacterSaveParameterSaveData SaveParameter;                       // 0x0010 (size: 0x10)
    FGameDateTime StoredAt;                                                           // 0x0020 (size: 0x8)
    FGuid LostPlayerUId;                                                              // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FPalCharacterUpgradeMasterData : public FTableRowBase
{
    int32 Rank;                                                                       // 0x0008 (size: 0x4)
    FName RequiredStaticItemId;                                                       // 0x000C (size: 0x8)
    int32 RequiredItemNum;                                                            // 0x0014 (size: 0x4)
    int32 ResetRequiredMoney;                                                         // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalChatMessage
{
    EPalChatCategory Category;                                                        // 0x0000 (size: 0x1)
    FString Sender;                                                                   // 0x0008 (size: 0x10)
    FGuid SenderPlayerUId;                                                            // 0x0018 (size: 0x10)
    FString Message;                                                                  // 0x0028 (size: 0x10)
    FGuid ReceiverPlayerUId;                                                          // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FPalCheckStuckInfo
{
}; // Size: 0x20

struct FPalCollectionRankDefineData
{
    float DropNumRate;                                                                // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FPalCombiUniqueDatabaseRow : public FTableRowBase
{
    EPalTribeID ParentTribeA;                                                         // 0x0008 (size: 0x1)
    EPalTribeID ParentTribeB;                                                         // 0x0009 (size: 0x1)
    FName ChildCharacterID;                                                           // 0x000C (size: 0x8)

}; // Size: 0x18

struct FPalCommonQuestRewardData
{
    int32 Exp;                                                                        // 0x0000 (size: 0x4)
    int32 TechnologyPoint;                                                            // 0x0004 (size: 0x4)
    TMap<FPalDataTableRowName_ItemData, int32> Items;                                 // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FPalCompletedQuestSaveData
{
    FName QuestName;                                                                  // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalContainerBelongInfo : public FPalBelongInfo
{
}; // Size: 0x8

struct FPalContainerCreateExtraParameter
{
    bool bIsWatchAllPlayer;                                                           // 0x0000 (size: 0x1)
    bool bIsSyncEnable;                                                               // 0x0001 (size: 0x1)
    bool bIgnoreOnSave;                                                               // 0x0002 (size: 0x1)
    EPalContainerOperationRestrictType OperationRestrictType;                         // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FPalContainerId
{
    FGuid ID;                                                                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalContainerInfo
{
    FPalContainerId ContainerId;                                                      // 0x0008 (size: 0x10)
    int32 SlotNum;                                                                    // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalContainerInitializeParameter
{
    FPalContainerId ID;                                                               // 0x0000 (size: 0x10)
    int32 SlotNum;                                                                    // 0x0010 (size: 0x4)
    bool bReferenceSlot;                                                              // 0x0014 (size: 0x1)
    bool bIgnoreOnSave;                                                               // 0x0015 (size: 0x1)
    EPalContainerOperationRestrictType OperationRestrictType;                         // 0x0016 (size: 0x1)

}; // Size: 0x18

struct FPalCoopSkillAssaultrifleModeCandidateLocation
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    float Distance;                                                                   // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalCoopSkillModuleAssignPassiveSkillNames
{
    TArray<FPalDataTableRowName_PassiveSkillData> AssignSkillNames;                   // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalCoopSkillSearchEffectParameter
{
    FVector Origin;                                                                   // 0x0000 (size: 0x18)
    float RadiusFrom;                                                                 // 0x0018 (size: 0x4)
    float RadiusTo;                                                                   // 0x001C (size: 0x4)
    float ExtRadiusPerSec;                                                            // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FPalCoopSkillSearchResultParameter
{
    EPalCoopSkillSearchType SearchType;                                               // 0x0000 (size: 0x1)
    FVector Location;                                                                 // 0x0008 (size: 0x18)
    FGuid InstanceId;                                                                 // 0x0020 (size: 0x10)
    FPalInstanceID IndividualId;                                                      // 0x0030 (size: 0x30)
    FGuid RequestPlayerUId;                                                           // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FPalCrimeInstanceCreateParameter
{
    FName CrimeId;                                                                    // 0x0000 (size: 0x8)
    FGuid TargetId;                                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalCrimeMasterData : public FTableRowBase
{
    FName CrimeNameTextId;                                                            // 0x0008 (size: 0x8)
    int32 BaseReward;                                                                 // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FPalCrimeStateInfo
{
    TMap<class FGuid, class FDateTime> CrimeStateFinishTimeMap;                       // 0x0000 (size: 0x50)
    TArray<FGuid> CrimeStateArray;                                                    // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FPalCustomMarkerSaveData
{
    FVector IconLocation;                                                             // 0x0000 (size: 0x18)
    int32 IconType;                                                                   // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalDamageInfo
{
    int32 NativeDamageValue;                                                          // 0x0000 (size: 0x4)
    EPalWazaCategory Category;                                                        // 0x0004 (size: 0x1)
    bool IsBlowAttack;                                                                // 0x0005 (size: 0x1)
    bool IsLeanBack;                                                                  // 0x0006 (size: 0x1)
    FVector BlowVelocity;                                                             // 0x0008 (size: 0x18)
    EPalBodyPartsType BodyPartsType;                                                  // 0x0020 (size: 0x1)
    int32 AttackerLevel;                                                              // 0x0024 (size: 0x4)
    EPalElementType AttackElementType;                                                // 0x0028 (size: 0x1)
    FGuid AttackerGroupID;                                                            // 0x002C (size: 0x10)
    class AActor* Attacker;                                                           // 0x0040 (size: 0x8)
    class AActor* OverrideNetworkOwner;                                               // 0x0048 (size: 0x8)
    EPalAttackType AttackType;                                                        // 0x0050 (size: 0x1)
    FVector HitLocation;                                                              // 0x0058 (size: 0x18)
    FName FoliageModelId;                                                             // 0x0070 (size: 0x8)
    TArray<FPalFoliageInstanceId> FoliageInstanceIds;                                 // 0x0078 (size: 0x10)
    EPalAdditionalEffectType EffectType1;                                             // 0x0088 (size: 0x1)
    int32 EffectValue1;                                                               // 0x008C (size: 0x4)
    float EffectValueEx1;                                                             // 0x0090 (size: 0x4)
    EPalAdditionalEffectType EffectType2;                                             // 0x0094 (size: 0x1)
    int32 EffectValue2;                                                               // 0x0098 (size: 0x4)
    float EffectValueEx2;                                                             // 0x009C (size: 0x4)
    float SneakAttackRate;                                                            // 0x00A0 (size: 0x4)
    bool PlaySneakAttackEffect;                                                       // 0x00A4 (size: 0x1)
    float DamageRatePerCollision;                                                     // 0x00A8 (size: 0x4)
    TArray<FPalSpecialAttackRateInfo> SpecialAttackRateInfos;                         // 0x00B0 (size: 0x10)
    EPalDamageAnimationReactionType DamageReactionAnimationType;                      // 0x00C0 (size: 0x1)
    bool bAttackableToFriend;                                                         // 0x00C1 (size: 0x1)
    bool NoDamage;                                                                    // 0x00C2 (size: 0x1)
    bool IgnoreShield;                                                                // 0x00C3 (size: 0x1)
    bool UIDamageTextOverride_DoubleRegist;                                           // 0x00C4 (size: 0x1)
    EPalPlayerDamageCameraShakeCategory CameraShake;                                  // 0x00C5 (size: 0x1)
    EPalSizeType ForceRagdollSize;                                                    // 0x00C6 (size: 0x1)
    bool bApplyNativeDamageValue;                                                     // 0x00C7 (size: 0x1)
    bool IgnorePlayerEquipItemDamage;                                                 // 0x00C8 (size: 0x1)

}; // Size: 0xD0

struct FPalDamageRactionInfo
{
    bool IsBlow;                                                                      // 0x0000 (size: 0x1)
    FVector BlowVelocity;                                                             // 0x0008 (size: 0x18)
    bool IsLeanBackAnime;                                                             // 0x0020 (size: 0x1)
    bool IsStan;                                                                      // 0x0021 (size: 0x1)
    bool IsLargeDown;                                                                 // 0x0022 (size: 0x1)
    FVector HitLocation;                                                              // 0x0028 (size: 0x18)

}; // Size: 0x40

struct FPalDamageResult
{
    int32 Damage;                                                                     // 0x0000 (size: 0x4)
    class AActor* Attacker;                                                           // 0x0008 (size: 0x8)
    class AActor* Defender;                                                           // 0x0010 (size: 0x8)
    FVector BlowVelocity;                                                             // 0x0018 (size: 0x18)
    FVector HitLocation;                                                              // 0x0030 (size: 0x18)
    EPalDamageAnimationReactionType DamageReactionAnimationType;                      // 0x0048 (size: 0x1)
    bool IgnoreShield;                                                                // 0x0049 (size: 0x1)
    bool IsPlayedLeanBack;                                                            // 0x004A (size: 0x1)
    EPalPlayerDamageCameraShakeCategory CameraShake;                                  // 0x004B (size: 0x1)
    bool IgnorePlayerEquipItemDamage;                                                 // 0x004C (size: 0x1)
    EPalElementType AttackElementType;                                                // 0x004D (size: 0x1)

}; // Size: 0x50

struct FPalDataTableRowName_BaseCampWorkerEventData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_CrimeMasterData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_DungeonSpawnAreaData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_FarmCropData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_FieldLotteryNameData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_GameProgressPreset
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_ItemData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_ItemProductData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_ItemShopCreateData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_ItemShopLotteryData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_MapObjectData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_NPCUniqueData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_NoteData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_PalHumanData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_PalMonsterData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_PalShopCreateData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_PassiveSkillData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_RecipeTechnologyData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_SoundID
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_UIInputAction
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDeadInfo
{
    int32 LastDamage;                                                                 // 0x0000 (size: 0x4)
    class AActor* LastAttacker;                                                       // 0x0008 (size: 0x8)
    class AActor* SelfActor;                                                          // 0x0010 (size: 0x8)
    FVector BlowVelocity;                                                             // 0x0018 (size: 0x18)
    FVector HitLocation;                                                              // 0x0030 (size: 0x18)
    EPalWazaID SelfDestructWaza;                                                      // 0x0048 (size: 0x1)
    EPalDeadType DeadType;                                                            // 0x0049 (size: 0x1)

}; // Size: 0x50

struct FPalDeathPenaltyInfo
{
    FGuid DeathPenaID;                                                                // 0x0000 (size: 0x10)
    FGuid DeathPlayerID;                                                              // 0x0010 (size: 0x10)
    FVector PlayerDeathLocation;                                                      // 0x0020 (size: 0x18)
    FVector DropItemLocation;                                                         // 0x0038 (size: 0x18)
    TArray<FPalItemAndNum> DropItemList;                                              // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FPalDeathPenaltyList
{
    TArray<FPalDeathPenaltyInfo> DeathPenaArray;                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalDebugAttachPassiveSkillInfo
{
    TArray<FPalDataTableRowName_PassiveSkillData> skill;                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalDebugCharacterStatusRank
{
    EPalCharacterStatusOperationName OperationName;                                   // 0x0000 (size: 0x1)
    int32 Rank;                                                                       // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalDebugInfoSet
{
}; // Size: 0x30

struct FPalDebugItemCreateInfo
{
    FPalDataTableRowName_ItemData itemRowName;                                        // 0x0000 (size: 0x8)
    int32 itemNum;                                                                    // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalDebugOtomoPalInfo
{
    FPalDataTableRowName_PalMonsterData PalName;                                      // 0x0000 (size: 0x8)
    int32 Level;                                                                      // 0x0008 (size: 0x4)
    int32 Rank;                                                                       // 0x000C (size: 0x4)
    TArray<EPalWazaID> WazaList;                                                      // 0x0010 (size: 0x10)
    TArray<FPalDataTableRowName_PassiveSkillData> PassiveSkill;                       // 0x0020 (size: 0x10)
    TArray<FPalDebugCharacterStatusRank> StatusRank;                                  // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FPalDebugPalCaptureInfo
{
    FPalDataTableRowName_PalMonsterData PalName;                                      // 0x0000 (size: 0x8)
    int32 Num;                                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalDeforestRankDefineData
{
    float DamageRate;                                                                 // 0x0000 (size: 0x4)
    EPalMapObjectMaterialSubType MaterialSubType;                                     // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FPalDropCharacterExtraParameter
{
    FGuid DropPlayerUId;                                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalDropItemDatabaseRow : public FTableRowBase
{
    FName CharacterID;                                                                // 0x0008 (size: 0x8)
    int32 Level;                                                                      // 0x0010 (size: 0x4)
    FName ItemId1;                                                                    // 0x0014 (size: 0x8)
    float Rate1;                                                                      // 0x001C (size: 0x4)
    int32 min1;                                                                       // 0x0020 (size: 0x4)
    int32 Max1;                                                                       // 0x0024 (size: 0x4)
    FName ItemId2;                                                                    // 0x0028 (size: 0x8)
    float Rate2;                                                                      // 0x0030 (size: 0x4)
    int32 min2;                                                                       // 0x0034 (size: 0x4)
    int32 Max2;                                                                       // 0x0038 (size: 0x4)
    FName ItemId3;                                                                    // 0x003C (size: 0x8)
    float Rate3;                                                                      // 0x0044 (size: 0x4)
    int32 min3;                                                                       // 0x0048 (size: 0x4)
    int32 Max3;                                                                       // 0x004C (size: 0x4)
    FName ItemId4;                                                                    // 0x0050 (size: 0x8)
    float Rate4;                                                                      // 0x0058 (size: 0x4)
    int32 min4;                                                                       // 0x005C (size: 0x4)
    int32 Max4;                                                                       // 0x0060 (size: 0x4)
    FName ItemId5;                                                                    // 0x0064 (size: 0x8)
    float Rate5;                                                                      // 0x006C (size: 0x4)
    int32 min5;                                                                       // 0x0070 (size: 0x4)
    int32 Max5;                                                                       // 0x0074 (size: 0x4)
    FName ItemId6;                                                                    // 0x0078 (size: 0x8)
    float Rate6;                                                                      // 0x0080 (size: 0x4)
    int32 min6;                                                                       // 0x0084 (size: 0x4)
    int32 Max6;                                                                       // 0x0088 (size: 0x4)
    FName ItemId7;                                                                    // 0x008C (size: 0x8)
    float Rate7;                                                                      // 0x0094 (size: 0x4)
    int32 min7;                                                                       // 0x0098 (size: 0x4)
    int32 Max7;                                                                       // 0x009C (size: 0x4)
    FName ItemId8;                                                                    // 0x00A0 (size: 0x8)
    float Rate8;                                                                      // 0x00A8 (size: 0x4)
    int32 min8;                                                                       // 0x00AC (size: 0x4)
    int32 Max8;                                                                       // 0x00B0 (size: 0x4)
    FName ItemId9;                                                                    // 0x00B4 (size: 0x8)
    float Rate9;                                                                      // 0x00BC (size: 0x4)
    int32 min9;                                                                       // 0x00C0 (size: 0x4)
    int32 Max9;                                                                       // 0x00C4 (size: 0x4)
    FName ItemId10;                                                                   // 0x00C8 (size: 0x8)
    float Rate10;                                                                     // 0x00D0 (size: 0x4)
    int32 min10;                                                                      // 0x00D4 (size: 0x4)
    int32 Max10;                                                                      // 0x00D8 (size: 0x4)

}; // Size: 0xE0

struct FPalDropItemInfo
{
}; // Size: 0x28

struct FPalDroppedPalProductDataForShop
{
    FPalCharacterStoredParameterId StoredParameterId;                                 // 0x0000 (size: 0x10)
    FPalIndividualCharacterSaveParameter SaveParameter;                               // 0x0010 (size: 0x280)

}; // Size: 0x290

struct FPalDungeonDataLayerAssetSet
{
    TArray<class UDataLayerAsset*> DataLayers;                                        // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalDungeonEnemySpawnerData : public FTableRowBase
{
    FName SpawnAreaId;                                                                // 0x0008 (size: 0x8)
    EPalDungeonEnemySpawnerRankType RankType;                                         // 0x0010 (size: 0x1)
    float WeightInSpawnAreaAndRank;                                                   // 0x0014 (size: 0x4)
    TSoftClassPtr<APalNPCSpawnerBase> SpawnerBlueprintSoftClass;                      // 0x0018 (size: 0x30)
    FName SpawnerName;                                                                // 0x0048 (size: 0x8)

}; // Size: 0x50

struct FPalDungeonInfoParameter
{
    FText DungeonName;                                                                // 0x0000 (size: 0x18)
    int32 Level;                                                                      // 0x0018 (size: 0x4)
    float DisappearRemainSeconds;                                                     // 0x001C (size: 0x4)

}; // Size: 0x28

struct FPalDungeonInstanceModelCreateParameter
{
    class UDataLayerAsset* ReservedDataLayerAsset;                                    // 0x0060 (size: 0x8)

}; // Size: 0x68

struct FPalDungeonItemSpawnerData : public FTableRowBase
{
    FName SpawnAreaId;                                                                // 0x0008 (size: 0x8)
    EPalDungeonItemSpawnerType Type;                                                  // 0x0010 (size: 0x1)
    FName ItemFieldLotteryName;                                                       // 0x0014 (size: 0x8)

}; // Size: 0x20

struct FPalDungeonLevelData : public FTableRowBase
{
    FName SpawnAreaId;                                                                // 0x0008 (size: 0x8)
    float WeightInSpawnArea;                                                          // 0x0010 (size: 0x4)
    FName LevelName;                                                                  // 0x0014 (size: 0x8)

}; // Size: 0x20

struct FPalDungeonLevelInstanceLoadOperator
{
}; // Size: 0x28

struct FPalDungeonMarkerPointData
{
    FGuid MarkerPointId;                                                              // 0x0000 (size: 0x10)
    TArray<FName> SpawnAreaIds;                                                       // 0x0010 (size: 0x10)
    FTransform Transform;                                                             // 0x0020 (size: 0x60)
    FPalDungeonMarkerPointSpawnParameter SpawnParameter;                              // 0x0080 (size: 0x10)
    TSubclassOf<class APalDungeonEntrance> EntranceClass;                             // 0x0090 (size: 0x8)
    FGuid ConnectedDungeonInstanceId;                                                 // 0x00A0 (size: 0x10)

}; // Size: 0xB0

struct FPalDungeonMarkerPointDataSet
{
    TArray<FPalDungeonMarkerPointData> MarkerPoints;                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalDungeonMarkerPointSpawnParameter
{
    float RespawnInterval;                                                            // 0x0000 (size: 0x4)
    float DisappearInterval;                                                          // 0x0004 (size: 0x4)
    float RespawnProbability;                                                         // 0x0008 (size: 0x4)
    float DisappearIntervalAfterDefeatBoss;                                           // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPalDungeonPointMarkerSaveData
{
    FGuid MarkerPointId;                                                              // 0x0000 (size: 0x10)
    FGameDateTime NextRespawnGameTime;                                                // 0x0010 (size: 0x8)
    FGuid ConnectedDungeonInstanceId;                                                 // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FPalDungeonSaveData
{
    FGuid InstanceId;                                                                 // 0x0000 (size: 0x10)
    EPalDungeonType DungeonType;                                                      // 0x0010 (size: 0x1)
    FGuid MarkerPointId;                                                              // 0x0014 (size: 0x10)
    FName DungeonSpawnAreaId;                                                         // 0x0024 (size: 0x8)
    FName DungeonLevelName;                                                           // 0x002C (size: 0x8)
    EPalDungeonInstanceBossState BossState;                                           // 0x0034 (size: 0x1)
    FName EnemySpawnerDataBossRowName;                                                // 0x0038 (size: 0x8)
    FGameDateTime DisappearTimeAt;                                                    // 0x0040 (size: 0x8)
    int32 ReservedDataLayerAssetIndex;                                                // 0x0048 (size: 0x4)
    FPalStageInstanceId StageInstanceId;                                              // 0x004C (size: 0x14)
    TArray<FPalMapObjectSaveData> MapObjectSaveData;                                  // 0x0060 (size: 0x10)
    FGameDateTime RespawnBossTimeAt;                                                  // 0x0070 (size: 0x8)

}; // Size: 0x78

struct FPalDungeonSpawnAreaData : public FTableRowBase
{
    FName DungeonNameTextId;                                                          // 0x0008 (size: 0x8)
    FName PostfixTextId;                                                              // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalDynamicItemDataInfo
{
    class UPalDynamicItemDataBase* ItemData;                                          // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FPalDynamicItemDisposeReserveInfo
{
}; // Size: 0x20

struct FPalDynamicItemDisposeWaitNotifyInfo
{
    TArray<FPalDynamicItemId> DynamicItemIds;                                         // 0x0000 (size: 0x10)
    TArray<int32> WaitPlayerIds;                                                      // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FPalDynamicItemId
{
    FGuid CreatedWorldId;                                                             // 0x0000 (size: 0x10)
    FGuid LocalIdInCreatedWorld;                                                      // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FPalDynamicItemIdArray
{
}; // Size: 0x10

struct FPalDynamicItemInfo
{
    FPalItemSlotId SlotID;                                                            // 0x0000 (size: 0x14)
    class UPalDynamicItemDataBase* DynamicItemData;                                   // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FPalDynamicItemSaveData : public FPalBinaryMemory
{
    FPalDynamicItemId ID;                                                             // 0x0010 (size: 0x20)
    FName StaticItemId;                                                               // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FPalEachDamageRactionInfo
{
    class AActor* Attacker;                                                           // 0x0000 (size: 0x8)
    bool IsBlow;                                                                      // 0x0008 (size: 0x1)
    bool IsLeanBackAnime;                                                             // 0x0009 (size: 0x1)
    bool IsStan;                                                                      // 0x000A (size: 0x1)
    EPalWazaCategory WazaCategory;                                                    // 0x000B (size: 0x1)

}; // Size: 0x10

struct FPalEditorItemActorClassTableRow : public FTableRowBase
{
    FName ClassName;                                                                  // 0x0008 (size: 0x8)
    TSoftClassPtr<AActor> actorClass;                                                 // 0x0010 (size: 0x30)

}; // Size: 0x40

struct FPalEditorItemDynamicClassTableRow : public FTableRowBase
{
    FName ClassName;                                                                  // 0x0008 (size: 0x8)
    TSubclassOf<class UPalDynamicItemDataBase> DynamicClass;                          // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalEditorItemIconTableRow : public FTableRowBase
{
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FPalEditorItemStaticClassTableRow : public FTableRowBase
{
    FName ClassName;                                                                  // 0x0008 (size: 0x8)
    TSubclassOf<class UPalStaticItemDataBase> StaticClass;                            // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalEditorItemStaticMeshTableRow : public FTableRowBase
{
    FName StaticMeshName;                                                             // 0x0008 (size: 0x8)
    TSoftObjectPtr<UStaticMesh> StaticMeshPath;                                       // 0x0010 (size: 0x30)

}; // Size: 0x40

struct FPalEggRankInfo
{
    int32 PalRarity;                                                                  // 0x0000 (size: 0x4)
    float EggScale;                                                                   // 0x0004 (size: 0x4)
    float HatchingSpeedDivisionRate;                                                  // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalEnemyCampSaveData
{
    TMap<class FName, class FPalEnemyCampStatus> EnemyCampStatusMap;                  // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalEnemyCampStatus
{
    bool bIsSpawned;                                                                  // 0x0000 (size: 0x1)
    bool bIsEnemyAllDead;                                                             // 0x0001 (size: 0x1)
    bool bIsClear;                                                                    // 0x0002 (size: 0x1)
    bool bRewardReceived;                                                             // 0x0003 (size: 0x1)
    FName RewardPalId;                                                                // 0x0004 (size: 0x8)
    int32 RewardPalLevel;                                                             // 0x000C (size: 0x4)
    FDateTime ClearDate;                                                              // 0x0010 (size: 0x8)
    float ElapsedTime;                                                                // 0x0018 (size: 0x4)
    FDateTime LastCalcDate;                                                           // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalEquipWeaponInfo
{
    FPalContainerId ContainerId;                                                      // 0x0000 (size: 0x10)
    class APalMonsterEquipWeaponBase* SpawnedWeapon;                                  // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalExpDatabaseRaw : public FTableRowBase
{
    int32 DropEXP;                                                                    // 0x0008 (size: 0x4)
    int32 NextEXP;                                                                    // 0x000C (size: 0x4)
    int32 PalNextEXP;                                                                 // 0x0010 (size: 0x4)
    int32 TotalEXP;                                                                   // 0x0014 (size: 0x4)
    int32 PalTotalEXP;                                                                // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalFarmCropGrowupProcessSet
{
    EPalFarmCropState State;                                                          // 0x0000 (size: 0x1)
    FComponentReference TargetCompRef;                                                // 0x0008 (size: 0x28)
    float ProcessRate;                                                                // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FPalFastBaseCampPassiveEffectRepInfoArray : public FFastArraySerializer
{
    TArray<FPalBaseCampPassiveEffectRepInfo> Items;                                   // 0x0108 (size: 0x10)

}; // Size: 0x118

struct FPalFastGuildPlayerInfoRepInfoArray : public FFastArraySerializer
{
    TArray<FPalGuildPlayerInfoRepInfo> Items;                                         // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFastMapObjectModelEffectRepInfoArray : public FFastArraySerializer
{
    TArray<FPalMapObjectModelEffectRepInfo> Items;                                    // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFastMapObjectModuleRepInfoArray : public FFastArraySerializer
{
    TArray<FPalMapObjectModuleRepInfo> Items;                                         // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFastStageModelRepInfoArray : public FFastArraySerializer
{
    TArray<FPalStageModelRepInfo> Items;                                              // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFastWorkAssignRepInfoArray : public FFastArraySerializer
{
    TArray<FPalWorkAssignRepInfo> Items;                                              // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFieldLotteryName : public FTableRowBase
{
    float ItemSlot1_ProbabilityPercent;                                               // 0x0008 (size: 0x4)
    float ItemSlot2_ProbabilityPercent;                                               // 0x000C (size: 0x4)
    float ItemSlot3_ProbabilityPercent;                                               // 0x0010 (size: 0x4)
    float ItemSlot4_ProbabilityPercent;                                               // 0x0014 (size: 0x4)
    float ItemSlot5_ProbabilityPercent;                                               // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalFixupParameterForSaveData
{
    TSet<FPalInstanceID> UsedInstanceIDs;                                             // 0x0000 (size: 0x50)
    TSet<FPalContainerId> UsedContainerIDs;                                           // 0x0050 (size: 0x50)
    TSet<FPalDynamicItemId> UsedDynamicItemIDs;                                       // 0x00A0 (size: 0x50)

}; // Size: 0xF0

struct FPalFoliageGridInstanceMap
{
    TMap<class FPalFoliageInstanceId, class UPalFoliageInstance*> InstanceMap;        // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalFoliageGridSaveData
{
    TMap<class FName, class FPalFoliageSaveData> ModelMap;                            // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalFoliageIdentifiableInfo
{
    FPalCellCoord CellCoord;                                                          // 0x0000 (size: 0x18)
    FName ModelId;                                                                    // 0x0018 (size: 0x8)
    FPalFoliageInstanceId InstanceId;                                                 // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FPalFoliageInstallData
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    FRotator Rotator;                                                                 // 0x0018 (size: 0x18)
    FVector Scale3D;                                                                  // 0x0030 (size: 0x18)

}; // Size: 0x48

struct FPalFoliageInstallDataArray
{
    TArray<FPalFoliageInstallData> InstallDataArray;                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalFoliageInstallDataSet
{
}; // Size: 0x50

struct FPalFoliageInstanceId
{
    FGuid Guid;                                                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalFoliageInstanceInfo
{
}; // Size: 0x4

struct FPalFoliageInstanceRepInfo : public FFastArraySerializerItem
{
    FName FoliageTypeId;                                                              // 0x000C (size: 0x8)
    FPalFoliageInstanceId InstanceId;                                                 // 0x0014 (size: 0x10)
    class UPalFoliageInstance* Instance;                                              // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FPalFoliageInstanceRepInfoArray : public FFastArraySerializer
{
    TArray<FPalFoliageInstanceRepInfo> Items;                                         // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFoliageInstanceSaveData : public FPalBinaryMemory
{
}; // Size: 0x10

struct FPalFoliageInstanceTransform
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    FRotator Rotator;                                                                 // 0x0018 (size: 0x18)
    float ScaleX;                                                                     // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FPalFoliageMasterData : public FTableRowBase
{
    FName ClassRefId;                                                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalFoliagePresetData
{
    FPalDataTableRowName_MapObjectData FoliageMapObjectId;                            // 0x0000 (size: 0x8)
    int32 HP;                                                                         // 0x0008 (size: 0x4)
    TArray<FPalMapObjectDropItemData> DamagedDropItems;                               // 0x0010 (size: 0x10)
    FPalDataTableRowName_ItemData DropItemId;                                         // 0x0020 (size: 0x8)
    int32 DropItemNum;                                                                // 0x0028 (size: 0x4)
    int32 DropEXP;                                                                    // 0x002C (size: 0x4)
    EPalMapObjectDestroyFXType DestroyFXType;                                         // 0x0030 (size: 0x1)
    float DistanceFromPlayerNotRespawn;                                               // 0x0034 (size: 0x4)
    int32 RespawnIntervalRealMinutes;                                                 // 0x0038 (size: 0x4)
    int32 RetryRespawnIntervalRealMinutes;                                            // 0x003C (size: 0x4)

}; // Size: 0x40

struct FPalFoliageSaveData : public FPalBinaryMemory
{
    TMap<class FPalFoliageInstanceId, class FPalFoliageInstanceSaveData> InstanceDataMap; // 0x0010 (size: 0x50)

}; // Size: 0x60

struct FPalFoliageTypeReference : public FTableRowBase
{
    TSoftObjectPtr<UFoliageType> FoliageType;                                         // 0x0008 (size: 0x30)
    FPalDataTableRowName_MapObjectData FoliageMapObjectId;                            // 0x0038 (size: 0x8)
    int32 HP;                                                                         // 0x0040 (size: 0x4)
    FPalDataTableRowName_ItemData DropItemId;                                         // 0x0044 (size: 0x8)
    int32 DropItemNum;                                                                // 0x004C (size: 0x4)
    EPalMapObjectDestroyFXType DestroyFXType;                                         // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FPalFoodRegeneEffectParameter
{
    EPalFoodStatusEffectType EffectType;                                              // 0x0000 (size: 0x1)
    int32 Value;                                                                      // 0x0004 (size: 0x4)
    int32 Interval;                                                                   // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalFoodRegeneInfo
{
    FName ItemId;                                                                     // 0x0000 (size: 0x8)
    int32 EffectTime;                                                                 // 0x0008 (size: 0x4)
    int32 RemainingTime;                                                              // 0x000C (size: 0x4)
    TArray<FPalFoodRegeneEffectParameter> RegeneEfectParameters;                      // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FPalFunnelCharacterManagementInfo
{
    FPalInstanceID OwnerCharacterId;                                                  // 0x0000 (size: 0x30)
    class APalFunnelCharacter* FunnelCharacter;                                       // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FPalFunnelSkillModuleCollectItemSearchInfo
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    float Distance;                                                                   // 0x0018 (size: 0x4)
    float ElapsedTime;                                                                // 0x001C (size: 0x4)

}; // Size: 0x28

struct FPalGainStatusPointsItemDataRow : public FTableRowBase
{
    int32 MaxHP;                                                                      // 0x0008 (size: 0x4)
    int32 MaxSP;                                                                      // 0x000C (size: 0x4)
    int32 Power;                                                                      // 0x0010 (size: 0x4)
    int32 WorkSpeed;                                                                  // 0x0014 (size: 0x4)
    int32 maxInventoryWeight;                                                         // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalGameProgressPresetDataTableRow : public FTableRowBase
{
    int32 Level;                                                                      // 0x0008 (size: 0x4)
    int32 HPLevel;                                                                    // 0x000C (size: 0x4)
    int32 SPLevel;                                                                    // 0x0010 (size: 0x4)
    int32 AttackLevel;                                                                // 0x0014 (size: 0x4)
    int32 WorkLevel;                                                                  // 0x0018 (size: 0x4)
    int32 WeightLevel;                                                                // 0x001C (size: 0x4)
    int32 CaptureLevel;                                                               // 0x0020 (size: 0x4)
    TArray<FPalDebugOtomoPalInfo> OtomoPals;                                          // 0x0028 (size: 0x10)
    TArray<FPalDebugOtomoPalInfo> CapturedPals;                                       // 0x0038 (size: 0x10)
    TArray<FPalDebugItemCreateInfo> LoadoutItems;                                     // 0x0048 (size: 0x10)
    TArray<FPalDebugItemCreateInfo> Items;                                            // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FPalGameSystemInitSequenceSet
{
    TArray<class UPalGameSystemInitSequenceBase*> InitSequences;                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalGameTimeSaveData
{
    int64 GameDateTimeTicks;                                                          // 0x0000 (size: 0x8)
    int64 RealDateTimeTicks;                                                          // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalGaugeInterpolationCalculator
{
    float CurrentValue;                                                               // 0x0000 (size: 0x4)
    float TargetValue;                                                                // 0x0004 (size: 0x4)
    bool bDirectionPositive;                                                          // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FPalGliderPalInfo
{
    FPalDataTableRowName_PalMonsterData PalName;                                      // 0x0000 (size: 0x8)
    TArray<TSoftClassPtr<APalGliderObject>> GliderPalArray;                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalGotStatusPoint
{
    FName StatusName;                                                                 // 0x0000 (size: 0x8)
    int32 StatusPoint;                                                                // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalGroupCreateParameter
{
    EPalGroupType Type;                                                               // 0x0000 (size: 0x1)
    EPalOrganizationType OrganizationType;                                            // 0x0001 (size: 0x1)
    FString GroupName;                                                                // 0x0008 (size: 0x10)
    FGuid AdminPlayerUId;                                                             // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FPalGroupSaveData : public FPalBinaryMemory
{
    EPalGroupType GroupType;                                                          // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FPalGroupUpdateInfo
{
    FGuid EnterGroupId;                                                               // 0x0000 (size: 0x10)
    FGuid ExitGroupId;                                                                // 0x0010 (size: 0x10)
    TArray<FGuid> PlayerUIds;                                                         // 0x0020 (size: 0x10)
    TArray<FPalInstanceID> CharacterIndividualIds;                                    // 0x0030 (size: 0x10)
    TArray<FGuid> MapObjectInstanceIds_BaseCampPoint;                                 // 0x0040 (size: 0x10)
    TArray<FGuid> BaseCampIds;                                                        // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FPalGuildEnterRequestLogInfo
{
    TArray<FDateTime> RequestAtArray;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalGuildPalStorageInfo
{
}; // Size: 0x38

struct FPalGuildPlayerInfo
{
    EPalGuildPlayerStatus Status;                                                     // 0x0000 (size: 0x1)
    FDateTime LastOnlineRealTime;                                                     // 0x0008 (size: 0x8)
    FString PlayerName;                                                               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FPalGuildPlayerInfoRepInfo : public FFastArraySerializerItem
{
    FGuid PlayerUId;                                                                  // 0x000C (size: 0x10)
    FPalGuildPlayerInfo PlayerInfo;                                                   // 0x0020 (size: 0x20)

}; // Size: 0x40

struct FPalHeatSourceInfo
{
    int32 HeatLevel_DayTime;                                                          // 0x0000 (size: 0x4)
    int32 HeatLevel_NightTime;                                                        // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalHitCollisionSetupParameter
{
}; // Size: 0x20

struct FPalIncidentBroadcastParameter
{
    EPalInvaderType InvaderType;                                                      // 0x0000 (size: 0x1)
    class UPalBaseCampModel* TargetBaseCamp;                                          // 0x0008 (size: 0x8)
    FPalInvaderDatabaseRow ChosenInvaderData;                                         // 0x0010 (size: 0x70)
    FGuid GroupGuid;                                                                  // 0x0080 (size: 0x10)

}; // Size: 0x90

struct FPalIncidentExecutionSettings
{
    bool bCanExecuteMultiple;                                                         // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FPalIncidentIdParameter
{
    FName IncidentId;                                                                 // 0x0000 (size: 0x8)
    FName IncidentType;                                                               // 0x0008 (size: 0x8)
    FName Option;                                                                     // 0x0010 (size: 0x8)
    TArray<FName> Args;                                                               // 0x0018 (size: 0x10)
    TArray<FName> Options;                                                            // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FPalIncidentInitializeParameter
{
}; // Size: 0x38

struct FPalIncidentNotifyParameter
{
    FName IncidentId;                                                                 // 0x0000 (size: 0x8)
    FName IncidentType;                                                               // 0x0008 (size: 0x8)
    class UObject* OccuredObject;                                                     // 0x0010 (size: 0x8)
    class UObject* OwnerObject;                                                       // 0x0018 (size: 0x8)
    class UPalIncidentBase* IncidentObject;                                           // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalIncidentParameterDataTableRow : public FTableRowBase
{
    FName Option;                                                                     // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalIncidentSystemFunctionAccessor
{
}; // Size: 0xC0

struct FPalIndividualCharacterCacheParameter
{
    FGuid GroupID;                                                                    // 0x0000 (size: 0x10)
    bool bSleeping;                                                                   // 0x0010 (size: 0x1)
    FGuid InvaderTargetBaseCampId;                                                    // 0x0018 (size: 0x10)
    EPalInvaderType InvaderType;                                                      // 0x0028 (size: 0x1)
    FString FilteredNickName;                                                         // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FPalIndividualCharacterEquipItemContainerHandler
{
}; // Size: 0x8

struct FPalIndividualCharacterHandleId : public FFastArraySerializerItem
{
    FPalInstanceID HandleId;                                                          // 0x0010 (size: 0x30)

}; // Size: 0x40

struct FPalIndividualCharacterSaveParameter
{
    FName CharacterID;                                                                // 0x0000 (size: 0x8)
    FName UniqueNPCID;                                                                // 0x0008 (size: 0x8)
    EPalGenderType Gender;                                                            // 0x0010 (size: 0x1)
    TSubclassOf<class APalCharacter> CharacterClass;                                  // 0x0018 (size: 0x8)
    int32 Level;                                                                      // 0x0020 (size: 0x4)
    int32 Rank;                                                                       // 0x0024 (size: 0x4)
    int32 RankUpExp;                                                                  // 0x0028 (size: 0x4)
    int32 Rank_HP;                                                                    // 0x002C (size: 0x4)
    int32 Rank_Attack;                                                                // 0x0030 (size: 0x4)
    int32 Rank_Defence;                                                               // 0x0034 (size: 0x4)
    int32 Rank_CraftSpeed;                                                            // 0x0038 (size: 0x4)
    int32 Exp;                                                                        // 0x003C (size: 0x4)
    FString NickName;                                                                 // 0x0040 (size: 0x10)
    bool IsRarePal;                                                                   // 0x0050 (size: 0x1)
    TArray<EPalWazaID> EquipWaza;                                                     // 0x0058 (size: 0x10)
    TArray<EPalWazaID> MasteredWaza;                                                  // 0x0068 (size: 0x10)
    FFixedPoint64 HP;                                                                 // 0x0078 (size: 0x8)
    int32 Talent_HP;                                                                  // 0x0080 (size: 0x4)
    int32 Talent_Melee;                                                               // 0x0084 (size: 0x4)
    int32 Talent_Shot;                                                                // 0x0088 (size: 0x4)
    int32 Talent_Defense;                                                             // 0x008C (size: 0x4)
    float FullStomach;                                                                // 0x0090 (size: 0x4)
    EPalStatusPhysicalHealthType PhysicalHealth;                                      // 0x0094 (size: 0x1)
    EPalBaseCampWorkerSickType WorkerSick;                                            // 0x0095 (size: 0x1)
    TArray<FName> PassiveSkillList;                                                   // 0x0098 (size: 0x10)
    int32 DyingTimer;                                                                 // 0x00A8 (size: 0x4)
    FFixedPoint64 MP;                                                                 // 0x00B0 (size: 0x8)
    bool IsPlayer;                                                                    // 0x00B8 (size: 0x1)
    FDateTime OwnedTime;                                                              // 0x00C0 (size: 0x8)
    FGuid OwnerPlayerUId;                                                             // 0x00C8 (size: 0x10)
    TArray<FGuid> OldOwnerPlayerUIds;                                                 // 0x00D8 (size: 0x10)
    FFixedPoint64 MaxHP;                                                              // 0x00E8 (size: 0x8)
    int32 Support;                                                                    // 0x00F0 (size: 0x4)
    int32 CraftSpeed;                                                                 // 0x00F4 (size: 0x4)
    TArray<FPalWorkSuitabilityInfo> CraftSpeeds;                                      // 0x00F8 (size: 0x10)
    FFixedPoint64 ShieldHP;                                                           // 0x0108 (size: 0x8)
    FFixedPoint64 ShieldMaxHP;                                                        // 0x0110 (size: 0x8)
    FFixedPoint64 MaxMP;                                                              // 0x0118 (size: 0x8)
    FFixedPoint64 MaxSP;                                                              // 0x0120 (size: 0x8)
    EPalStatusHungerType HungerType;                                                  // 0x0128 (size: 0x1)
    float SanityValue;                                                                // 0x012C (size: 0x4)
    EPalBaseCampWorkerEventType BaseCampWorkerEventType;                              // 0x0130 (size: 0x1)
    float BaseCampWorkerEventProgressTime;                                            // 0x0134 (size: 0x4)
    FPalContainerId ItemContainerId;                                                  // 0x0138 (size: 0x10)
    FPalContainerId EquipItemContainerId;                                             // 0x0148 (size: 0x10)
    FPalCharacterSlotId SlotID;                                                       // 0x0158 (size: 0x14)
    float MaxFullStomach;                                                             // 0x016C (size: 0x4)
    float FullStomachDecreaseRate_Tribe;                                              // 0x0170 (size: 0x4)
    int32 UnusedStatusPoint;                                                          // 0x0174 (size: 0x4)
    TArray<FPalGotStatusPoint> GotStatusPointList;                                    // 0x0178 (size: 0x10)
    TArray<FPalGotStatusPoint> GotExStatusPointList;                                  // 0x0188 (size: 0x10)
    FFloatContainer DecreaseFullStomachRates;                                         // 0x0198 (size: 0x10)
    FFloatContainer AffectSanityRates;                                                // 0x01A8 (size: 0x10)
    FFloatContainer CraftSpeedRates;                                                  // 0x01B8 (size: 0x10)
    FVector LastJumpedLocation;                                                       // 0x01C8 (size: 0x18)
    FName FoodWithStatusEffect;                                                       // 0x01E0 (size: 0x8)
    int32 Tiemr_FoodWithStatusEffect;                                                 // 0x01E8 (size: 0x4)
    FPalFoodRegeneInfo FoodRegeneEffectInfo;                                          // 0x01F0 (size: 0x20)
    EPalWorkSuitability CurrentWorkSuitability;                                       // 0x0210 (size: 0x1)
    FPalWorkSuitabilityPreferenceInfo WorkSuitabilityOptionInfo;                      // 0x0218 (size: 0x18)
    bool bAppliedDeathPenarty;                                                        // 0x0230 (size: 0x1)
    float PalReviveTimer;                                                             // 0x0234 (size: 0x4)
    int32 VoiceID;                                                                    // 0x0238 (size: 0x4)
    FPalIndividualCharacterCacheParameter Dynamic;                                    // 0x0240 (size: 0x40)

}; // Size: 0x280

struct FPalIndividualCharacterSaveParameterSaveData : public FPalBinaryMemory
{
}; // Size: 0x10

struct FPalIndividualCharacterSlotResultInfo
{
}; // Size: 0x20

struct FPalIndividualCharacterSlotUpdateInfo
{
}; // Size: 0x68

struct FPalInsideBaseCampUI_DisplayItemInfo
{
    bool isShowWhenNothingItem;                                                       // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FPalInstanceID
{
    FGuid PlayerUId;                                                                  // 0x0000 (size: 0x10)
    FGuid InstanceId;                                                                 // 0x0010 (size: 0x10)
    FString DebugName;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FPalInteractComponentOverlapComponentSet
{
    TSet<UPrimitiveComponent*> Components;                                            // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalInteractiveObjectActionBy
{
    class AActor* InteractingActor;                                                   // 0x0000 (size: 0x8)
    int32 InteractId;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FPalInteractiveObjectActionInfoData
{
    EPalInteractiveObjectIndicatorType IndicatorType;                                 // 0x0000 (size: 0x1)
    EPalInteractiveObjectButtonType buttonType;                                       // 0x0001 (size: 0x1)
    float longPushTime;                                                               // 0x0004 (size: 0x4)
    bool bValid;                                                                      // 0x0008 (size: 0x1)
    bool bLockRiding;                                                                 // 0x0009 (size: 0x1)
    bool isInputComsume;                                                              // 0x000A (size: 0x1)
    bool bCanToggle;                                                                  // 0x000B (size: 0x1)

}; // Size: 0xC

struct FPalInteractiveObjectActionInfoSet
{
    FPalInteractiveObjectActionInfoData Interact1_Indicator;                          // 0x0000 (size: 0xC)
    FPalInteractiveObjectActionInfoData Interact2_Indicator;                          // 0x000C (size: 0xC)
    FPalInteractiveObjectActionInfoData Interact3_Indicator;                          // 0x0018 (size: 0xC)
    FPalInteractiveObjectActionInfoData Interact4_Indicator;                          // 0x0024 (size: 0xC)

}; // Size: 0x30

struct FPalInvaderDatabaseRow : public FTableRowBase
{
    FName GroupName;                                                                  // 0x0008 (size: 0x8)
    EPalBiomeType BiomeID;                                                            // 0x0010 (size: 0x1)
    int32 InvadeGradeMin;                                                             // 0x0014 (size: 0x4)
    int32 InvadeGradeMax;                                                             // 0x0018 (size: 0x4)
    float Weight;                                                                     // 0x001C (size: 0x4)
    FName CharactorID_A;                                                              // 0x0020 (size: 0x8)
    int32 LevelMin_A;                                                                 // 0x0028 (size: 0x4)
    int32 LevelMax_A;                                                                 // 0x002C (size: 0x4)
    int32 Number_A;                                                                   // 0x0030 (size: 0x4)
    FName CharactorID_B;                                                              // 0x0034 (size: 0x8)
    int32 LevelMin_B;                                                                 // 0x003C (size: 0x4)
    int32 LevelMax_B;                                                                 // 0x0040 (size: 0x4)
    int32 Number_B;                                                                   // 0x0044 (size: 0x4)
    FName CharactorID_C;                                                              // 0x0048 (size: 0x8)
    int32 LevelMin_C;                                                                 // 0x0050 (size: 0x4)
    int32 LevelMax_C;                                                                 // 0x0054 (size: 0x4)
    int32 Number_C;                                                                   // 0x0058 (size: 0x4)
    FName CharactorID_D;                                                              // 0x005C (size: 0x8)
    int32 LevelMin_D;                                                                 // 0x0064 (size: 0x4)
    int32 LevelMax_D;                                                                 // 0x0068 (size: 0x4)
    int32 Number_D;                                                                   // 0x006C (size: 0x4)

}; // Size: 0x70

struct FPalInvaderSaveData
{
    bool bIsInvading;                                                                 // 0x0000 (size: 0x1)
    float CoolTimeElapsed;                                                            // 0x0004 (size: 0x4)
    float CoolTimeFinish;                                                             // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalInvaderSpawnCharacterParameter
{
    FName CharacterID;                                                                // 0x0000 (size: 0x8)
    int32 Level;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalInvaderStartPointInfo
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    EPalBiomeType BiomeType;                                                          // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FPalItemAndNum
{
    FPalItemId ItemId;                                                                // 0x0000 (size: 0x28)
    int32 Num;                                                                        // 0x0028 (size: 0x4)

}; // Size: 0x2C

struct FPalItemAndSlot
{
    FPalItemId ItemId;                                                                // 0x0000 (size: 0x28)
    int32 Num;                                                                        // 0x0028 (size: 0x4)
    FPalItemSlotId SlotID;                                                            // 0x002C (size: 0x14)

}; // Size: 0x40

struct FPalItemAndSlotUpdateContentSet
{
    TArray<FPalItemAndSlot> UpdateContents;                                           // 0x0000 (size: 0x10)
    TArray<FPalStaticItemIdAndDynamicItemDataSet> UpdateDynamicItems;                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FPalItemContainerBelongInfo : public FPalContainerBelongInfo
{
    FGuid GroupID;                                                                    // 0x0008 (size: 0x10)
    bool bControllableOthers;                                                         // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FPalItemContainerCreateParameter
{
    int32 SlotNum;                                                                    // 0x0000 (size: 0x4)
    FPalItemPermission Permission;                                                    // 0x0008 (size: 0x30)
    FPalItemContainerBelongInfo BelongInfo;                                           // 0x0038 (size: 0x20)
    TArray<FPalItemAndNum> InitialItems;                                              // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FPalItemContainerFilter
{
    TArray<FName> FilterOffList;                                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalItemContainerInfo : public FPalContainerInfo
{
    FPalItemContainerBelongInfo BelongInfo;                                           // 0x0020 (size: 0x20)
    FPalItemPermission Permission;                                                    // 0x0040 (size: 0x30)

}; // Size: 0x70

struct FPalItemContainerSaveData : public FPalBinaryMemory
{
    FPalItemContainerBelongInfo BelongInfo;                                           // 0x0010 (size: 0x20)
    TArray<FPalItemSlotSaveData> Slots;                                               // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FPalItemCreateParameter
{
    FPalPassiveSkillAssignInfo PassiveSkillAssignInfo;                                // 0x0000 (size: 0x18)
    FName CharacterID;                                                                // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FPalItemData
{
    class UPalStaticItemDataBase* StaticData;                                         // 0x0000 (size: 0x8)
    class UPalDynamicItemDataBase* DynamicData;                                       // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalItemFilterPreference
{
    TMap<class FName, class FPalItemFilterPreferenceItem> PreferenceMap;              // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalItemFilterPreferenceItem
{
    FDataTableRowHandle FilterTextId;                                                 // 0x0000 (size: 0x10)
    TArray<EPalItemTypeA> TypeA;                                                      // 0x0010 (size: 0x10)
    TArray<EPalItemTypeB> TypeB;                                                      // 0x0020 (size: 0x10)
    TArray<EPalItemTypeB> TypeB_Except;                                               // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FPalItemFlowInSplineInfo
{
    class AActor* ItemActor;                                                          // 0x0000 (size: 0x8)
    float ProgressTime;                                                               // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FPalItemId
{
    FName StaticId;                                                                   // 0x0000 (size: 0x8)
    FPalDynamicItemId DynamicId;                                                      // 0x0008 (size: 0x20)

}; // Size: 0x28

struct FPalItemLotteryData : public FTableRowBase
{
    FName FieldName;                                                                  // 0x0008 (size: 0x8)
    int32 SlotNo;                                                                     // 0x0010 (size: 0x4)
    float WeightInSlot;                                                               // 0x0014 (size: 0x4)
    FName StaticItemId;                                                               // 0x0018 (size: 0x8)
    int32 MinNum;                                                                     // 0x0020 (size: 0x4)
    int32 MaxNum;                                                                     // 0x0024 (size: 0x4)
    int32 NumUnit;                                                                    // 0x0028 (size: 0x4)
    EPalMapObjectTreasureGradeType TreasureBoxGrade;                                  // 0x002C (size: 0x1)

}; // Size: 0x30

struct FPalItemOperationInfo_Move
{
    FPalInstanceID ExecutorIndividualId;                                              // 0x0000 (size: 0x30)
    TArray<FPalItemId> ItemIds;                                                       // 0x0030 (size: 0x10)
    TArray<FPalItemSlotId> FromSlotIds;                                               // 0x0040 (size: 0x10)
    FPalContainerId ToContainerId;                                                    // 0x0050 (size: 0x10)
    TArray<FPalItemSlotId> ToSlotIds;                                                 // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FPalItemOperationOptions
{
}; // Size: 0x1

struct FPalItemPalEggDataHandle
{
    TArray<FPalDataTableRowName_ItemData> ItemRowNameArray;                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalItemPermission
{
    TArray<EPalItemTypeA> PermissionTypeA;                                            // 0x0000 (size: 0x10)
    TArray<EPalItemTypeB> PermissionTypeB;                                            // 0x0010 (size: 0x10)
    TArray<FName> PermissionItemStaticIds;                                            // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FPalItemRecipe : public FTableRowBase
{
    FName Product_Id;                                                                 // 0x0008 (size: 0x8)
    int32 Product_Count;                                                              // 0x0010 (size: 0x4)
    float WorkAmount;                                                                 // 0x0014 (size: 0x4)
    int32 WorkableAttribute;                                                          // 0x0018 (size: 0x4)
    FName UnlockItemID;                                                               // 0x001C (size: 0x8)
    FName Material1_Id;                                                               // 0x0024 (size: 0x8)
    int32 Material1_Count;                                                            // 0x002C (size: 0x4)
    FName Material2_Id;                                                               // 0x0030 (size: 0x8)
    int32 Material2_Count;                                                            // 0x0038 (size: 0x4)
    FName Material3_Id;                                                               // 0x003C (size: 0x8)
    int32 Material3_Count;                                                            // 0x0044 (size: 0x4)
    FName Material4_Id;                                                               // 0x0048 (size: 0x8)
    int32 Material4_Count;                                                            // 0x0050 (size: 0x4)
    FName Material5_Id;                                                               // 0x0054 (size: 0x8)
    int32 Material5_Count;                                                            // 0x005C (size: 0x4)
    EPalEnergyType EnergyType;                                                        // 0x0060 (size: 0x1)
    int32 EnergyAmount;                                                               // 0x0064 (size: 0x4)
    int32 Editor_RowNameHash;                                                         // 0x0068 (size: 0x4)

}; // Size: 0x70

struct FPalItemRecipeMaterialInfo
{
    FName MaterialID;                                                                 // 0x0000 (size: 0x8)
    int32 MaterialCount;                                                              // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalItemShopCreateDataRow : public FTableRowBase
{
    TArray<FPalItemShopCreateDataStruct> productDataArray;                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalItemShopCreateDataStruct
{
    FName StaticItemId;                                                               // 0x0000 (size: 0x8)
    float BuyRate;                                                                    // 0x0008 (size: 0x4)
    float SellRate;                                                                   // 0x000C (size: 0x4)
    int32 Stock;                                                                      // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalItemShopCreateIntermediateDataRow : public FTableRowBase
{
    FName GroupName;                                                                  // 0x0008 (size: 0x8)
    FName StaticItemId;                                                               // 0x0010 (size: 0x8)
    float BuyRate;                                                                    // 0x0018 (size: 0x4)
    float SellRate;                                                                   // 0x001C (size: 0x4)
    int32 Stock;                                                                      // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FPalItemShopLotteryDataRow : public FTableRowBase
{
    TArray<FPalItemShopLotteryDataStruct> lotteryDataArray;                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalItemShopLotteryDataStruct
{
    FName ShopGroupName;                                                              // 0x0000 (size: 0x8)
    int32 Weight;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalItemShopLotteryIntermediateDataRow : public FTableRowBase
{
    FName GroupName;                                                                  // 0x0008 (size: 0x8)
    FName ShopGroupName;                                                              // 0x0010 (size: 0x8)
    int32 Weight;                                                                     // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalItemSlotId
{
    FPalContainerId ContainerId;                                                      // 0x0000 (size: 0x10)
    int32 SlotIndex;                                                                  // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalItemSlotIdAndNum
{
    FPalItemSlotId SlotID;                                                            // 0x0000 (size: 0x14)
    int32 Num;                                                                        // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPalItemSlotSaveData : public FPalBinaryMemory
{
    int32 SlotIndex;                                                                  // 0x0010 (size: 0x4)
    FPalItemId ItemId;                                                                // 0x0014 (size: 0x28)
    int32 StackCount;                                                                 // 0x003C (size: 0x4)

}; // Size: 0x40

struct FPalItemVisualModelFXInfo
{
    class UNiagaraSystem* NiagaraSystem;                                              // 0x0000 (size: 0x8)
    FTransform LocalTransform;                                                        // 0x0010 (size: 0x60)

}; // Size: 0x70

struct FPalKeyAction
{
    FName ActionName;                                                                 // 0x0000 (size: 0x8)
    EPalKeyConfigAxisFilterType FilterType;                                           // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FPalKeyConfigKeys
{
    FKey MainKey;                                                                     // 0x0000 (size: 0x18)
    FKey SecondaryKey;                                                                // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FPalKeyConfigSettings
{
    TMap<class FName, class FPalKeyConfigKeys> MouseAndKeyboardActionMappings;        // 0x0000 (size: 0x50)
    TArray<FPalAxisKeyConfigKeys> MouseAndKeyboardAxisMappings;                       // 0x0050 (size: 0x10)
    TMap<class FName, class FPalKeyConfigKeys> GamePadActionMappings;                 // 0x0060 (size: 0x50)
    TArray<FPalAxisKeyConfigKeys> GamePadAxisMappings;                                // 0x00B0 (size: 0x10)
    TMap<class FName, class FKey> MouseAndKeyboardUIInputMappings;                    // 0x00C0 (size: 0x50)
    TMap<class FName, class FKey> GamePadUIInputMappings;                             // 0x0110 (size: 0x50)

}; // Size: 0x160

struct FPalLoadoutSynchronalizedData
{
    TSoftClassPtr<AActor> actorClass;                                                 // 0x0000 (size: 0x30)
    FPalItemId ItemId;                                                                // 0x0030 (size: 0x28)

}; // Size: 0x58

struct FPalLocalSaveData
{
    TMap<EPalTribeID, int32> Local_ActivateOtomoCount;                                // 0x0000 (size: 0x50)
    TMap<class EPalTribeID, class bool> Local_PalEncountFlag;                         // 0x0050 (size: 0x50)
    TMap<class FName, class bool> Local_NoteCheckedFlag;                              // 0x00A0 (size: 0x50)
    TMap<EPalPlayerInventoryType, int32> Local_LoadoutSelectedIndexMap;               // 0x00F0 (size: 0x50)
    TMap<FName, int32> Local_NewUnlockedBuilds;                                       // 0x0140 (size: 0x50)
    bool Local_IsBuildMenuChecked;                                                    // 0x0190 (size: 0x1)
    TMap<FName, int32> Local_NPCTalkCountMap;                                         // 0x0198 (size: 0x50)
    TMap<class FName, class bool> Local_NewUnlockedTechs;                             // 0x01E8 (size: 0x50)
    TMap<class FName, class bool> Local_ShowedCutsceneFlag;                           // 0x0238 (size: 0x50)
    int32 Local_PlayTime;                                                             // 0x0288 (size: 0x4)
    TArray<uint8> worldMapMaskTexture;                                                // 0x0290 (size: 0x10)
    TArray<FPalCustomMarkerSaveData> Local_CustomMarkerSaveData;                      // 0x02A0 (size: 0x10)
    TArray<FPalTutorialTriggerSaveData> Local_TutorialTriggerSaveData;                // 0x02B0 (size: 0x10)
    TArray<FPalCompletedQuestSaveData> Local_CompletedTutorialQuestSaveData;          // 0x02C0 (size: 0x10)
    TArray<FPalOrderedQuestSaveData> Local_OrderedTutorialQuestSaveData;              // 0x02D0 (size: 0x10)

}; // Size: 0x2E0

struct FPalLocalizedTextData : public FTableRowBase
{
    FText TextData;                                                                   // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FPalLocationRepInfo : public FFastArraySerializerItem
{
    FGuid ID;                                                                         // 0x000C (size: 0x10)
    class UPalLocationBase* Location;                                                 // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalLocationUIData
{
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0000 (size: 0x30)
    TSubclassOf<class UPalUICompassIconBase> compassIconWidget;                       // 0x0030 (size: 0x8)
    float displayLength;                                                              // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FPalLocationUIData_TableRow : public FTableRowBase
{
    TMap<class EPalLocationType, class FPalLocationUIData> locationUIDataMap;         // 0x0008 (size: 0x50)
    TMap<class FName, class TSoftObjectPtr<UTexture2D>> mapObjectIconMap;             // 0x0058 (size: 0x50)

}; // Size: 0xA8

struct FPalLogAdditionalData
{
    TArray<TSoftObjectPtr<UTexture2D>> softTextures;                                  // 0x0000 (size: 0x10)
    EPalLogContentToneType logToneType;                                               // 0x0010 (size: 0x1)
    FName DefaultFontStyleName;                                                       // 0x0014 (size: 0x8)
    TSubclassOf<class UPalLogWidgetBase> overrideWidgetClass;                         // 0x0020 (size: 0x8)
    FPalStaticItemIdAndNum ItemIDAndNum;                                              // 0x0028 (size: 0xC)

}; // Size: 0x38

struct FPalLogDataSet
{
    FText Text;                                                                       // 0x0000 (size: 0x18)
    FPalLogAdditionalData AdditionalData;                                             // 0x0018 (size: 0x38)

}; // Size: 0x50

struct FPalLogInfo_DropPal
{
    FString NickName;                                                                 // 0x0000 (size: 0x10)
    FName CharacterID;                                                                // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalLogInfo_Skill
{
    FText SkillName;                                                                  // 0x0000 (size: 0x18)
    FText CharacterName;                                                              // 0x0018 (size: 0x18)
    FText Value;                                                                      // 0x0030 (size: 0x18)

}; // Size: 0x48

struct FPalLoggedinPlayerSaveDataRecordData
{
    TMap<class FName, class bool> TowerBossDefeatFlag;                                // 0x0000 (size: 0x50)
    TMap<class FName, class bool> NormalBossDefeatFlag;                               // 0x0050 (size: 0x50)
    int32 BossDefeatCount;                                                            // 0x00A0 (size: 0x4)
    int32 TribeCaptureCount;                                                          // 0x00A4 (size: 0x4)
    TMap<FName, int32> PalCaptureCount;                                               // 0x00A8 (size: 0x50)
    TMap<class FName, class bool> PaldeckUnlockFlag;                                  // 0x00F8 (size: 0x50)
    int32 PalCaptureCountBonusCount_Tier1;                                            // 0x0148 (size: 0x4)
    int32 PalCaptureCountBonusCount_Tier2;                                            // 0x014C (size: 0x4)
    int32 PalCaptureCountBonusCount_Tier3;                                            // 0x0150 (size: 0x4)
    TMap<class FName, class bool> RelicObtainForInstanceFlag;                         // 0x0158 (size: 0x50)
    int32 RelicPossessNum;                                                            // 0x01A8 (size: 0x4)
    TMap<class FName, class bool> NoteObtainForInstanceFlag;                          // 0x01B0 (size: 0x50)
    TMap<FName, int32> NPCTalkIdCount;                                                // 0x0200 (size: 0x50)
    TMap<class FName, class bool> FastTravelPointUnlockFlag;                          // 0x0250 (size: 0x50)
    TArray<FGuid> BuildingObjectMapObjectInstanceIds;                                 // 0x02A0 (size: 0x10)

}; // Size: 0x2B0

struct FPalMakeDamageInfo
{
    class AActor* Attacker;                                                           // 0x0000 (size: 0x8)
    class AActor* Defender;                                                           // 0x0008 (size: 0x8)
    class USceneComponent* HitComponent;                                              // 0x0010 (size: 0x8)
    int32 Power;                                                                      // 0x0018 (size: 0x4)
    EPalWazaCategory Category;                                                        // 0x001C (size: 0x1)
    EPalElementType Element;                                                          // 0x001D (size: 0x1)
    EPalAttackType AttackType;                                                        // 0x001E (size: 0x1)
    EPalWeaponType WeaponType;                                                        // 0x001F (size: 0x1)
    FVector HitLocation;                                                              // 0x0020 (size: 0x18)
    bool IsLeanBack;                                                                  // 0x0038 (size: 0x1)
    bool IsBlow;                                                                      // 0x0039 (size: 0x1)
    FVector BlowVelocity;                                                             // 0x0040 (size: 0x18)
    FHitResult HitInfo;                                                               // 0x0058 (size: 0xE8)
    EPalAdditionalEffectType EffectType1;                                             // 0x0140 (size: 0x1)
    int32 EffectValue1;                                                               // 0x0144 (size: 0x4)
    float EffectValueEx1;                                                             // 0x0148 (size: 0x4)
    EPalAdditionalEffectType EffectType2;                                             // 0x014C (size: 0x1)
    int32 EffectValue2;                                                               // 0x0150 (size: 0x4)
    float EffectValueEx2;                                                             // 0x0154 (size: 0x4)
    TArray<int32> HitFoliageIndex;                                                    // 0x0158 (size: 0x10)
    float SneakAttackRate;                                                            // 0x0168 (size: 0x4)
    float DamageRatePerCollision;                                                     // 0x016C (size: 0x4)
    TArray<FPalSpecialAttackRateInfo> SpecialAttackRateInfos;                         // 0x0170 (size: 0x10)
    EPalDamageAnimationReactionType DamageReactionAnimationType;                      // 0x0180 (size: 0x1)
    bool bAttackableToFriend;                                                         // 0x0181 (size: 0x1)
    bool NoDamage;                                                                    // 0x0182 (size: 0x1)
    bool IgnoreShield;                                                                // 0x0183 (size: 0x1)
    bool UIDamageTextOverride_DoubleRegist;                                           // 0x0184 (size: 0x1)
    EPalPlayerDamageCameraShakeCategory CameraShake;                                  // 0x0185 (size: 0x1)
    EPalSizeType ForceRagdollSize;                                                    // 0x0186 (size: 0x1)
    class AActor* OverrideNetworkOwner;                                               // 0x0188 (size: 0x8)

}; // Size: 0x190

struct FPalMapObjectAppearanceData
{
    FGameDateTime DateTime;                                                           // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalMapObjectAppearanceDataWithId
{
    FGuid InstanceId;                                                                 // 0x0000 (size: 0x10)
    FPalMapObjectAppearanceData AppearanceData;                                       // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalMapObjectAssignData : public FTableRowBase
{
    EPalGenusCategoryType GenusCategory;                                              // 0x0008 (size: 0x1)
    EPalElementType ElementType;                                                      // 0x0009 (size: 0x1)
    EPalWorkSuitability WorkSuitability;                                              // 0x000A (size: 0x1)
    int32 WorkSuitabilityRank;                                                        // 0x000C (size: 0x4)
    bool bPlayerWorkable;                                                             // 0x0010 (size: 0x1)
    EPalWorkType WorkType;                                                            // 0x0011 (size: 0x1)
    EPalActionType WorkActionType;                                                    // 0x0012 (size: 0x1)
    int32 WorkerMaxNum;                                                               // 0x0014 (size: 0x4)
    float AffectSanityValue;                                                          // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalMapObjectBelongInfo : public FPalBelongInfo
{
    FGuid GroupID;                                                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalMapObjectBuildProcessSaveData : public FPalBinaryMemory
{
}; // Size: 0x10

struct FPalMapObjectConcreteModelCreateParameter
{
}; // Size: 0xA0

struct FPalMapObjectConcreteModelModuleSaveData : public FPalBinaryMemory
{
}; // Size: 0x10

struct FPalMapObjectConcreteModelSaveData : public FPalBinaryMemory
{
    TMap<class EPalMapObjectConcreteModelModuleType, class FPalMapObjectConcreteModelModuleSaveData> ModuleMap; // 0x0010 (size: 0x50)

}; // Size: 0x60

struct FPalMapObjectConnectorSaveData : public FPalBinaryMemory
{
}; // Size: 0x10

struct FPalMapObjectCreateParameter
{
}; // Size: 0x80

struct FPalMapObjectDisposeOptions
{
}; // Size: 0x10

struct FPalMapObjectDisposeReserveInfo
{
}; // Size: 0x20

struct FPalMapObjectDropItemData
{
    FPalDataTableRowName_ItemData StaticItemId;                                       // 0x0000 (size: 0x8)
    int32 Num;                                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalMapObjectEffectSaveData : public FPalBinaryMemory
{
}; // Size: 0x10

struct FPalMapObjectFarmCropData : public FTableRowBase
{
    FName CropBlueprintClassName;                                                     // 0x0008 (size: 0x8)
    TSoftClassPtr<APalMapObjectFarmCrop> CropClassPath;                               // 0x0010 (size: 0x30)
    FName CropItemId;                                                                 // 0x0040 (size: 0x8)
    float GrowupTime;                                                                 // 0x0048 (size: 0x4)
    int32 CropItemNum;                                                                // 0x004C (size: 0x4)
    float SeedingWorkAmount;                                                          // 0x0050 (size: 0x4)
    float WateringWorkAmount;                                                         // 0x0054 (size: 0x4)
    float HarvestWorkAmount;                                                          // 0x0058 (size: 0x4)
    FName MaterialItem1_Id;                                                           // 0x005C (size: 0x8)
    int32 MaterialItem1_Num;                                                          // 0x0064 (size: 0x4)
    FName MaterialItem2_Id;                                                           // 0x0068 (size: 0x8)
    int32 MaterialItem2_Num;                                                          // 0x0070 (size: 0x4)
    int32 Editor_RowNameHash;                                                         // 0x0074 (size: 0x4)

}; // Size: 0x78

struct FPalMapObjectFoliageDropItemData
{
    FPalDataTableRowName_ItemData StaticItemId;                                       // 0x0000 (size: 0x8)
    int32 Num;                                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalMapObjectFoliageInstallData : public FTableRowBase
{
    FName FoliageTypeName;                                                            // 0x0008 (size: 0x8)
    FVector Location;                                                                 // 0x0010 (size: 0x18)
    FRotator Rotator;                                                                 // 0x0028 (size: 0x18)
    FVector Scale3D;                                                                  // 0x0040 (size: 0x18)

}; // Size: 0x58

struct FPalMapObjectFoliageInstanceAccessID
{
    FName ModelId;                                                                    // 0x0000 (size: 0x8)
    FPalFoliageInstanceId InstanceId;                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalMapObjectItemContainerCreateContainerParameter
{
}; // Size: 0x70

struct FPalMapObjectItemContainerModuleFilter
{
    TArray<FName> FilterOffList;                                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalMapObjectItemContainerModuleSlotIndexes
{
    EPalMapObjectItemContainerSlotAttribute Attribute;                                // 0x0000 (size: 0x1)
    TArray<int32> Indexes;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalMapObjectItemProductData : public FTableRowBase
{
    FName Product_Id;                                                                 // 0x0008 (size: 0x8)
    float RequiredWorkAmount;                                                         // 0x0010 (size: 0x4)
    float AutoWorkAmountBySec;                                                        // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPalMapObjectManageAsyncTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FPalMapObjectMasterData : public FTableRowBase
{
    FName OverrideNameMsgID;                                                          // 0x0008 (size: 0x8)
    FName BlueprintClassName;                                                         // 0x0010 (size: 0x8)
    TSoftClassPtr<APalMapObject> BlueprintClassSoft;                                  // 0x0018 (size: 0x30)
    EPalMapObjectMaterialType MaterialType;                                           // 0x0048 (size: 0x1)
    EPalMapObjectMaterialSubType MaterialSubType;                                     // 0x0049 (size: 0x1)
    int32 HP;                                                                         // 0x004C (size: 0x4)
    int32 Defense;                                                                    // 0x0050 (size: 0x4)
    bool bBelongToBaseCamp;                                                           // 0x0054 (size: 0x1)
    int32 DistributeExpAroundPlayer;                                                  // 0x0058 (size: 0x4)
    float DeteriorationDamage;                                                        // 0x005C (size: 0x4)
    float ExtinguishBurnWorkAmount;                                                   // 0x0060 (size: 0x4)
    bool bShowHPGauge;                                                                // 0x0064 (size: 0x1)
    bool bInDevelop;                                                                  // 0x0065 (size: 0x1)
    int32 Editor_RowNameHash;                                                         // 0x0068 (size: 0x4)

}; // Size: 0x70

struct FPalMapObjectMeshVisibleData
{
    FComponentReference MeshComponentRef;                                             // 0x0000 (size: 0x28)
    float VisibleHpPercentageThreshold;                                               // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FPalMapObjectModelConnectInfo
{
    EPalMapObjectModelConnectIndex ConnectIndex;                                      // 0x0000 (size: 0x1)
    TArray<FPalMapObjectModelConnectInfoItem> ConnectToInfos;                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalMapObjectModelConnectInfoItem
{
    FGuid ConnectToModelInstanceId;                                                   // 0x0000 (size: 0x10)
    EPalMapObjectModelConnectIndex ConnectIndex;                                      // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FPalMapObjectModelEffectRepInfo : public FFastArraySerializerItem
{
    EPalStatusID StatusId;                                                            // 0x000C (size: 0x1)
    class UPalMapObjectModelEffectBase* Effect;                                       // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalMapObjectModelInitializeExtraParameters
{
    TArray<class UPalMapObjectModelInitializeExtraParameterBase*> Entries;            // 0x0000 (size: 0x10)
    bool bIgnoredSave;                                                                // 0x0010 (size: 0x1)
    FGuid LevelObjectInstanceId;                                                      // 0x0014 (size: 0x10)

}; // Size: 0x28

struct FPalMapObjectModelSaveData : public FPalBinaryMemory
{
    FPalMapObjectBuildProcessSaveData BuildProcess;                                   // 0x0010 (size: 0x10)
    FPalMapObjectConnectorSaveData Connector;                                         // 0x0020 (size: 0x10)
    TMap<class EPalStatusID, class FPalMapObjectEffectSaveData> EffectMap;            // 0x0030 (size: 0x50)

}; // Size: 0x80

struct FPalMapObjectModelStaticData
{
    FPalBoundsTransform WorkableBounds;                                               // 0x0000 (size: 0x80)
    FBox MeshBoxBounds;                                                               // 0x0080 (size: 0x38)
    EPalMapObjectDamagableType DamagableType;                                         // 0x00B8 (size: 0x1)
    FName BuildObjectId;                                                              // 0x00BC (size: 0x8)
    TSubclassOf<class APalMapObject> BlueprintClass;                                  // 0x00C8 (size: 0x8)

}; // Size: 0xD0

struct FPalMapObjectModuleRepInfo : public FFastArraySerializerItem
{
    class UPalMapObjectConcreteModelModuleBase* Module;                               // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalMapObjectPasswordLockPlayerInfo
{
    FGuid PlayerUId;                                                                  // 0x0000 (size: 0x10)
    int32 TryFailedCount;                                                             // 0x0010 (size: 0x4)
    bool TrySuccessCache;                                                             // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FPalMapObjectPickupItemData
{
    FPalDataTableRowName_ItemData StaticItemId;                                       // 0x0000 (size: 0x8)
    int32 Num;                                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalMapObjectPickupItemPalEggData
{
    FPalDataTableRowName_PalMonsterData PalMonsterId;                                 // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalMapObjectPickupItemPalEggLotteryData
{
    FPalMapObjectPickupItemPalEggData PalEggData;                                     // 0x0000 (size: 0x8)
    float Weight;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalMapObjectRepairInfo
{
    FPalDataTableRowName_ItemData RepairKitItemName;                                  // 0x0000 (size: 0x8)
    int32 RepairKitRequiredNum;                                                       // 0x0008 (size: 0x4)
    float RepairRequiredWorkAmount;                                                   // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPalMapObjectSaveData
{
    FVector WorldLocation;                                                            // 0x0000 (size: 0x18)
    FQuat WorldRotation;                                                              // 0x0020 (size: 0x20)
    FVector WorldScale3D;                                                             // 0x0040 (size: 0x18)
    FName MapObjectId;                                                                // 0x0058 (size: 0x8)
    FGuid MapObjectInstanceId;                                                        // 0x0060 (size: 0x10)
    FGuid MapObjectConcreteModelInstanceId;                                           // 0x0070 (size: 0x10)
    FPalMapObjectModelSaveData Model;                                                 // 0x0080 (size: 0x80)
    FPalMapObjectConcreteModelSaveData ConcreteModel;                                 // 0x0100 (size: 0x60)

}; // Size: 0x160

struct FPalMapObjectSpawnableCheckParameter
{
    TArray<class AActor*> IgnoredOverlapCheckActors;                                  // 0x0078 (size: 0x10)

}; // Size: 0x90

struct FPalMapObjectSpawnerInStageSaveData
{
    TMap<class FGuid, class FPalMapObjectSpawnerSaveData> SpawnerDataMapByLevelObjectInstanceId; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalMapObjectSpawnerItemSaveData
{
    int64 NextLotteryGameTime;                                                        // 0x0000 (size: 0x8)
    FGuid MapObjectInstanceId;                                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalMapObjectSpawnerSaveData
{
    TMap<int32, FPalMapObjectSpawnerItemSaveData> ItemMap;                            // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalMapObjectStaticData
{
    FName DummyFoliageMapObjectId;                                                    // 0x0000 (size: 0x8)
    FName DropItemMapObjectId;                                                        // 0x0008 (size: 0x8)
    FName DropItem3DMapObjectId;                                                      // 0x0010 (size: 0x8)
    FName BuildObjectId_PalStorage;                                                   // 0x0018 (size: 0x8)
    FName MapObjectId_ItemChest;                                                      // 0x0020 (size: 0x8)
    FName MapObjectId_DeathPenalty;                                                   // 0x0028 (size: 0x8)
    FName MapObjectId_DroppedCharacter;                                               // 0x0030 (size: 0x8)
    FName MapObjectId_TreasureBox_VisibleContent;                                     // 0x0038 (size: 0x8)
    FName MapObjectId_SkillFruit_VisibleContent;                                      // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FPalMapObjectStatusValue
{
    int32 CurrentValue;                                                               // 0x0000 (size: 0x4)
    int32 MaxValue;                                                                   // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalMapObjectVisualEffectAssets
{
    TMap<class EPalMapObjectVisualEffectType, class TSoftObjectPtr<UNiagaraSystem>> AssetMap; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalMapObjectVisualEffectInstanceSet
{
    TArray<class UNiagaraComponent*> Instances;                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalMapObjectWorldDropItemInfo
{
    FName StaticItemId;                                                               // 0x0008 (size: 0x8)
    FGameDateTime CreatedAt;                                                          // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalMapObjectWorldDropItemInfoSet
{
    TArray<FPalMapObjectWorldDropItemInfo> Infos;                                     // 0x0000 (size: 0x10)
    TArray<FPalMapObjectWorldDropItemInfo> InsertReservedInfoSet;                     // 0x0010 (size: 0x10)
    int32 MaxCount;                                                                   // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FPalMealLogDisplayData
{
    FPalInstanceID InstanceId;                                                        // 0x0000 (size: 0x30)
    FName MealItemID;                                                                 // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FPalMiningRankDefineData
{
    float DamageRate;                                                                 // 0x0000 (size: 0x4)
    EPalMapObjectMaterialSubType MaterialSubType;                                     // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FPalMonsterControllerBaseCampHungryParameter
{
    float RecoverSatietyTo;                                                           // 0x0000 (size: 0x4)
    float RecoverSanityTo;                                                            // 0x0004 (size: 0x4)
    int32 EatMaxNum;                                                                  // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalMonsterControllerBaseCampLogContent
{
    EPalMonsterControllerBaseCampLogType Type;                                        // 0x0000 (size: 0x1)
    FName TextId;                                                                     // 0x0004 (size: 0x8)
    FName TargetObjectTextId;                                                         // 0x000C (size: 0x8)
    FPalInstanceID InstanceId;                                                        // 0x0018 (size: 0x30)

}; // Size: 0x48

struct FPalMorphSetting
{
    TMap<FName, float> WeightList;                                                    // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalNPCInteractConditionConstValueDataTableRow : public FTableRowBase
{
    FName ValText;                                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalNPCInteractionDataTableRow : public FTableRowBase
{
    FName UniqueNPCID;                                                                // 0x0008 (size: 0x8)
    FName CharacterID;                                                                // 0x0010 (size: 0x8)
    EPalInteractiveObjectIndicatorType InteractionType;                               // 0x0018 (size: 0x1)
    FName Conditions;                                                                 // 0x001C (size: 0x8)
    FName IncidentId;                                                                 // 0x0024 (size: 0x8)
    FName IncidentArgs1;                                                              // 0x002C (size: 0x8)
    FName IncidentArgs2;                                                              // 0x0034 (size: 0x8)

}; // Size: 0x40

struct FPalNPCMultiTalkRow : public FTableRowBase
{
    TSubclassOf<class UPalNPCMultiTalkHandle> MultiTalkHandleClass;                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalNPCOneTalkRow : public FTableRowBase
{
    class UDataTable* OneTalkData;                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalNPCSpawnInfo
{
    TSubclassOf<class APalAIController> ControllerClass;                              // 0x0000 (size: 0x8)
    FName CharacterID;                                                                // 0x0008 (size: 0x8)
    int32 Level;                                                                      // 0x0010 (size: 0x4)
    FVector Location;                                                                 // 0x0018 (size: 0x18)
    float Yaw;                                                                        // 0x0030 (size: 0x4)
    class UPalSquad* Squad;                                                           // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FPalNPCTalkData
{
    EPalNPCTalkCommand TalkCommand;                                                   // 0x0000 (size: 0x1)
    TArray<FName> MessageIDList;                                                      // 0x0008 (size: 0x10)
    TArray<FName> ChoiceMessageIDList;                                                // 0x0018 (size: 0x10)
    FName TalkerNameID;                                                               // 0x0028 (size: 0x8)
    FName CustomFuncName;                                                             // 0x0030 (size: 0x8)
    bool isCloseWhenCalledCustomFunc;                                                 // 0x0038 (size: 0x1)
    class UDataTable* CustomFuncParam;                                                // 0x0040 (size: 0x8)
    TArray<FPalNPCTalkSelectedChoiceCommandData> SelectedChoiceCommandDataList;       // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FPalNPCTalkDataTableRow : public FTableRowBase
{
    TArray<FPalNPCTalkData> TalkData;                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalNPCTalkNotifyInfo
{
    class UDataTable* TalkDataTable;                                                  // 0x0000 (size: 0x8)
    int32 TalkDataIndex;                                                              // 0x0008 (size: 0x4)
    FName TalkDataSeqenceName;                                                        // 0x000C (size: 0x8)

}; // Size: 0x18

struct FPalNPCTalkSelectedChoiceCommandData
{
    EPalNPCTalkSelectedChoiceCommand selectedChoiceCommand;                           // 0x0000 (size: 0x1)
    FName SeqenceName;                                                                // 0x0004 (size: 0x8)
    FName CustomFuncName;                                                             // 0x000C (size: 0x8)
    bool isCloseWhenCalledCustomFunc;                                                 // 0x0014 (size: 0x1)
    class UDataTable* CustomFuncParam;                                                // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FPalNPCTalkSystemCustomFunctionParameters
{
    TScriptInterface<class IPalNPCTalkSystemCustomFunctionInterface> Interface;       // 0x0000 (size: 0x10)
    class UDataTable* FuncParameter;                                                  // 0x0010 (size: 0x8)
    int32 TalkDataIndex;                                                              // 0x0018 (size: 0x4)
    FName TalkDataSeqenceName;                                                        // 0x001C (size: 0x8)

}; // Size: 0x28

struct FPalNPCWeaponCombatInfo
{
    TSubclassOf<class UPalAIActionBase> CombatAIActionClass;                          // 0x0000 (size: 0x8)
    int32 NPCWeaponRange_Near_cm;                                                     // 0x0008 (size: 0x4)
    int32 NPCWeaponRange_Far_cm;                                                      // 0x000C (size: 0x4)
    float ShootInterval;                                                              // 0x0010 (size: 0x4)
    int32 MaxShootCount;                                                              // 0x0014 (size: 0x4)
    float ReloadTime;                                                                 // 0x0018 (size: 0x4)
    float RandomMoveTime_Min;                                                         // 0x001C (size: 0x4)
    float AimOffset_Height;                                                           // 0x0020 (size: 0x4)
    bool UseSideDashMovement;                                                         // 0x0024 (size: 0x1)
    bool UseReloadMotion;                                                             // 0x0025 (size: 0x1)
    bool MeleeAttackWithGun;                                                          // 0x0026 (size: 0x1)
    float AimRotateSpeed;                                                             // 0x0028 (size: 0x4)
    TSubclassOf<class UPalStateMachineStateBase> FireStateClass;                      // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FPalNavigationDividedAreaInfo
{
}; // Size: 0x50

struct FPalNavigationUpdateFrequencySetting
{
    int32 UpdateDivideRate;                                                           // 0x0000 (size: 0x4)
    FVector2D UpdatableRangeMinMaxFromPlayer;                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalNetArchive
{
    TArray<uint8> Bytes;                                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalNetworkChangeIndividualID
{
}; // Size: 0x60

struct FPalNetworkCharacterContainerParameter
{
}; // Size: 0x58

struct FPalNetworkContainerParameter
{
}; // Size: 0x20

struct FPalNetworkDynamicItemParameter
{
}; // Size: 0x30

struct FPalNetworkItemOperationParameter
{
}; // Size: 0x20

struct FPalNetworkMapObjectSpawnRequestParameter
{
}; // Size: 0x10

struct FPalNetworkParameter
{
}; // Size: 0x10

struct FPalNetworkPlayerObtainClientParameter
{
}; // Size: 0x10

struct FPalNetworkTransmitterDelaySpawnInfo
{
    FGuid SpawnGUID;                                                                  // 0x0010 (size: 0x10)
    class AActor* SpawnActor;                                                         // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalNoteMasterData : public FTableRowBase
{
    FName TextId_Description;                                                         // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalNoteMasterDataTextureTableRow : public FTableRowBase
{
    TSoftObjectPtr<UTexture2D> Texture;                                               // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FPalObjectCollectorCalcNearestCharacterTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FPalObjectCollectorTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FPalOptimizeParameter
{
    int32 FoliageISMDistance_Meters;                                                  // 0x0000 (size: 0x4)
    float TargetFPS;                                                                  // 0x0004 (size: 0x4)
    float MinFPS;                                                                     // 0x0008 (size: 0x4)
    float MaxFPS;                                                                     // 0x000C (size: 0x4)
    int32 CharacterImportance_CheckNumberPerFrame;                                    // 0x0010 (size: 0x4)
    int32 CharacterImportance_NearestCount;                                           // 0x0014 (size: 0x4)
    float CharacterImportance_NearDistance;                                           // 0x0018 (size: 0x4)
    float CharacterImportance_FarDistance;                                            // 0x001C (size: 0x4)
    float CharacterImportance_FarthestDistance;                                       // 0x0020 (size: 0x4)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Actor;  // 0x0028 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Movement; // 0x0078 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Mesh;   // 0x00C8 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Action; // 0x0118 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Status; // 0x0168 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_LookAt; // 0x01B8 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_VisualEffect; // 0x0208 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Shooter; // 0x0258 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_FlyMesh; // 0x02A8 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Controller; // 0x02F8 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_AIAction; // 0x0348 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_AISensor; // 0x0398 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_PathFollowing; // 0x03E8 (size: 0x50)
    float SpawnerImportance_NearDistance;                                             // 0x0438 (size: 0x4)
    float SpawnerImportance_FarDistance;                                              // 0x043C (size: 0x4)
    TMap<EPalSpwnerImportanceType, float> SpawnerImportance_TickInterval_NPCSpawner;  // 0x0440 (size: 0x50)

}; // Size: 0x490

struct FPalOptionAudioSettings
{
    float Master;                                                                     // 0x0000 (size: 0x4)
    float BGM;                                                                        // 0x0004 (size: 0x4)
    float SE;                                                                         // 0x0008 (size: 0x4)
    float PalVoice;                                                                   // 0x000C (size: 0x4)
    float HumanVoice;                                                                 // 0x0010 (size: 0x4)
    float Ambient;                                                                    // 0x0014 (size: 0x4)
    float UI;                                                                         // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FPalOptionCommonSettings
{
    float PalRideCameraLengthRate;                                                    // 0x0000 (size: 0x4)
    float FOV;                                                                        // 0x0004 (size: 0x4)
    bool bEnableMotionBlur;                                                           // 0x0008 (size: 0x1)
    bool bEnableCameraShake;                                                          // 0x0009 (size: 0x1)
    TArray<FString> HistoryServerWorldGUID;                                           // 0x0010 (size: 0x10)
    float Brightness;                                                                 // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FPalOptionGraphicsPresetRow : public FTableRowBase
{
    EPalOptionGraphicsLevel GraphicsLevel;                                            // 0x0008 (size: 0x1)
    TEnumAsByte<EAntiAliasingMethod> AntiAliasingType;                                // 0x0009 (size: 0x1)
    int32 CommonQuality;                                                              // 0x000C (size: 0x4)
    int32 ViewDistanceQuality;                                                        // 0x0010 (size: 0x4)
    int32 FoliageQuality;                                                             // 0x0014 (size: 0x4)
    int32 ShadowQuality;                                                              // 0x0018 (size: 0x4)
    int32 TextureQuality;                                                             // 0x001C (size: 0x4)

}; // Size: 0x20

struct FPalOptionGraphicsSettings
{
    EPalOptionGraphicsLevel GraphicsLevel;                                            // 0x0000 (size: 0x1)
    TEnumAsByte<EWindowMode::Type> WindowMode;                                        // 0x0001 (size: 0x1)
    FIntPoint ScreenResolution;                                                       // 0x0004 (size: 0x8)
    bool bEnableVSync;                                                                // 0x000C (size: 0x1)
    bool bEnableMotionBlur;                                                           // 0x000D (size: 0x1)
    TEnumAsByte<EAntiAliasingMethod> AntiAliasingType;                                // 0x000E (size: 0x1)
    bool bEnableCameraShake;                                                          // 0x000F (size: 0x1)
    bool bEnableCameraRecoil;                                                         // 0x0010 (size: 0x1)
    float FOV;                                                                        // 0x0014 (size: 0x4)
    float PalRideCameraLengthRate;                                                    // 0x0018 (size: 0x4)
    float LODBias;                                                                    // 0x001C (size: 0x4)
    float DrawDistance;                                                               // 0x0020 (size: 0x4)
    float GrassDrawDistance;                                                          // 0x0024 (size: 0x4)
    bool bEnableShadow;                                                               // 0x0028 (size: 0x1)
    float ShadowResolution;                                                           // 0x002C (size: 0x4)
    int32 CommonQuality;                                                              // 0x0030 (size: 0x4)
    int32 ViewDistanceQuality;                                                        // 0x0034 (size: 0x4)
    int32 FoliageQuality;                                                             // 0x0038 (size: 0x4)
    int32 ShadowQuality;                                                              // 0x003C (size: 0x4)
    float Brightness;                                                                 // 0x0040 (size: 0x4)
    bool bEnableAutoContrast;                                                         // 0x0044 (size: 0x1)
    int32 TextureQuality;                                                             // 0x0048 (size: 0x4)
    UDLSSMode DLSSMode;                                                               // 0x004C (size: 0x1)
    float MaxFPS;                                                                     // 0x0050 (size: 0x4)

}; // Size: 0x54

struct FPalOptionKeyboardSettings
{
    bool bIsDashHold;                                                                 // 0x0000 (size: 0x1)
    float MouseSensitivity;                                                           // 0x0004 (size: 0x4)
    float MouseAimSensitivity;                                                        // 0x0008 (size: 0x4)
    bool bIsReverseYaw;                                                               // 0x000C (size: 0x1)
    bool bIsReversePitch;                                                             // 0x000D (size: 0x1)
    bool bEnableAimAssist;                                                            // 0x000E (size: 0x1)
    bool bShowChat;                                                                   // 0x000F (size: 0x1)
    bool bIsToggleInteract;                                                           // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FPalOptionLocalStaticSettings
{
    FPalOptionValueFloat MouseSensitivity;                                            // 0x0000 (size: 0x8)
    FPalOptionValueFloat MouseAimSensitivity;                                         // 0x0008 (size: 0x8)
    FPalOptionValueFloat LeftStickThreshold;                                          // 0x0010 (size: 0x8)
    FPalOptionValueFloat RightStickSensitivity;                                       // 0x0018 (size: 0x8)
    FPalOptionValueFloat RightStickAimSensitivity;                                    // 0x0020 (size: 0x8)
    FPalOptionValueFloat RightStickThreshold;                                         // 0x0028 (size: 0x8)
    FPalOptionValueFloat PalRideCameraLengthRate;                                     // 0x0030 (size: 0x8)
    FPalOptionValueFloat FOV;                                                         // 0x0038 (size: 0x8)
    FPalOptionValueFloat DamageTextScale;                                             // 0x0040 (size: 0x8)
    FPalOptionValueFloat DamageTextMaxNum;                                            // 0x0048 (size: 0x8)

}; // Size: 0x50

struct FPalOptionPadSettings
{
    bool bIsDashHold;                                                                 // 0x0000 (size: 0x1)
    float LeftStickThreshold;                                                         // 0x0004 (size: 0x4)
    float RightStickSensitivity;                                                      // 0x0008 (size: 0x4)
    float RightStickAimSensitivity;                                                   // 0x000C (size: 0x4)
    float RightStickThreshold;                                                        // 0x0010 (size: 0x4)
    bool bIsRightStickReverseYaw;                                                     // 0x0014 (size: 0x1)
    bool bIsRightStickReversePitch;                                                   // 0x0015 (size: 0x1)
    bool bEnableVibration;                                                            // 0x0016 (size: 0x1)
    bool bEnableAimAssist;                                                            // 0x0017 (size: 0x1)
    bool bIsToggleInteract;                                                           // 0x0018 (size: 0x1)

}; // Size: 0x1C

struct FPalOptionSaveData
{
    FPalOptionKeyboardSettings KeyboardSettings;                                      // 0x0000 (size: 0x14)
    FPalOptionPadSettings PadSettings;                                                // 0x0014 (size: 0x1C)
    FPalKeyConfigSettings KeyConfigSettings;                                          // 0x0030 (size: 0x160)
    FPalOptionUISettings UISettings;                                                  // 0x0190 (size: 0xC)
    FPalOptionCommonSettings CommonSettings;                                          // 0x01A0 (size: 0x28)
    FPalOptionGraphicsSettings GraphicsSettings;                                      // 0x01C8 (size: 0x54)
    FPalOptionAudioSettings AudioSettings;                                            // 0x021C (size: 0x1C)
    bool bHasAppliedUserSetting;                                                      // 0x0238 (size: 0x1)

}; // Size: 0x240

struct FPalOptionUISettings
{
    float DamageTextScale;                                                            // 0x0000 (size: 0x4)
    int32 DamageTextMaxNum;                                                           // 0x0004 (size: 0x4)
    bool DisplayTutorial;                                                             // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FPalOptionValueFloat
{
    float Min;                                                                        // 0x0000 (size: 0x4)
    float Max;                                                                        // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalOptionValueInt
{
    int32 Min;                                                                        // 0x0000 (size: 0x4)
    int32 Max;                                                                        // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalOptionWorldModePresetRow : public FTableRowBase
{
    EPalOptionWorldMode WorldMode;                                                    // 0x0008 (size: 0x1)
    bool bEnablePlayerToPlayerDamage;                                                 // 0x0009 (size: 0x1)
    bool bCanPickupOtherGuildDeathPenaltyDrop;                                        // 0x000A (size: 0x1)
    bool bEnableNonLoginPenalty;                                                      // 0x000B (size: 0x1)
    bool bEnableFastTravel;                                                           // 0x000C (size: 0x1)
    bool bIsStartLocationSelectByMap;                                                 // 0x000D (size: 0x1)
    bool bExistPlayerAfterLogout;                                                     // 0x000E (size: 0x1)
    bool bEnableDefenseOtherGuildPlayer;                                              // 0x000F (size: 0x1)

}; // Size: 0x10

struct FPalOptionWorldPresetRow : public FTableRowBase
{
    EPalOptionWorldDifficulty Diffculty;                                              // 0x0008 (size: 0x1)
    float DayTimeSpeedRate;                                                           // 0x000C (size: 0x4)
    float NightTimeSpeedRate;                                                         // 0x0010 (size: 0x4)
    float ExpRate;                                                                    // 0x0014 (size: 0x4)
    float PalCaptureRate;                                                             // 0x0018 (size: 0x4)
    float PalSpawnNumRate;                                                            // 0x001C (size: 0x4)
    float PalDamageRateAttack;                                                        // 0x0020 (size: 0x4)
    float PalDamageRateDefense;                                                       // 0x0024 (size: 0x4)
    float PlayerDamageRateAttack;                                                     // 0x0028 (size: 0x4)
    float PlayerDamageRateDefense;                                                    // 0x002C (size: 0x4)
    float PlayerStomachDecreaceRate;                                                  // 0x0030 (size: 0x4)
    float PlayerStaminaDecreaceRate;                                                  // 0x0034 (size: 0x4)
    float PlayerAutoHPRegeneRate;                                                     // 0x0038 (size: 0x4)
    float PlayerAutoHpRegeneRateInSleep;                                              // 0x003C (size: 0x4)
    float PalStomachDecreaceRate;                                                     // 0x0040 (size: 0x4)
    float PalStaminaDecreaceRate;                                                     // 0x0044 (size: 0x4)
    float PalAutoHPRegeneRate;                                                        // 0x0048 (size: 0x4)
    float PalAutoHpRegeneRateInSleep;                                                 // 0x004C (size: 0x4)
    float BuildObjectDamageRate;                                                      // 0x0050 (size: 0x4)
    float BuildObjectDeteriorationDamageRate;                                         // 0x0054 (size: 0x4)
    float CollectionDropRate;                                                         // 0x0058 (size: 0x4)
    float CollectionObjectHpRate;                                                     // 0x005C (size: 0x4)
    float CollectionObjectRespawnSpeedRate;                                           // 0x0060 (size: 0x4)
    float EnemyDropItemRate;                                                          // 0x0064 (size: 0x4)
    EPalOptionWorldDeathPenalty DeathPenalty;                                         // 0x0068 (size: 0x1)
    bool bActiveUNKO;                                                                 // 0x0069 (size: 0x1)
    int32 DropItemMaxNum_UNKO;                                                        // 0x006C (size: 0x4)
    bool bEnableInvaderEnemy;                                                         // 0x0070 (size: 0x1)
    int32 DropItemMaxNum;                                                             // 0x0074 (size: 0x4)
    bool bAutoResetGuildNoOnlinePlayers;                                              // 0x0078 (size: 0x1)
    float AutoResetGuildTimeNoOnlinePlayers;                                          // 0x007C (size: 0x4)
    int32 GuildPlayerMaxNum;                                                          // 0x0080 (size: 0x4)
    float PalEggDefaultHatchingTime;                                                  // 0x0084 (size: 0x4)
    int32 BaseCampWorkerMaxNum;                                                       // 0x0088 (size: 0x4)

}; // Size: 0x90

struct FPalOptionWorldSaveData
{
    FPalOptionWorldSettings Settings;                                                 // 0x0000 (size: 0x138)

}; // Size: 0x138

struct FPalOptionWorldSettings
{
    EPalOptionWorldDifficulty Difficulty;                                             // 0x0000 (size: 0x1)
    float DayTimeSpeedRate;                                                           // 0x0004 (size: 0x4)
    float NightTimeSpeedRate;                                                         // 0x0008 (size: 0x4)
    float ExpRate;                                                                    // 0x000C (size: 0x4)
    float PalCaptureRate;                                                             // 0x0010 (size: 0x4)
    float PalSpawnNumRate;                                                            // 0x0014 (size: 0x4)
    float PalDamageRateAttack;                                                        // 0x0018 (size: 0x4)
    float PalDamageRateDefense;                                                       // 0x001C (size: 0x4)
    float PlayerDamageRateAttack;                                                     // 0x0020 (size: 0x4)
    float PlayerDamageRateDefense;                                                    // 0x0024 (size: 0x4)
    float PlayerStomachDecreaceRate;                                                  // 0x0028 (size: 0x4)
    float PlayerStaminaDecreaceRate;                                                  // 0x002C (size: 0x4)
    float PlayerAutoHPRegeneRate;                                                     // 0x0030 (size: 0x4)
    float PlayerAutoHpRegeneRateInSleep;                                              // 0x0034 (size: 0x4)
    float PalStomachDecreaceRate;                                                     // 0x0038 (size: 0x4)
    float PalStaminaDecreaceRate;                                                     // 0x003C (size: 0x4)
    float PalAutoHPRegeneRate;                                                        // 0x0040 (size: 0x4)
    float PalAutoHpRegeneRateInSleep;                                                 // 0x0044 (size: 0x4)
    float BuildObjectDamageRate;                                                      // 0x0048 (size: 0x4)
    float BuildObjectDeteriorationDamageRate;                                         // 0x004C (size: 0x4)
    float CollectionDropRate;                                                         // 0x0050 (size: 0x4)
    float CollectionObjectHpRate;                                                     // 0x0054 (size: 0x4)
    float CollectionObjectRespawnSpeedRate;                                           // 0x0058 (size: 0x4)
    float EnemyDropItemRate;                                                          // 0x005C (size: 0x4)
    EPalOptionWorldDeathPenalty DeathPenalty;                                         // 0x0060 (size: 0x1)
    bool bEnablePlayerToPlayerDamage;                                                 // 0x0061 (size: 0x1)
    bool bEnableFriendlyFire;                                                         // 0x0062 (size: 0x1)
    bool bEnableInvaderEnemy;                                                         // 0x0063 (size: 0x1)
    bool bActiveUNKO;                                                                 // 0x0064 (size: 0x1)
    bool bEnableAimAssistPad;                                                         // 0x0065 (size: 0x1)
    bool bEnableAimAssistKeyboard;                                                    // 0x0066 (size: 0x1)
    int32 DropItemMaxNum;                                                             // 0x0068 (size: 0x4)
    int32 DropItemMaxNum_UNKO;                                                        // 0x006C (size: 0x4)
    int32 BaseCampMaxNum;                                                             // 0x0070 (size: 0x4)
    int32 BaseCampWorkerMaxNum;                                                       // 0x0074 (size: 0x4)
    float DropItemAliveMaxHours;                                                      // 0x0078 (size: 0x4)
    bool bAutoResetGuildNoOnlinePlayers;                                              // 0x007C (size: 0x1)
    float AutoResetGuildTimeNoOnlinePlayers;                                          // 0x0080 (size: 0x4)
    int32 GuildPlayerMaxNum;                                                          // 0x0084 (size: 0x4)
    float PalEggDefaultHatchingTime;                                                  // 0x0088 (size: 0x4)
    float WorkSpeedRate;                                                              // 0x008C (size: 0x4)
    bool bIsMultiplay;                                                                // 0x0090 (size: 0x1)
    bool bIsPvP;                                                                      // 0x0091 (size: 0x1)
    bool bCanPickupOtherGuildDeathPenaltyDrop;                                        // 0x0092 (size: 0x1)
    bool bEnableNonLoginPenalty;                                                      // 0x0093 (size: 0x1)
    bool bEnableFastTravel;                                                           // 0x0094 (size: 0x1)
    bool bIsStartLocationSelectByMap;                                                 // 0x0095 (size: 0x1)
    bool bExistPlayerAfterLogout;                                                     // 0x0096 (size: 0x1)
    bool bEnableDefenseOtherGuildPlayer;                                              // 0x0097 (size: 0x1)
    int32 CoopPlayerMaxNum;                                                           // 0x0098 (size: 0x4)
    int32 ServerPlayerMaxNum;                                                         // 0x009C (size: 0x4)
    FString ServerName;                                                               // 0x00A0 (size: 0x10)
    FString ServerDescription;                                                        // 0x00B0 (size: 0x10)
    FString AdminPassword;                                                            // 0x00C0 (size: 0x10)
    FString ServerPassword;                                                           // 0x00D0 (size: 0x10)
    int32 PublicPort;                                                                 // 0x00E0 (size: 0x4)
    FString PublicIP;                                                                 // 0x00E8 (size: 0x10)
    bool RCONEnabled;                                                                 // 0x00F8 (size: 0x1)
    int32 RCONPort;                                                                   // 0x00FC (size: 0x4)
    FString Region;                                                                   // 0x0100 (size: 0x10)
    bool bUseAuth;                                                                    // 0x0110 (size: 0x1)
    FString BanListURL;                                                               // 0x0118 (size: 0x10)
    bool RESTAPIEnabled;                                                              // 0x0128 (size: 0x1)
    int32 RESTAPIPort;                                                                // 0x012C (size: 0x4)
    bool bShowPlayerList;                                                             // 0x0130 (size: 0x1)
    EPalAllowConnectPlatform AllowConnectPlatform;                                    // 0x0131 (size: 0x1)
    bool bIsUseBackupSaveData;                                                        // 0x0132 (size: 0x1)
    EPalLogFormatType LogFormatType;                                                  // 0x0133 (size: 0x1)

}; // Size: 0x138

struct FPalOptionWorldStaticSettings
{
    FPalOptionValueFloat DayTimeSpeedRate;                                            // 0x0000 (size: 0x8)
    FPalOptionValueFloat NightTimeSpeedRate;                                          // 0x0008 (size: 0x8)
    FPalOptionValueFloat ExpRate;                                                     // 0x0010 (size: 0x8)
    FPalOptionValueFloat PalCaptureRate;                                              // 0x0018 (size: 0x8)
    FPalOptionValueFloat PalSpawnNumRate;                                             // 0x0020 (size: 0x8)
    FPalOptionValueFloat PalDamageRateAttack;                                         // 0x0028 (size: 0x8)
    FPalOptionValueFloat PalDamageRateDefense;                                        // 0x0030 (size: 0x8)
    FPalOptionValueFloat PlayerDamageRateAttack;                                      // 0x0038 (size: 0x8)
    FPalOptionValueFloat PlayerDamageRateDefense;                                     // 0x0040 (size: 0x8)
    FPalOptionValueFloat PlayerStomachDecreaceRate;                                   // 0x0048 (size: 0x8)
    FPalOptionValueFloat PlayerStaminaDecreaceRate;                                   // 0x0050 (size: 0x8)
    FPalOptionValueFloat PlayerAutoHPRegeneRate;                                      // 0x0058 (size: 0x8)
    FPalOptionValueFloat PlayerAutoHpRegeneRateInSleep;                               // 0x0060 (size: 0x8)
    FPalOptionValueFloat PalStomachDecreaceRate;                                      // 0x0068 (size: 0x8)
    FPalOptionValueFloat PalStaminaDecreaceRate;                                      // 0x0070 (size: 0x8)
    FPalOptionValueFloat PalAutoHPRegeneRate;                                         // 0x0078 (size: 0x8)
    FPalOptionValueFloat PalAutoHpRegeneRateInSleep;                                  // 0x0080 (size: 0x8)
    FPalOptionValueFloat BuildObjectDamageRate;                                       // 0x0088 (size: 0x8)
    FPalOptionValueFloat BuildObjectDeteriorationDamageRate;                          // 0x0090 (size: 0x8)
    FPalOptionValueFloat CollectionDropRate;                                          // 0x0098 (size: 0x8)
    FPalOptionValueFloat CollectionObjectHpRate;                                      // 0x00A0 (size: 0x8)
    FPalOptionValueFloat CollectionObjectRespawnSpeedRate;                            // 0x00A8 (size: 0x8)
    FPalOptionValueFloat EnemyDropItemRate;                                           // 0x00B0 (size: 0x8)
    FPalOptionValueInt DropItemMaxNum;                                                // 0x00B8 (size: 0x8)
    FPalOptionValueInt DropItemMaxNum_UNKO;                                           // 0x00C0 (size: 0x8)
    FPalOptionValueFloat WorkSpeedRate;                                               // 0x00C8 (size: 0x8)
    FPalOptionValueInt AutoResetGuildTimeNoOnlinePlayers;                             // 0x00D0 (size: 0x8)
    FPalOptionValueInt GuildPlayerMaxNum;                                             // 0x00D8 (size: 0x8)
    FPalOptionValueInt PalEggDefaultHatchingTime;                                     // 0x00E0 (size: 0x8)
    FPalOptionValueInt BaseCampWorkerMaxNum;                                          // 0x00E8 (size: 0x8)

}; // Size: 0xF0

struct FPalOrderedQuestSaveData
{
    FName QuestName;                                                                  // 0x0000 (size: 0x8)
    int32 BlockIndex;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalPalShopCreateDataRow : public FTableRowBase
{
    int32 MaxLostPalNum;                                                              // 0x0008 (size: 0x4)
    int32 CharacterNum;                                                               // 0x000C (size: 0x4)
    TArray<FPalDataTableRowName_PalMonsterData> CharacterIDArray;                     // 0x0010 (size: 0x10)
    int32 MinCharacterLevel;                                                          // 0x0020 (size: 0x4)
    int32 MaxCharacterLevel;                                                          // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FPalPartnerSkillDatabaseRow : public FTableRowBase
{
    FName DevName;                                                                    // 0x0008 (size: 0x8)
    float EffectTime;                                                                 // 0x0010 (size: 0x4)
    float CoolDownTime;                                                               // 0x0014 (size: 0x4)
    float ExecCost;                                                                   // 0x0018 (size: 0x4)
    float IdleCost;                                                                   // 0x001C (size: 0x4)
    bool CanThrowPal;                                                                 // 0x0020 (size: 0x1)
    bool CanChangeWeapon;                                                             // 0x0021 (size: 0x1)
    bool IsToggleKey;                                                                 // 0x0022 (size: 0x1)

}; // Size: 0x28

struct FPalPartnerSkillParameterQueryFunction
{
}; // Size: 0x20

struct FPalPartnerSkillParameterRide
{
    float JumpZVelocityScale;                                                         // 0x0000 (size: 0x4)
    float GravityScale;                                                               // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalPassiveAbilitySkillParameters
{
    float DelayTime;                                                                  // 0x0000 (size: 0x4)
    EPalWorkType WorkType;                                                            // 0x0004 (size: 0x1)
    TArray<FPalDataTableRowName_MapObjectData> MapObjectId;                           // 0x0008 (size: 0x10)
    TArray<FPalDataTableRowName_ItemData> ItemId;                                     // 0x0018 (size: 0x10)
    bool AssignOthers;                                                                // 0x0028 (size: 0x1)
    EPalElementType TargetElementType;                                                // 0x0029 (size: 0x1)

}; // Size: 0x38

struct FPalPassiveAbilitySkillStatus
{
    EPalPassiveAbilitySkillState State;                                               // 0x0000 (size: 0x1)
    float ElapsedTime;                                                                // 0x0004 (size: 0x4)
    TArray<FName> Flags;                                                              // 0x0008 (size: 0x10)
    EPalPassiveTriggerType TriggerType;                                               // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalPassiveAbilitySkills
{
    TArray<FPalPassiveAbilitySkillParameters> AllAbilityPassiveSkills;                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalPassivePartnerSkillFindOtomoParameter
{
    EPalElementType TargetElementType;                                                // 0x0000 (size: 0x1)
    TArray<FPalDataTableRowName_PalMonsterData> TargetPalIds;                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalPassivePartnerSkillIdAndParameters
{
    TMap<class FPalDataTableRowName_PassiveSkillData, class FPalPassivePartnerSkillParameters> SkillAndParameters; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalPassivePartnerSkillItemParameter
{
    EPalItemTypeA ItemTypeA;                                                          // 0x0000 (size: 0x1)
    EPalItemTypeB ItemTypeB;                                                          // 0x0001 (size: 0x1)
    TArray<FPalDataTableRowName_ItemData> ItemIds;                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalPassivePartnerSkillParameters
{
    float DelayTime;                                                                  // 0x0000 (size: 0x4)
    int32 TriggerTypeFlags;                                                           // 0x0004 (size: 0x4)
    EPalWorkType WorkType;                                                            // 0x0008 (size: 0x1)
    TArray<FPalDataTableRowName_MapObjectData> MapObjectId;                           // 0x0010 (size: 0x10)
    TArray<FPalDataTableRowName_ItemData> ItemId;                                     // 0x0020 (size: 0x10)
    bool AssignOthers;                                                                // 0x0030 (size: 0x1)
    EPalElementType TargetElementType;                                                // 0x0031 (size: 0x1)
    TArray<FPalDataTableRowName_PalMonsterData> PalIds;                               // 0x0038 (size: 0x10)
    bool bNotAssignSelf;                                                              // 0x0048 (size: 0x1)
    FPalPassivePartnerSkillItemParameter ItemParam;                                   // 0x0050 (size: 0x18)

}; // Size: 0x70

struct FPalPassivePartnerSkillStatus
{
    EPalPassivePartnerSkillState State;                                               // 0x0000 (size: 0x1)
    float ElapsedTime;                                                                // 0x0004 (size: 0x4)
    TArray<FName> Flags;                                                              // 0x0008 (size: 0x10)
    FPalPassivePartnerSkillItemParameter ItemParam;                                   // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FPalPassiveSkillAssignInfo
{
    bool isDoNotSetSkills;                                                            // 0x0000 (size: 0x1)
    TArray<FName> ForceSetSkillList;                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalPassiveSkillDatabaseRow : public FTableRowBase
{
    int32 Rank;                                                                       // 0x0008 (size: 0x4)
    FName OverrideDescMsgID;                                                          // 0x000C (size: 0x8)
    EPalPassiveSkillEffectType EffectType1;                                           // 0x0014 (size: 0x1)
    float EffectValue1;                                                               // 0x0018 (size: 0x4)
    EPalPassiveSkillEffectTargetType TargetType1;                                     // 0x001C (size: 0x1)
    EPalPassiveSkillEffectType EffectType2;                                           // 0x001D (size: 0x1)
    float EffectValue2;                                                               // 0x0020 (size: 0x4)
    EPalPassiveSkillEffectTargetType TargetType2;                                     // 0x0024 (size: 0x1)
    EPalPassiveSkillEffectType EffectType3;                                           // 0x0025 (size: 0x1)
    float EffectValue3;                                                               // 0x0028 (size: 0x4)
    EPalPassiveSkillEffectTargetType TargetType3;                                     // 0x002C (size: 0x1)
    bool InvokeActiveOtomo;                                                           // 0x002D (size: 0x1)
    bool InvokeWorker;                                                                // 0x002E (size: 0x1)
    bool InvokeRiding;                                                                // 0x002F (size: 0x1)
    bool InvokeReserve;                                                               // 0x0030 (size: 0x1)
    bool InvokeInOtomo;                                                               // 0x0031 (size: 0x1)
    bool InvokeAlways;                                                                // 0x0032 (size: 0x1)
    bool AddPal;                                                                      // 0x0033 (size: 0x1)
    bool AddRarePal;                                                                  // 0x0034 (size: 0x1)
    bool AddShotWeapon;                                                               // 0x0035 (size: 0x1)
    bool AddMeleeWeapon;                                                              // 0x0036 (size: 0x1)
    bool AddArmor;                                                                    // 0x0037 (size: 0x1)
    bool AddAccessory;                                                                // 0x0038 (size: 0x1)
    FName OverrideNameTextID;                                                         // 0x003C (size: 0x8)
    FName OverrideSummaryTextId;                                                      // 0x0044 (size: 0x8)

}; // Size: 0x50

struct FPalPassiveSkillEffect
{
    EPalPassiveSkillEffectType Type;                                                  // 0x0000 (size: 0x1)
    float Value;                                                                      // 0x0004 (size: 0x4)
    TArray<FName> Flags;                                                              // 0x0008 (size: 0x10)
    FPalPassivePartnerSkillItemParameter ItemParam;                                   // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FPalPassiveSkillEffectInfos
{
    TArray<FPalPassiveSkillEffect> SkillEffectArray;                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalPassiveSkillSetupInfo
{
    FName SkillName;                                                                  // 0x0000 (size: 0x8)
    TArray<FName> Flags;                                                              // 0x0008 (size: 0x10)
    FPalPassivePartnerSkillItemParameter ItemParam;                                   // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FPalPathFollowingBlockDetectionParams
{
    float BlockDetectionDistance;                                                     // 0x0000 (size: 0x4)
    float BlockDetectionInterval;                                                     // 0x0004 (size: 0x4)
    int32 BlockDetectionSampleCount;                                                  // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalPettingParameter
{
    float CameraCenterDistance;                                                       // 0x0000 (size: 0x4)
    float CameraHeight;                                                               // 0x0004 (size: 0x4)
    float CameraArmLength;                                                            // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalPhantomReplicateInfo
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    class APalCharacter* Character;                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalPlayerAccountInitData
{
    FString CharacterName;                                                            // 0x0000 (size: 0x10)
    FPalPlayerDataCharacterMakeInfo CharacterMakeData;                                // 0x0010 (size: 0x94)

}; // Size: 0xA8

struct FPalPlayerBattleEnemyInfo
{
    EPalBattleBGMType Rank;                                                           // 0x0000 (size: 0x1)
    TWeakObjectPtr<class AActor> WeakActor;                                           // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FPalPlayerClassStructSet
{
    TSubclassOf<class UPalPlayerDataCharacterMake> CharacterMakeDataClass;            // 0x0000 (size: 0x8)
    TSubclassOf<class UPalPlayerRecordData> RecordDataClass;                          // 0x0008 (size: 0x8)
    TSubclassOf<class UPalWorldMapUIData> WorldMapUIDataClass;                        // 0x0010 (size: 0x8)
    TSubclassOf<class UPalQuestManager> LocalQuestManagerClass;                       // 0x0018 (size: 0x8)
    TSubclassOf<class UPalPlayerInventoryData> InventoryDataClass;                    // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalPlayerDamageCameraShakeData : public FTableRowBase
{
    EPalPlayerDamageCameraShakeCategory Category;                                     // 0x0008 (size: 0x1)
    float Scale_Min;                                                                  // 0x000C (size: 0x4)
    float Scale_Default;                                                              // 0x0010 (size: 0x4)
    float Scale_Max;                                                                  // 0x0014 (size: 0x4)
    int32 HPRate_Min;                                                                 // 0x0018 (size: 0x4)
    int32 HPRate_Default;                                                             // 0x001C (size: 0x4)
    int32 HPRate_Max;                                                                 // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FPalPlayerDataCharacterMakeInfo
{
    FName BodyMeshName;                                                               // 0x0000 (size: 0x8)
    FName HeadMeshName;                                                               // 0x0008 (size: 0x8)
    FName HairMeshName;                                                               // 0x0010 (size: 0x8)
    FName EquipmentBodyMeshName;                                                      // 0x0018 (size: 0x8)
    FName EquipmentHeadMeshName;                                                      // 0x0020 (size: 0x8)
    bool DisableEquipmentHeadFlag;                                                    // 0x0028 (size: 0x1)
    float ArmVolume;                                                                  // 0x002C (size: 0x4)
    float TorsoVolume;                                                                // 0x0030 (size: 0x4)
    float LegVolume;                                                                  // 0x0034 (size: 0x4)
    FLinearColor HairColor;                                                           // 0x0038 (size: 0x10)
    FLinearColor BrowColor;                                                           // 0x0048 (size: 0x10)
    FLinearColor BodyColor;                                                           // 0x0058 (size: 0x10)
    FLinearColor BodySubsurfaceColor;                                                 // 0x0068 (size: 0x10)
    FLinearColor EyeColor;                                                            // 0x0078 (size: 0x10)
    FName EyeMaterialName;                                                            // 0x0088 (size: 0x8)
    int32 VoiceID;                                                                    // 0x0090 (size: 0x4)

}; // Size: 0x94

struct FPalPlayerDataInventoryInfo
{
    FPalContainerId CommonContainerId;                                                // 0x0000 (size: 0x10)
    FPalContainerId DropSlotContainerId;                                              // 0x0010 (size: 0x10)
    FPalContainerId EssentialContainerId;                                             // 0x0020 (size: 0x10)
    FPalContainerId WeaponLoadOutContainerId;                                         // 0x0030 (size: 0x10)
    FPalContainerId PlayerEquipArmorContainerId;                                      // 0x0040 (size: 0x10)
    FPalContainerId FoodEquipContainerId;                                             // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FPalPlayerDataPalStorageSlotSaveData
{
    FPalInstanceID IndividualId;                                                      // 0x0000 (size: 0x30)
    FPalIndividualCharacterSaveParameter CharacterSaveParameter;                      // 0x0030 (size: 0x280)
    FPalCharacterSlotId SlotID;                                                       // 0x02B0 (size: 0x14)

}; // Size: 0x2C8

struct FPalPlayerEquipmentMeshDataRow : public FTableRowBase
{
    TMap<class FName, class TSoftObjectPtr<USkeletalMesh>> SkeletalMeshMap;           // 0x0008 (size: 0x50)
    TMap<class FName, class TSoftClassPtr<UAnimInstance>> ABPAssetMap;                // 0x0058 (size: 0x50)
    bool IsHairAttachAccessory;                                                       // 0x00A8 (size: 0x1)
    TMap<class FName, class FName> HairAttachSocketNameMap;                           // 0x00B0 (size: 0x50)

}; // Size: 0x100

struct FPalPlayerInfoForMap
{
    FString PlayerName;                                                               // 0x0000 (size: 0x10)
    FTransform Transform;                                                             // 0x0010 (size: 0x60)

}; // Size: 0x70

struct FPalPlayerInitializeParameter
{
    FPalIndividualCharacterSaveParameter InitParam;                                   // 0x0000 (size: 0x280)

}; // Size: 0x280

struct FPalPlayerInventorySelectData
{
    int32 nowSelectedContainerIndex;                                                  // 0x0000 (size: 0x4)
    class UPalItemContainer* targetItemContainer;                                     // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalPlayerParameterDatabaseRow : public FTableRowBase
{
    int32 Stamina;                                                                    // 0x0008 (size: 0x4)
    int32 HP;                                                                         // 0x000C (size: 0x4)
    int32 MeleeAttack;                                                                // 0x0010 (size: 0x4)
    int32 ShotAttack;                                                                 // 0x0014 (size: 0x4)
    int32 Defense;                                                                    // 0x0018 (size: 0x4)
    int32 Support;                                                                    // 0x001C (size: 0x4)
    int32 CraftSpeed;                                                                 // 0x0020 (size: 0x4)
    int32 Satiety;                                                                    // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FPalPlayerRecordCountMapStruct
{
    TMap<FName, int64> countMap;                                                      // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalPlayerRecordDataRepInfoArray_BoolVal : public FFastArraySerializer
{
    TArray<FPalPlayerRecordDataRepInfo_BoolVal> Items;                                // 0x0118 (size: 0x10)

}; // Size: 0x178

struct FPalPlayerRecordDataRepInfoArray_IntVal : public FFastArraySerializer
{
    TArray<FPalPlayerRecordDataRepInfo_IntVal> Items;                                 // 0x0118 (size: 0x10)

}; // Size: 0x178

struct FPalPlayerRecordDataRepInfo_BoolVal : public FFastArraySerializerItem
{
    FName Key;                                                                        // 0x000C (size: 0x8)
    bool Value;                                                                       // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FPalPlayerRecordDataRepInfo_IntVal : public FFastArraySerializerItem
{
    FName Key;                                                                        // 0x000C (size: 0x8)
    int32 Value;                                                                      // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPalPlayerRecordDataStruct
{
    TMap<FName, int64> simpleCountRecordMap;                                          // 0x0000 (size: 0x50)
    TMap<class FName, class bool> simpleFlagMap;                                      // 0x0050 (size: 0x50)
    TMap<class FName, class FPalPlayerRecordCountMapStruct> countMapRecordMap;        // 0x00A0 (size: 0x50)
    TMap<class FName, class FPalPlayerRecordFlagMapStruct> flagMapRecordMap;          // 0x00F0 (size: 0x50)

}; // Size: 0x140

struct FPalPlayerRecordFlagMapStruct
{
    TMap<class FName, class bool> flagMap;                                            // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalPlayerStatusRankMasterData : public FTableRowBase
{
    int32 Rank;                                                                       // 0x0008 (size: 0x4)
    int32 RequiredRelicNum;                                                           // 0x000C (size: 0x4)
    int32 ResetRequiredMoney;                                                         // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FPalQuestDataSetRow : public FTableRowBase
{
    TSoftClassPtr<UPalQuestData> QuestData;                                           // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FPalRESTAPIPlayerInfo
{
    FString Name;                                                                     // 0x0000 (size: 0x10)
    FString PlayerId;                                                                 // 0x0010 (size: 0x10)
    FString UserId;                                                                   // 0x0020 (size: 0x10)
    FString ip;                                                                       // 0x0030 (size: 0x10)
    float Ping;                                                                       // 0x0040 (size: 0x4)
    float location_x;                                                                 // 0x0044 (size: 0x4)
    float location_y;                                                                 // 0x0048 (size: 0x4)
    int32 Level;                                                                      // 0x004C (size: 0x4)

}; // Size: 0x50

struct FPalRadialCatalog
{
    TMap<int32, int32> Catalog;                                                       // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalRaidBossDataRow : public FTableRowBase
{
    TArray<FPalRaidBossSpawnInfo> InfoList;                                           // 0x0008 (size: 0x10)
    TMap<FPalDataTableRowName_PalMonsterData, float> EggPalIDAndWeight;               // 0x0018 (size: 0x50)
    TArray<FPalRaidBossSuccessItemInfo> SuccessItemList;                              // 0x0068 (size: 0x10)
    TArray<FPalRaidBossSuccessAnyOneItemInfo> SuccessAnyOneItemList;                  // 0x0078 (size: 0x10)
    FString AchievementId;                                                            // 0x0088 (size: 0x10)

}; // Size: 0x98

struct FPalRaidBossSpawnInfo
{
    FPalDataTableRowName_PalMonsterData PalID;                                        // 0x0000 (size: 0x8)
    int32 Level;                                                                      // 0x0008 (size: 0x4)
    EPalWazaID WarpWazaID;                                                            // 0x000C (size: 0x1)
    TArray<EPalWazaID> BaseCampAttackWazaIDs;                                         // 0x0010 (size: 0x10)
    bool CanModeChange;                                                               // 0x0020 (size: 0x1)
    EPalStatusID ModeChange_AddStatusToAllWhenModeChgange;                            // 0x0021 (size: 0x1)
    EPalElementType ModeChange_Element1;                                              // 0x0022 (size: 0x1)
    EPalElementType ModeChange_Element2;                                              // 0x0023 (size: 0x1)
    TArray<FName> ModeChange_AddPassiveSkill;                                         // 0x0028 (size: 0x10)
    TArray<EPalWazaID> ModeChange_AddWaza;                                            // 0x0038 (size: 0x10)
    TArray<EPalWazaID> ModeChange_RemoveWaza;                                         // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FPalRaidBossSpawnInfoList
{
    TArray<FPalRaidBossSpawnInfo> SpawnInfos;                                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalRaidBossSpawnerInfo
{
}; // Size: 0x60

struct FPalRaidBossSuccessAnyOneItemInfo
{
    FPalDataTableRowName_ItemData ItemName;                                           // 0x0000 (size: 0x8)
    int32 Num;                                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalRaidBossSuccessItemInfo
{
    FPalDataTableRowName_ItemData ItemName;                                           // 0x0000 (size: 0x8)
    float Rate;                                                                       // 0x0008 (size: 0x4)
    int32 Min;                                                                        // 0x000C (size: 0x4)
    int32 Max;                                                                        // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalRandomIncidentSettings : public FTableRowBase
{
    class UDataTable* MonsterSpawnData;                                               // 0x0008 (size: 0x8)
    class UDataTable* NPCSpawnData;                                                   // 0x0010 (size: 0x8)
    bool ExcludeOtherPal;                                                             // 0x0018 (size: 0x1)
    TSubclassOf<class UPalRandomIncidentActionBase> action;                           // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalRandomIncidentSpawnIncidentParameter
{
    FName IncidentId;                                                                 // 0x0000 (size: 0x8)
    FName SettingName;                                                                // 0x0008 (size: 0x8)
    int32 LotteryRate;                                                                // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalRandomIncidentSpawnLocationData : public FTableRowBase
{
    FVector2D Location;                                                               // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalRandomIncidentSpawnMonsterData : public FTableRowBase
{
    FPalDataTableRowName_PalMonsterData CharacterID;                                  // 0x0008 (size: 0x8)
    int32 Level;                                                                      // 0x0010 (size: 0x4)
    int32 Group;                                                                      // 0x0014 (size: 0x4)
    bool IsSquad;                                                                     // 0x0018 (size: 0x1)
    FVector2D SpawnLocation;                                                          // 0x0020 (size: 0x10)
    float SpawnRadius;                                                                // 0x0030 (size: 0x4)
    float RotZ_Degree;                                                                // 0x0034 (size: 0x4)
    TSubclassOf<class APalAIController> ControllerClass;                              // 0x0038 (size: 0x8)
    TSubclassOf<class UPalActionBase> DefaultActionClass;                             // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FPalRandomIncidentSpawnMonsterOutbreakData : public FTableRowBase
{
    FPalDataTableRowName_PalMonsterData CharacterID;                                  // 0x0008 (size: 0x8)
    int32 Num;                                                                        // 0x0010 (size: 0x4)
    int32 LevelMin;                                                                   // 0x0014 (size: 0x4)
    int32 LevelMax;                                                                   // 0x0018 (size: 0x4)
    int32 Group;                                                                      // 0x001C (size: 0x4)
    bool IsSquad;                                                                     // 0x0020 (size: 0x1)
    class UDataTable* LocationTable;                                                  // 0x0028 (size: 0x8)
    TSubclassOf<class APalAIController> ControllerClass;                              // 0x0030 (size: 0x8)
    TSubclassOf<class UPalActionBase> DefaultActionClass;                             // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FPalRandomIncidentSpawnNPCData : public FTableRowBase
{
    FPalDataTableRowName_PalHumanData CharacterID;                                    // 0x0008 (size: 0x8)
    FPalDataTableRowName_NPCUniqueData UniqueNPCID;                                   // 0x0010 (size: 0x8)
    FPalDataTableRowName_PalMonsterData OtomoName;                                    // 0x0018 (size: 0x8)
    int32 Level;                                                                      // 0x0020 (size: 0x4)
    int32 Group;                                                                      // 0x0024 (size: 0x4)
    bool IsSquad;                                                                     // 0x0028 (size: 0x1)
    FVector2D SpawnLocation;                                                          // 0x0030 (size: 0x10)
    float SpawnRadius;                                                                // 0x0040 (size: 0x4)
    float RotZ_Degree;                                                                // 0x0044 (size: 0x4)
    FName WalkPathName;                                                               // 0x0048 (size: 0x8)
    float WalkRadius;                                                                 // 0x0050 (size: 0x4)
    TSubclassOf<class APalAIController> ControllerClass;                              // 0x0058 (size: 0x8)
    TSubclassOf<class UPalAIActionBase> DefaultAIActionClass;                         // 0x0060 (size: 0x8)

}; // Size: 0x68

struct FPalRandomIncidentWalkPathReferenceData
{
    TArray<class AActor*> WalkPoints;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalRandomRestInfo
{
    class UAnimMontage* RandomRestMontage;                                            // 0x0000 (size: 0x8)
    float Weight;                                                                     // 0x0008 (size: 0x4)
    int32 LoopNum_Min;                                                                // 0x000C (size: 0x4)
    int32 LoopNum_Max;                                                                // 0x0010 (size: 0x4)
    float AfterIdleTime;                                                              // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPalRespawnPointData : public FTableRowBase
{
    FName SpawnPointID;                                                               // 0x0008 (size: 0x8)
    int32 ResourcesAbundant;                                                          // 0x0010 (size: 0x4)
    int32 PalAbundant;                                                                // 0x0014 (size: 0x4)
    bool ForPvP;                                                                      // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FPalShopProductRequireItemData
{
    FName StaticItemId;                                                               // 0x0000 (size: 0x8)
    int32 requireNum;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalSizeParameterDataRow : public FTableRowBase
{
    EPalSizeType Size;                                                                // 0x0008 (size: 0x1)
    float EffectScale;                                                                // 0x000C (size: 0x4)
    float JumpEffectOffsetZ;                                                          // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FPalSlateNavigationSetting
{
    bool IsEnableAnalogNavigation;                                                    // 0x0000 (size: 0x1)
    bool IsEnableLeftKeyNavigation;                                                   // 0x0001 (size: 0x1)
    bool IsEnableRightKeyNavigation;                                                  // 0x0002 (size: 0x1)
    bool IsEnableDownKeyNavigation;                                                   // 0x0003 (size: 0x1)
    bool IsEnableUpKeyNavigation;                                                     // 0x0004 (size: 0x1)

}; // Size: 0x5

struct FPalSlotItemAndNum
{
    FPalItemAndSlot itemSlot;                                                         // 0x0000 (size: 0x40)
    int32 Num;                                                                        // 0x0040 (size: 0x4)

}; // Size: 0x44

struct FPalSlotOpItemInfo
{
    FPalItemAndNum Item;                                                              // 0x0000 (size: 0x2C)
    float CorruptionProgressValue;                                                    // 0x002C (size: 0x4)

}; // Size: 0x30

struct FPalSlotOpItemSlotInfo
{
    FPalSlotOpItemInfo ItemInfo;                                                      // 0x0000 (size: 0x30)
    FPalItemSlotId SlotID;                                                            // 0x0030 (size: 0x14)

}; // Size: 0x44

struct FPalSoundIDDataTableRow : public FTableRowBase
{
    FName Description;                                                                // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalSoundOptions
{
    int32 FadeInTime;                                                                 // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FPalSoundPlayingParameter
{
    class UAkAudioEvent* AudioEvent;                                                  // 0x0000 (size: 0x8)
    FPalSoundOptions Options;                                                         // 0x0008 (size: 0x4)
    bool bStopAbsolutely;                                                             // 0x000C (size: 0x1)

}; // Size: 0x10

struct FPalSoundSource : public FTableRowBase
{
    int32 Radius_Meter;                                                               // 0x0008 (size: 0x4)
    bool bIsMuteable;                                                                 // 0x000C (size: 0x1)

}; // Size: 0x10

struct FPalSpawnerGroupInfo
{
    int32 Weight;                                                                     // 0x0000 (size: 0x4)
    EPalOneDayTimeType OnlyTime;                                                      // 0x0004 (size: 0x1)
    EPalWeatherConditionType OnlyWeather;                                             // 0x0005 (size: 0x1)
    TArray<FPalSpawnerOneTribeInfo> PalList;                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalSpawnerOneTribeInfo
{
    FPalDataTableRowName_PalMonsterData PalID;                                        // 0x0000 (size: 0x8)
    FPalDataTableRowName_PalHumanData NPCID;                                          // 0x0008 (size: 0x8)
    int32 Level;                                                                      // 0x0010 (size: 0x4)
    int32 Level_Max;                                                                  // 0x0014 (size: 0x4)
    int32 Num;                                                                        // 0x0018 (size: 0x4)
    int32 Num_Max;                                                                    // 0x001C (size: 0x4)

}; // Size: 0x20

struct FPalSpecialAttackRateInfo
{
    EPalSpecialAttackRateType Type;                                                   // 0x0000 (size: 0x1)
    float Rate;                                                                       // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalSphere
{
    FVector Center;                                                                   // 0x0000 (size: 0x18)
    float Radius;                                                                     // 0x0018 (size: 0x4)
    bool bXY;                                                                         // 0x001C (size: 0x1)

}; // Size: 0x20

struct FPalStageAreaInfo
{
    FBox BoundingBox;                                                                 // 0x0000 (size: 0x38)

}; // Size: 0x38

struct FPalStageInstanceId
{
    FGuid InternalId;                                                                 // 0x0000 (size: 0x10)
    bool bValid;                                                                      // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FPalStageModelRepInfo : public FFastArraySerializerItem
{
    FPalStageInstanceId InstanceId;                                                   // 0x000C (size: 0x14)
    class UPalStageModelBase* Model;                                                  // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalStagePlayerInfo
{
    FGuid PlayerUId;                                                                  // 0x0000 (size: 0x10)
    EPalStagePlayerState PlayerState;                                                 // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FPalStaticCharacterInfo_SpawnItem
{
    TMap<int32, FPalDataTableRowName_FieldLotteryNameData> FieldLotteryNameByRank;    // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalStaticItemAndSlot
{
    FPalStaticItemIdAndNum ItemInfo;                                                  // 0x0000 (size: 0xC)
    FPalItemSlotId SlotID;                                                            // 0x000C (size: 0x14)

}; // Size: 0x20

struct FPalStaticItemDataStruct : public FTableRowBase
{
    FName OverrideName;                                                               // 0x0008 (size: 0x8)
    FName OverrideDescription;                                                        // 0x0010 (size: 0x8)
    FName IconName;                                                                   // 0x0018 (size: 0x8)
    EPalItemTypeA TypeA;                                                              // 0x0020 (size: 0x1)
    EPalItemTypeB TypeB;                                                              // 0x0021 (size: 0x1)
    int32 Rank;                                                                       // 0x0024 (size: 0x4)
    int32 Rarity;                                                                     // 0x0028 (size: 0x4)
    int32 MaxStackCount;                                                              // 0x002C (size: 0x4)
    float Weight;                                                                     // 0x0030 (size: 0x4)
    int32 Price;                                                                      // 0x0034 (size: 0x4)
    int32 SortID;                                                                     // 0x0038 (size: 0x4)
    bool bInTreasureBox;                                                              // 0x003C (size: 0x1)
    bool bNotConsumed;                                                                // 0x003D (size: 0x1)
    bool bEnableHandcraft;                                                            // 0x003E (size: 0x1)
    int32 TechnologyTreeLock;                                                         // 0x0040 (size: 0x4)
    FName ItemStaticClass;                                                            // 0x0044 (size: 0x8)
    FName ItemDynamicClass;                                                           // 0x004C (size: 0x8)
    FName ItemActorClass;                                                             // 0x0054 (size: 0x8)
    FName ItemStaticMeshName;                                                         // 0x005C (size: 0x8)
    FName VisualBlueprintClassName;                                                   // 0x0064 (size: 0x8)
    TSoftClassPtr<AActor> VisualBlueprintClassSoft;                                   // 0x0070 (size: 0x30)
    EPalDropItemType DropItemType;                                                    // 0x00A0 (size: 0x1)
    int32 Editor_RowNameHash;                                                         // 0x00A4 (size: 0x4)
    int32 RestoreSatiety;                                                             // 0x00A8 (size: 0x4)
    int32 RestoreConcentration;                                                       // 0x00AC (size: 0x4)
    int32 RestoreSanity;                                                              // 0x00B0 (size: 0x4)
    int32 RestoreHealth;                                                              // 0x00B4 (size: 0x4)
    int32 GrantEffect1Id;                                                             // 0x00B8 (size: 0x4)
    float GrantEffect1Time;                                                           // 0x00BC (size: 0x4)
    int32 GrantEffect2Id;                                                             // 0x00C0 (size: 0x4)
    float GrantEffect2Time;                                                           // 0x00C4 (size: 0x4)
    int32 GrantEffect3Id;                                                             // 0x00C8 (size: 0x4)
    float GrantEffect3Time;                                                           // 0x00CC (size: 0x4)
    int32 Durability;                                                                 // 0x00D0 (size: 0x4)
    EPalElementType ElementType;                                                      // 0x00D4 (size: 0x1)
    bool bSleepWeapon;                                                                // 0x00D5 (size: 0x1)
    int32 MagazineSize;                                                               // 0x00D8 (size: 0x4)
    float SneakAttackRate;                                                            // 0x00DC (size: 0x4)
    int32 PhysicalAttackValue;                                                        // 0x00E0 (size: 0x4)
    int32 HPValue;                                                                    // 0x00E4 (size: 0x4)
    int32 PhysicalDefenseValue;                                                       // 0x00E8 (size: 0x4)
    int32 ShieldValue;                                                                // 0x00EC (size: 0x4)
    int32 MagicAttackValue;                                                           // 0x00F0 (size: 0x4)
    int32 MagicDefenseValue;                                                          // 0x00F4 (size: 0x4)
    FName PassiveSkillName;                                                           // 0x00F8 (size: 0x8)
    FName PassiveSkillName2;                                                          // 0x0100 (size: 0x8)
    FName PassiveSkillName3;                                                          // 0x0108 (size: 0x8)
    FName PassiveSkillName4;                                                          // 0x0110 (size: 0x8)
    EPalWazaID WazaID;                                                                // 0x0118 (size: 0x1)
    float CorruptionFactor;                                                           // 0x011C (size: 0x4)
    float FloatValue1;                                                                // 0x0120 (size: 0x4)

}; // Size: 0x128

struct FPalStaticItemIdAndDynamicItemDataSet
{
    FName StaticItemId;                                                               // 0x0000 (size: 0x8)
    class UPalDynamicItemDataBase* DynamicItemData;                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalStaticItemIdAndNum
{
    FName StaticItemId;                                                               // 0x0000 (size: 0x8)
    int32 Num;                                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalStatusAccumulate
{
}; // Size: 0x10

struct FPalStatusEffectFoodDataRow : public FTableRowBase
{
    int32 EffectTime;                                                                 // 0x0008 (size: 0x4)
    EPalFoodStatusEffectType EffectType1;                                             // 0x000C (size: 0x1)
    int32 EffectValue1;                                                               // 0x0010 (size: 0x4)
    int32 Interaval1;                                                                 // 0x0014 (size: 0x4)
    EPalFoodStatusEffectType EffectType2;                                             // 0x0018 (size: 0x1)
    int32 EffectValue2;                                                               // 0x001C (size: 0x4)
    int32 Interaval2;                                                                 // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FPalSyncTeleportRequestParameter
{
    FString SyncTeleportStartSE;                                                      // 0x0000 (size: 0x10)
    FVector Location;                                                                 // 0x0010 (size: 0x18)
    FQuat Rotation;                                                                   // 0x0030 (size: 0x20)
    bool bIsFadeOutSkip;                                                              // 0x0050 (size: 0x1)

}; // Size: 0x60

struct FPalTalentUpItemDataRow : public FTableRowBase
{
    EPalTalentType TalentType;                                                        // 0x0008 (size: 0x1)
    int32 addValue;                                                                   // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPalTalkTreeDataTableRow : public FTableRowBase
{
    FName NPCID;                                                                      // 0x0008 (size: 0x8)
    FName TalkName;                                                                   // 0x0010 (size: 0x8)
    FName TextId;                                                                     // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FPalTechnologyDataSet
{
    class UDataTable* recipeUnlockDataTable;                                          // 0x0000 (size: 0x8)
    class UDataTable* technologyNameTable;                                            // 0x0008 (size: 0x8)
    class UDataTable* technologyDescTable;                                            // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalTechnologyDataTableRowBase : public FTableRowBase
{
    FName Name;                                                                       // 0x0008 (size: 0x8)
    FName Description;                                                                // 0x0010 (size: 0x8)
    FName IconName;                                                                   // 0x0018 (size: 0x8)
    int32 RequireBossDefeatNum;                                                       // 0x0020 (size: 0x4)
    FName RequireTechnology;                                                          // 0x0024 (size: 0x8)
    bool IsBossTechnology;                                                            // 0x002C (size: 0x1)
    int32 LevelCap;                                                                   // 0x0030 (size: 0x4)
    int32 Tier;                                                                       // 0x0034 (size: 0x4)
    int32 Cost;                                                                       // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FPalTechnologyRecipeUnlockDataTableRow : public FPalTechnologyDataTableRowBase
{
    TArray<FName> UnlockBuildObjects;                                                 // 0x0040 (size: 0x10)
    TArray<FName> UnlockItemRecipes;                                                  // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FPalTemperatureInfo
{
    int32 CurrentResistRank_Heat;                                                     // 0x0000 (size: 0x4)
    int32 CurrentResistRank_Cold;                                                     // 0x0004 (size: 0x4)
    int32 CurrentTemperature;                                                         // 0x0008 (size: 0x4)
    EPalBodyTemperatureState CurrentBodyState;                                        // 0x000C (size: 0x1)

}; // Size: 0x10

struct FPalTimerGaugeWidgetCreateInfo
{
    class AActor* TargetActor;                                                        // 0x0008 (size: 0x8)
    FVector TargetLocation;                                                           // 0x0010 (size: 0x18)
    TSubclassOf<class UPalUserWidgetTimerGaugeBase> timerGaugeWidgetClass;            // 0x0028 (size: 0x8)
    FVector DisplayOffset;                                                            // 0x0030 (size: 0x18)
    float DisplayRange;                                                               // 0x0048 (size: 0x4)
    FString FunctionName;                                                             // 0x0050 (size: 0x10)
    float Time;                                                                       // 0x0060 (size: 0x4)
    bool bLooping;                                                                    // 0x0064 (size: 0x1)
    float InitialStartDelay;                                                          // 0x0068 (size: 0x4)
    float InitialStartDelayVariance;                                                  // 0x006C (size: 0x4)
    bool IsHide;                                                                      // 0x0070 (size: 0x1)

}; // Size: 0x78

struct FPalTimerHandle
{
}; // Size: 0x10

struct FPalTutorialTriggerSaveData
{
    FName TutorialMsg;                                                                // 0x0000 (size: 0x8)
    bool Checked;                                                                     // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FPalUIActionBindData
{
}; // Size: 0x4

struct FPalUIAimReticleMapObjectAssignableData
{
    bool isAssignable;                                                                // 0x0000 (size: 0x1)
    FName targetMapObjectID;                                                          // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FPalUIAimReticleMapObjectThrowableData
{
    bool isThrowable;                                                                 // 0x0000 (size: 0x1)
    FName targetMapObjectID;                                                          // 0x0004 (size: 0x8)
    EPalMapObjectConcreteModelThrowableType throwableType;                            // 0x000C (size: 0x1)

}; // Size: 0x10

struct FPalUIBackupSaveDisplayData
{
    FString BackupName;                                                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalUICaptureCameraOffsetData : public FTableRowBase
{
    FVector LocationOffset;                                                           // 0x0008 (size: 0x18)
    FRotator Rotator;                                                                 // 0x0020 (size: 0x18)
    FVector PointLightOffset_1;                                                       // 0x0038 (size: 0x18)
    float PointLightIntensity_1;                                                      // 0x0050 (size: 0x4)
    float PointLightSize_1;                                                           // 0x0054 (size: 0x4)
    FVector PointLightOffset_2;                                                       // 0x0058 (size: 0x18)
    float PointLightIntensity_2;                                                      // 0x0070 (size: 0x4)
    float PointLightSize_2;                                                           // 0x0074 (size: 0x4)
    FVector RectLightOffset;                                                          // 0x0078 (size: 0x18)
    FRotator RectLightRotator;                                                        // 0x0090 (size: 0x18)
    float RectLightIntensity;                                                         // 0x00A8 (size: 0x4)
    float RectLightSize;                                                              // 0x00AC (size: 0x4)

}; // Size: 0xB0

struct FPalUICommonItemInfoDisplayData
{
    class UPalItemSlot* TargetItemSlot;                                               // 0x0000 (size: 0x8)
    FName RecipeID;                                                                   // 0x0008 (size: 0x8)
    class UWidget* RelativeWidget;                                                    // 0x0010 (size: 0x8)
    FVector2D AnchorPosition;                                                         // 0x0018 (size: 0x10)
    bool IsUsableSlot;                                                                // 0x0028 (size: 0x1)
    bool IsEnableQuickEquip;                                                          // 0x0029 (size: 0x1)
    bool IsEnableQuickMove;                                                           // 0x002A (size: 0x1)
    bool IsEnableSpreadLift;                                                          // 0x002B (size: 0x1)
    bool IsShowPrice;                                                                 // 0x002C (size: 0x1)

}; // Size: 0x30

struct FPalUICommonRewardDisplayData
{
    FText Message;                                                                    // 0x0000 (size: 0x18)
    class UTexture2D* Texture;                                                        // 0x0018 (size: 0x8)
    TSoftObjectPtr<UTexture2D> SoftTexture;                                           // 0x0020 (size: 0x30)
    EPalUIRewardDisplayType DisplayType;                                              // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FPalUIGuildMemberDisplayInfo
{
    FString CharacterName;                                                            // 0x0000 (size: 0x10)
    bool IsAdmin;                                                                     // 0x0010 (size: 0x1)
    EPalGuildPlayerStatus PlayerStatus;                                               // 0x0011 (size: 0x1)

}; // Size: 0x18

struct FPalUILocalWorldDisplayData
{
    FString WorldName;                                                                // 0x0000 (size: 0x10)
    FString WorldDirectoryName;                                                       // 0x0010 (size: 0x10)
    FString PlayerName;                                                               // 0x0020 (size: 0x10)
    int32 PlayerLevel;                                                                // 0x0030 (size: 0x4)
    int32 Day;                                                                        // 0x0034 (size: 0x4)
    FDateTime Timestamp;                                                              // 0x0038 (size: 0x8)
    FString DirectoryPath;                                                            // 0x0040 (size: 0x10)
    bool CanMultiplay;                                                                // 0x0050 (size: 0x1)
    EPalWorldBaseInfoSaveDataType BaseInfoSaveDataType;                               // 0x0051 (size: 0x1)

}; // Size: 0x58

struct FPalUIPalCaptureInfo
{
    FName CharacterID;                                                                // 0x0000 (size: 0x8)
    int32 CaptureCount;                                                               // 0x0008 (size: 0x4)
    int32 Level;                                                                      // 0x000C (size: 0x4)
    TArray<FName> PassiveSkillNameList;                                               // 0x0010 (size: 0x10)
    bool IsRarePal;                                                                   // 0x0020 (size: 0x1)
    bool IsUnlockedPaldeck;                                                           // 0x0021 (size: 0x1)

}; // Size: 0x28

struct FPalUIPaldexDistributionData : public FTableRowBase
{
    FPalUIPaldexDistributionLocationStruct dayTimeLocations;                          // 0x0008 (size: 0x18)
    FPalUIPaldexDistributionLocationStruct nightTimeLocations;                        // 0x0020 (size: 0x18)

}; // Size: 0x38

struct FPalUIPaldexDistributionLocationStruct
{
    TArray<FVector> locations;                                                        // 0x0000 (size: 0x10)
    float Radius;                                                                     // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FPalUIPaldex_DisplayInfo
{
    int32 Index;                                                                      // 0x0000 (size: 0x4)
    FString IndexSuffix;                                                              // 0x0008 (size: 0x10)
    FString CombinedIndexString;                                                      // 0x0018 (size: 0x10)
    EPalUIPaldexPanelDetailType detailType;                                           // 0x0028 (size: 0x1)
    FName baseCharacterName;                                                          // 0x002C (size: 0x8)

}; // Size: 0x38

struct FPalUIServerDataCollectInfo
{
    EPalUIServerListSortType SortType;                                                // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FPalUIServerDisplayData
{
    FString ServerName;                                                               // 0x0120 (size: 0x10)
    FString Description;                                                              // 0x0130 (size: 0x10)
    bool IsPvP;                                                                       // 0x0140 (size: 0x1)
    int32 Day;                                                                        // 0x0144 (size: 0x4)
    int32 NowPlayerNum;                                                               // 0x0148 (size: 0x4)
    int32 MaxPlayerNum;                                                               // 0x014C (size: 0x4)
    int32 Ping;                                                                       // 0x0150 (size: 0x4)
    EPalUIServerListFilterType ServerListType;                                        // 0x0154 (size: 0x1)
    FString ServerAddress;                                                            // 0x0158 (size: 0x10)
    int32 ServerPort;                                                                 // 0x0168 (size: 0x4)
    FString VersionString;                                                            // 0x0170 (size: 0x10)
    bool IsLocked;                                                                    // 0x0180 (size: 0x1)
    FString Region;                                                                   // 0x0188 (size: 0x10)
    int32 CreateTime;                                                                 // 0x0198 (size: 0x4)

}; // Size: 0x1A0

struct FPalUMGCustomVertexData
{
    FVector4 texCoords;                                                               // 0x0000 (size: 0x20)
    FVector2D materialTexCoords;                                                      // 0x0020 (size: 0x10)
    FVector2D Position;                                                               // 0x0030 (size: 0x10)
    FColor Color;                                                                     // 0x0040 (size: 0x4)
    int32 pixelWidth;                                                                 // 0x0044 (size: 0x4)
    int32 pixelHeight;                                                                // 0x0048 (size: 0x4)

}; // Size: 0x50

struct FPalUniqueNPCDatabaseRow : public FTableRowBase
{
    FName CharacterID;                                                                // 0x0008 (size: 0x8)
    FName NameTextID;                                                                 // 0x0010 (size: 0x8)
    FName OneTalkDTName;                                                              // 0x0018 (size: 0x8)
    FName TalkBPClass;                                                                // 0x0020 (size: 0x8)
    bool IsTransientTalkCount;                                                        // 0x0028 (size: 0x1)
    EPalGenderType Gender;                                                            // 0x0029 (size: 0x1)
    EPalNPCSkinColor SkinColor;                                                       // 0x002A (size: 0x1)
    EPalNPCFaceType Face;                                                             // 0x002B (size: 0x1)
    EPalNPCHairStyleType HairStyle;                                                   // 0x002C (size: 0x1)
    EPalNPCHairColorType HairColor;                                                   // 0x002D (size: 0x1)
    EPalNPCClothesType Clothes;                                                       // 0x002E (size: 0x1)
    EPalNPCScaleType Scale;                                                           // 0x002F (size: 0x1)
    int32 Level;                                                                      // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FPalVisitorNPCDatabaseRow : public FPalInvaderDatabaseRow
{
    EPalIVisitorNPCAction ActionTimeLimit;                                            // 0x0070 (size: 0x1)
    bool IsSquad;                                                                     // 0x0071 (size: 0x1)

}; // Size: 0x78

struct FPalVisualEffectDynamicParameter
{
    TArray<FPalVisualEffectDynamicParameterFloat> FloatValues;                        // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalVisualEffectDynamicParameterFloat
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    float Value;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalWaitLoadingWorldPartitionParameter
{
    FWorldPartitionStreamingQuerySource QuerySource;                                  // 0x0000 (size: 0x88)
    EWorldPartitionRuntimeCellState CellState;                                        // 0x0088 (size: 0x1)
    float IntervalTime;                                                               // 0x008C (size: 0x4)
    float InFirstDelayTime;                                                           // 0x0090 (size: 0x4)

}; // Size: 0x98

struct FPalWazaDatabaseRaw : public FTableRowBase
{
    EPalWazaID WazaType;                                                              // 0x0008 (size: 0x1)
    EPalElementType Element;                                                          // 0x0009 (size: 0x1)
    bool IgnoreRandomInherit;                                                         // 0x000A (size: 0x1)
    EPalWazaCategory Category;                                                        // 0x000B (size: 0x1)
    int32 Power;                                                                      // 0x000C (size: 0x4)
    bool IsLeanBack;                                                                  // 0x0010 (size: 0x1)
    EPalPlayerDamageCameraShakeCategory CameraShake;                                  // 0x0011 (size: 0x1)
    bool IgnoreRaycast;                                                               // 0x0012 (size: 0x1)
    int32 MinRange;                                                                   // 0x0014 (size: 0x4)
    int32 MaxRange;                                                                   // 0x0018 (size: 0x4)
    float CoolTime;                                                                   // 0x001C (size: 0x4)
    EPalSizeType ForceRagdollSize;                                                    // 0x0020 (size: 0x1)
    EPalAdditionalEffectType EffectType1;                                             // 0x0021 (size: 0x1)
    int32 EffectValue1;                                                               // 0x0024 (size: 0x4)
    float EffectValueEx1;                                                             // 0x0028 (size: 0x4)
    EPalAdditionalEffectType EffectType2;                                             // 0x002C (size: 0x1)
    int32 EffectValue2;                                                               // 0x0030 (size: 0x4)
    float EffectValueEx2;                                                             // 0x0034 (size: 0x4)
    TArray<FPalSpecialAttackRateInfo> SpecialAttackRateInfos;                         // 0x0038 (size: 0x10)
    bool bIsWeaponDamage;                                                             // 0x0048 (size: 0x1)
    bool DisabledData;                                                                // 0x0049 (size: 0x1)

}; // Size: 0x50

struct FPalWazaMasterLevelDataRow : public FTableRowBase
{
    FName PalID;                                                                      // 0x0008 (size: 0x8)
    EPalWazaID WazaID;                                                                // 0x0010 (size: 0x1)
    int32 Level;                                                                      // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPalWazaMasterTamagoDataRow : public FTableRowBase
{
    FName PalID;                                                                      // 0x0008 (size: 0x8)
    EPalWazaID WazaID;                                                                // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FPalWeaponSubParameterData : public FTableRowBase
{
    float dps;                                                                        // 0x0008 (size: 0x4)
    float Range;                                                                      // 0x000C (size: 0x4)
    float stability;                                                                  // 0x0010 (size: 0x4)
    float accuracy;                                                                   // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPalWildSpawnerDatabaseRow : public FTableRowBase
{
    FName SpawnerName;                                                                // 0x0008 (size: 0x8)
    EPalSpawnedCharacterType SpawnerType;                                             // 0x0010 (size: 0x1)
    float Weight;                                                                     // 0x0014 (size: 0x4)
    EPalOneDayTimeType OnlyTime;                                                      // 0x0018 (size: 0x1)
    EPalWeatherConditionType OnlyWeather;                                             // 0x0019 (size: 0x1)
    FName Pal_1;                                                                      // 0x001C (size: 0x8)
    FName NPC_1;                                                                      // 0x0024 (size: 0x8)
    int32 LvMin_1;                                                                    // 0x002C (size: 0x4)
    int32 LvMax_1;                                                                    // 0x0030 (size: 0x4)
    int32 NumMin_1;                                                                   // 0x0034 (size: 0x4)
    int32 NumMax_1;                                                                   // 0x0038 (size: 0x4)
    FName Pal_2;                                                                      // 0x003C (size: 0x8)
    FName NPC_2;                                                                      // 0x0044 (size: 0x8)
    int32 LvMin_2;                                                                    // 0x004C (size: 0x4)
    int32 LvMax_2;                                                                    // 0x0050 (size: 0x4)
    int32 NumMin_2;                                                                   // 0x0054 (size: 0x4)
    int32 NumMax_2;                                                                   // 0x0058 (size: 0x4)
    FName Pal_3;                                                                      // 0x005C (size: 0x8)
    FName NPC_3;                                                                      // 0x0064 (size: 0x8)
    int32 LvMin_3;                                                                    // 0x006C (size: 0x4)
    int32 LvMax_3;                                                                    // 0x0070 (size: 0x4)
    int32 NumMin_3;                                                                   // 0x0074 (size: 0x4)
    int32 NumMax_3;                                                                   // 0x0078 (size: 0x4)

}; // Size: 0x80

struct FPalWindInfo
{
    FVector Direction;                                                                // 0x0000 (size: 0x18)
    float Speed;                                                                      // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalWorkAssignDefineData
{
    TArray<EPalGenusCategoryType> GenusCategories;                                    // 0x0000 (size: 0x10)
    TArray<EPalElementType> ElementTypes;                                             // 0x0010 (size: 0x10)
    EPalWorkSuitability WorkSuitability;                                              // 0x0020 (size: 0x1)
    int32 WorkSuitabilityRank;                                                        // 0x0024 (size: 0x4)
    bool bPlayerWorkable;                                                             // 0x0028 (size: 0x1)
    EPalWorkType WorkType;                                                            // 0x0029 (size: 0x1)
    EPalActionType ActionType;                                                        // 0x002A (size: 0x1)
    int32 WorkerMaxNum;                                                               // 0x002C (size: 0x4)
    float AffectSanityValue;                                                          // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FPalWorkAssignDefineDataStaticSetting
{
    FName RowName;                                                                    // 0x0000 (size: 0x8)
    FPalWorkAssignDefineData AssignDefineData;                                        // 0x0008 (size: 0x38)

}; // Size: 0x40

struct FPalWorkAssignHandleId
{
    FGuid WorkId;                                                                     // 0x0000 (size: 0x10)
    int32 LocationIndex;                                                              // 0x0010 (size: 0x4)
    EPalWorkAssignType AssignType;                                                    // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FPalWorkAssignInfo
{
    int32 LocationIndex;                                                              // 0x0000 (size: 0x4)
    class UPalWorkAssign* WorkAssign;                                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalWorkAssignLocalLocation
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    FVector FacingDirection;                                                          // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FPalWorkAssignParameter
{
}; // Size: 0x28

struct FPalWorkAssignRepInfo : public FFastArraySerializerItem
{
    int32 LocationIndex;                                                              // 0x000C (size: 0x4)
    class UPalWorkAssign* WorkAssign;                                                 // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalWorkAssignRequirementParameter
{
}; // Size: 0x18

struct FPalWorkAssignSaveData : public FPalBinaryMemory
{
}; // Size: 0x10

struct FPalWorkProgressManagerWorkProcessTickFunction : public FTickFunction
{
    class UPalWorkProgressManager* Target;                                            // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FPalWorkSaveData : public FPalBinaryMemory
{
    EPalWorkableType WorkableType;                                                    // 0x0010 (size: 0x1)
    TMap<int32, FPalWorkAssignSaveData> WorkAssignMap;                                // 0x0018 (size: 0x50)

}; // Size: 0x68

struct FPalWorkStaticParameter
{
    FGuid OwnerMapObjectModelId;                                                      // 0x0000 (size: 0x10)
    FGuid OwnerMapObjectConcreteModelId;                                              // 0x0010 (size: 0x10)
    FPalBoundsTransform WorkableBounds;                                               // 0x0020 (size: 0x80)
    TArray<FPalWorkAssignLocalLocation> AssignLocalLocations;                         // 0x00A0 (size: 0x10)

}; // Size: 0xC0

struct FPalWorkSuitabilityCollectionDefineData
{
    FPalWorkSuitabilityDefineData CommonDefineData;                                   // 0x0000 (size: 0x18)
    TArray<FPalCollectionRankDefineData> CollectionDefineData;                        // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FPalWorkSuitabilityDefineData
{
    bool bIsChangeWorkAnimPlayRate;                                                   // 0x0000 (size: 0x1)
    TArray<int32> CraftSpeeds;                                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalWorkSuitabilityDeforestDefineData
{
    FPalWorkSuitabilityDefineData CommonDefineData;                                   // 0x0000 (size: 0x18)
    TArray<FPalDeforestRankDefineData> DeforestDefineData;                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FPalWorkSuitabilityInfo
{
    EPalWorkSuitability WorkSuitability;                                              // 0x0000 (size: 0x1)
    int32 Rank;                                                                       // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalWorkSuitabilityMiningDefineData
{
    FPalWorkSuitabilityDefineData CommonDefineData;                                   // 0x0000 (size: 0x18)
    TArray<FPalMiningRankDefineData> MiningDefineData;                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FPalWorkSuitabilityPreferenceInfo
{
    TArray<EPalWorkSuitability> OffWorkSuitabilityList;                               // 0x0000 (size: 0x10)
    bool bAllowBaseCampBattle;                                                        // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FPalWorkTypeSet
{
    TArray<EPalWorkType> WorkTypes;                                                   // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalWorkWaitParameter
{
}; // Size: 0x18

struct FPalWorldBaseInfoData
{
    FPalWorldBaseInfoSaveData BaseInfoSaveData;                                       // 0x0000 (size: 0x28)
    FDateTime Timestamp;                                                              // 0x0028 (size: 0x8)
    FString DirectoryPath;                                                            // 0x0030 (size: 0x10)
    bool CanMulti;                                                                    // 0x0040 (size: 0x1)
    EPalWorldBaseInfoSaveDataType BaseInfoSaveDataType;                               // 0x0041 (size: 0x1)

}; // Size: 0x48

struct FPalWorldBaseInfoSaveData
{
    FString WorldName;                                                                // 0x0000 (size: 0x10)
    FString HostPlayerName;                                                           // 0x0010 (size: 0x10)
    int32 HostPlayerLevel;                                                            // 0x0020 (size: 0x4)
    int32 InGameDay;                                                                  // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FPalWorldHUDParameter
{
    TWeakObjectPtr<class AActor> TargetActor;                                         // 0x0000 (size: 0x8)
    FVector TargetLocation;                                                           // 0x0008 (size: 0x18)
    TSubclassOf<class UPalUserWidgetWorldHUD> WorldHUDClass;                          // 0x0020 (size: 0x8)
    EPalWorldHUDWidgetBlueprintType WorldHUDType;                                     // 0x0028 (size: 0x1)
    class UPalHUDDispatchParameterBase* HUDParameter;                                 // 0x0030 (size: 0x8)
    FVector DisplayOffset;                                                            // 0x0038 (size: 0x18)
    FVector2D DisplayOffsetScreenPos;                                                 // 0x0050 (size: 0x10)
    float DisplayRange;                                                               // 0x0060 (size: 0x4)
    bool bEnableShow;                                                                 // 0x0064 (size: 0x1)

}; // Size: 0x68

struct FPalWorldMapUIDataSave
{
    TMap<class FName, class bool> unlockedRegionMap;                                  // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalWorldMapUIDataTableRow : public FTableRowBase
{
    FVector2D minMapTextureBlockSize;                                                 // 0x0008 (size: 0x10)
    FVector2D mapBlockNum;                                                            // 0x0018 (size: 0x10)
    FVector landScapeRealPositionMin;                                                 // 0x0028 (size: 0x18)
    FVector landScapeRealPositionMax;                                                 // 0x0040 (size: 0x18)
    TMap<class FName, class FPalWorldMapUIRegionData> textureDataMap;                 // 0x0058 (size: 0x50)
    TSoftObjectPtr<UTexture2D> DefaultMaskTexture;                                    // 0x00A8 (size: 0x30)

}; // Size: 0xD8

struct FPalWorldMapUIRegionData
{
    TSoftObjectPtr<UTexture2D> Texture;                                               // 0x0000 (size: 0x30)
    FVector2D blockSize;                                                              // 0x0030 (size: 0x10)
    FVector2D gridPosition;                                                           // 0x0040 (size: 0x10)
    FName regionNameMsgId;                                                            // 0x0050 (size: 0x8)

}; // Size: 0x58

struct FPalWorldObjectRecordData_MapObjectSpawner
{
    TMap<int32, FPalWorldObjectRecordData_MapObjectSpawnerItem> ItemMap;              // 0x0000 (size: 0x50)

}; // Size: 0x58

struct FPalWorldObjectRecordData_MapObjectSpawnerInStage
{
    TMap<class FGuid, class FPalWorldObjectRecordData_MapObjectSpawner> RecordDataMapByLevelObjectInstanceId; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalWorldObjectRecordData_MapObjectSpawnerItem
{
    FGameDateTime NextSpawnLotteryGameTime;                                           // 0x0000 (size: 0x8)
    FGuid MapObjectInstanceId;                                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalWorldPlayerSaveData
{
    FGuid PlayerUId;                                                                  // 0x0000 (size: 0x10)
    FPalInstanceID IndividualId;                                                      // 0x0010 (size: 0x30)
    FGuid RespawnPointMapObjectInstanceId;                                            // 0x0040 (size: 0x10)
    FTransform LastTransform;                                                         // 0x0050 (size: 0x60)
    FString PlayerName;                                                               // 0x00B0 (size: 0x10)
    FPalPlayerDataCharacterMakeInfo PlayerCharacterMakeData;                          // 0x00C0 (size: 0x94)
    FPalContainerId OtomoCharacterContainerId;                                        // 0x0154 (size: 0x10)
    EPalOtomoPalOrderType OtomoOrder;                                                 // 0x0164 (size: 0x1)
    FPalPlayerDataInventoryInfo inventoryInfo;                                        // 0x0168 (size: 0x60)
    int32 TechnologyPoint;                                                            // 0x01C8 (size: 0x4)
    int32 bossTechnologyPoint;                                                        // 0x01CC (size: 0x4)
    TArray<FName> UnlockedRecipeTechnologyNames;                                      // 0x01D0 (size: 0x10)
    FPalContainerId PalStorageContainerId;                                            // 0x01E0 (size: 0x10)
    FPalLoggedinPlayerSaveDataRecordData RecordData;                                  // 0x01F0 (size: 0x2B0)
    bool bIsSelectedInitMapPoint;                                                     // 0x04A0 (size: 0x1)

}; // Size: 0x4B0

struct FPalWorldSaveData
{
    FString WorldName;                                                                // 0x0000 (size: 0x10)
    TMap<class FPalInstanceID, class FPalIndividualCharacterSaveParameterSaveData> CharacterSaveParameterMap; // 0x0010 (size: 0x50)
    TArray<FPalMapObjectSaveData> MapObjectSaveData;                                  // 0x0060 (size: 0x10)
    TMap<class FPalCellCoord, class FPalFoliageGridSaveData> FoliageGridSaveDataMap;  // 0x0070 (size: 0x50)
    TMap<class FGuid, class FPalMapObjectSpawnerSaveData> MapObjectSpawnerSaveData;   // 0x00C0 (size: 0x50)
    TMap<class FPalStageInstanceId, class FPalMapObjectSpawnerInStageSaveData> MapObjectSpawnerInStageSaveData; // 0x0110 (size: 0x50)
    TArray<FPalWorkSaveData> WorkSaveData;                                            // 0x0160 (size: 0x10)
    TMap<class FGuid, class FPalBaseCampSaveData> BaseCampSaveData;                   // 0x0170 (size: 0x50)
    TMap<class FPalContainerId, class FPalItemContainerSaveData> ItemContainerSaveData; // 0x01C0 (size: 0x50)
    TArray<FPalDynamicItemSaveData> DynamicItemSaveData;                              // 0x0210 (size: 0x10)
    TMap<class FPalContainerId, class FPalCharacterContainerSaveData> CharacterContainerSaveData; // 0x0220 (size: 0x50)
    TMap<class FGuid, class FPalGroupSaveData> GroupSaveDataMap;                      // 0x0270 (size: 0x50)
    FPalCharacterParameterStorageSaveData CharacterParameterStorageSaveData;          // 0x02C0 (size: 0x10)
    FPalGameTimeSaveData GameTimeSaveData;                                            // 0x02D0 (size: 0x10)
    FPalBossSpawnerSaveData BossSpawnerSaveData;                                      // 0x02E0 (size: 0x50)
    FPalEnemyCampSaveData EnemyCampSaveData;                                          // 0x0330 (size: 0x50)
    TArray<FPalDungeonPointMarkerSaveData> DungeonPointMarkerSaveData;                // 0x0380 (size: 0x10)
    TArray<FPalDungeonSaveData> DungeonSaveData;                                      // 0x0390 (size: 0x10)
    TMap<class FGuid, class FPalInvaderSaveData> InvaderSaveData;                     // 0x03A0 (size: 0x50)

}; // Size: 0x3F0

struct FPalWorldSecurityWantedPoliceSettingData
{
    FPalDataTableRowName_PalHumanData PoliceType;                                     // 0x0000 (size: 0x8)
    int32 PoliceNum;                                                                  // 0x0008 (size: 0x4)
    int32 PoliceLevel;                                                                // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPalWorldSecurityWantedStateInfo
{
    FDateTime ExpiredDate;                                                            // 0x0000 (size: 0x8)
    TArray<FGuid> CrimeInstanceIdArray;                                               // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPlayerGenderParams
{
    TMap<class EPalWeaponType, class TSoftClassPtr<UPalShooterAnimeAssetBase>> DefaultWeaponAnimeAssetBPSoftClassMap; // 0x0000 (size: 0x50)
    TMap<class TSoftClassPtr<APalWeaponBase>, class TSoftClassPtr<UPalShooterAnimeAssetBase>> OtherWeaponAnimeAssetBPSoftClassMap; // 0x0050 (size: 0x50)
    float ClavicleAdjustDegree;                                                       // 0x00A0 (size: 0x4)

}; // Size: 0xA8

struct FPlayerListItem
{
    FString PlayerName;                                                               // 0x0000 (size: 0x10)
    FString PlayerUId;                                                                // 0x0010 (size: 0x10)
    FString UserId;                                                                   // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FReactivePropertyFloat
{
}; // Size: 0x18

struct FReserveMontage
{
    class UAnimMontage* Montage;                                                      // 0x0000 (size: 0x8)
    float PlayRate;                                                                   // 0x0008 (size: 0x4)
    float StartTime;                                                                  // 0x000C (size: 0x4)

}; // Size: 0x10

struct FRiderActionInfo
{
    TSubclassOf<class UPalActionBase> RideAction;                                     // 0x0000 (size: 0x8)
    TSubclassOf<class UPalActionBase> GetOffAction;                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FRidingAimingAnimationInfo
{
    class UAnimSequence* ShootingAnimation;                                           // 0x0000 (size: 0x8)
    class UAimOffsetBlendSpace* ShootingAO;                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FRidingAnimationInfo
{
    class UAnimSequence* RidingAnimation;                                             // 0x0000 (size: 0x8)
    class UAnimMontage* RidingShakingMontage;                                         // 0x0008 (size: 0x8)
    class UAnimSequence* RideShootingAnimation;                                       // 0x0010 (size: 0x8)
    class UAimOffsetBlendSpace* RideShootingAO;                                       // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FSequentialProcessSequenceSet
{
    TArray<class USequentialProcessSequenceBase*> Sequences;                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FShooterSpringCameraAdditionalOffset
{
    FName flagName;                                                                   // 0x0000 (size: 0x8)
    int32 Priority;                                                                   // 0x0008 (size: 0x4)
    FShooterSpringCameraParameter CameraOffset;                                       // 0x0010 (size: 0x20)

}; // Size: 0x30

struct FShooterSpringCameraParameter
{
    float ArmLength;                                                                  // 0x0000 (size: 0x4)
    FVector CameraOffset;                                                             // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FSkillEffectSpawnParameter
{
    float TimeOffset;                                                                 // 0x0000 (size: 0x4)
    TSubclassOf<class APalSkillEffectBase> SkillEffectClass;                          // 0x0008 (size: 0x8)
    FVector SpawnOffset;                                                              // 0x0010 (size: 0x18)
    bool bAttachToOwner;                                                              // 0x0028 (size: 0x1)
    FName AttachSocketName;                                                           // 0x002C (size: 0x8)
    EPalBodyLocationType AttachLocationType;                                          // 0x0034 (size: 0x1)

}; // Size: 0x38

struct FSpawnedEnemyInfo
{
    class AActor* SelfActor;                                                          // 0x0000 (size: 0x8)
    EPalEnemySpawnActorType WeaponType;                                               // 0x0008 (size: 0x1)
    class AActor* TargetActor;                                                        // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FStatusDynamicParameter
{
    int32 GeneralIndex;                                                               // 0x0000 (size: 0x4)
    FName GeneralName;                                                                // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FTargetAbleInfoForEnemy
{
    class AActor* SelfActor;                                                          // 0x0000 (size: 0x8)
    int32 DuplicateNum;                                                               // 0x0008 (size: 0x4)
    float ThreatLevel_OnlyCharacterParam;                                             // 0x000C (size: 0x4)

}; // Size: 0x10

struct FTutorialDataStruct : public FTableRowBase
{
    FName MsgId;                                                                      // 0x0008 (size: 0x8)
    EPalTutorialTriggerType Type;                                                     // 0x0010 (size: 0x1)
    bool MultiTrigger;                                                                // 0x0011 (size: 0x1)
    EPalTutorialTriggerConditionType ConditionType;                                   // 0x0012 (size: 0x1)
    TArray<FName> ConditionObjectIds;                                                 // 0x0018 (size: 0x10)
    FName ConditionCategoryName;                                                      // 0x0028 (size: 0x8)
    float ConditionValue;                                                             // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FUITransientData
{
    int32 RadialMenuLastTab;                                                          // 0x0000 (size: 0x4)
    bool IsCampTaskUIOpen;                                                            // 0x0004 (size: 0x1)
    FName LastOpenedPaldexCharacter;                                                  // 0x0008 (size: 0x8)
    bool NewsOpened;                                                                  // 0x0010 (size: 0x1)
    bool IsOpenedSurvivalGuide;                                                       // 0x0011 (size: 0x1)
    bool ServerLobbyDialogOpened;                                                     // 0x0012 (size: 0x1)
    TArray<FGuid> IgnoreMaskLocationIDArray;                                          // 0x0018 (size: 0x10)
    TArray<FName> IgnoreMaskLBossSpawnerNameArray;                                    // 0x0028 (size: 0x10)
    TMap<FName, int32> TransientNPCTalkCountMap;                                      // 0x0038 (size: 0x50)

}; // Size: 0x88

struct FWeaponAnimationInfo
{
    class UBlendSpace1D* NormalMoveBlendSpace;                                        // 0x0000 (size: 0x8)
    class UBlendSpace1D* CrouchMoveBlendSpace;                                        // 0x0008 (size: 0x8)
    class UBlendSpace* AimingMoveBlendSpace;                                          // 0x0010 (size: 0x8)
    class UBlendSpace* HipShootingMoveBlendSpace;                                     // 0x0018 (size: 0x8)
    class UBlendSpace* CrouchAimingMoveBlendSpace;                                    // 0x0020 (size: 0x8)
    class UAnimMontage* JumpPreliminary;                                              // 0x0028 (size: 0x8)
    class UAnimSequence* JumpStart;                                                   // 0x0030 (size: 0x8)
    class UAnimSequence* JumpLoopUp;                                                  // 0x0038 (size: 0x8)
    class UAnimSequence* JumpLoopDown;                                                // 0x0040 (size: 0x8)
    class UAnimSequence* JumpEnd;                                                     // 0x0048 (size: 0x8)
    class UAnimSequence* Sliding;                                                     // 0x0050 (size: 0x8)
    class UAnimSequence* SlidingEnd;                                                  // 0x0058 (size: 0x8)
    class UAnimSequence* Sprint;                                                      // 0x0060 (size: 0x8)
    class UAnimMontage* ReloadMontage;                                                // 0x0068 (size: 0x8)
    class UAnimMontage* WeaponChangeMontage;                                          // 0x0070 (size: 0x8)
    TMap<class EWeaponAnimationPoseType, class UAnimSequence*> IdlePoseMap;           // 0x0078 (size: 0x50)
    TMap<class EWeaponAnimationPoseType, class UAnimSequence*> JogPoseMap;            // 0x00C8 (size: 0x50)
    TMap<class EWeaponAnimationPoseType, class UAnimSequence*> AimBaseMap;            // 0x0118 (size: 0x50)
    TMap<class EWeaponAnimationPoseType, class UAimOffsetBlendSpace*> AimOffsetMap;   // 0x0168 (size: 0x50)
    TMap<class EWeaponAnimationType, class FWeaponNotifyAnimationInfo> AnimationMap;  // 0x01B8 (size: 0x50)
    TMap<class EPalRidePositionType, class FRidingAnimationInfo> RidingAnimationMap;  // 0x0208 (size: 0x50)

}; // Size: 0x258

struct FWeaponNotifyAnimationInfo
{
    TMap<class EWeaponAnimationPoseType, class UAnimMontage*> PoseMap;                // 0x0000 (size: 0x50)
    bool isAutoStop;                                                                  // 0x0050 (size: 0x1)

}; // Size: 0x58

class APalAIController : public AAIController
{
    TArray<class AActor*> TargetPlayers;                                              // 0x03B8 (size: 0x10)
    TArray<class AActor*> TargetNPCs;                                                 // 0x03C8 (size: 0x10)
    TSubclassOf<class UPalAICombatModule> CombatModuleClass;                          // 0x03D8 (size: 0x8)
    class UPalActiveSkillSlot* SkillSlot;                                             // 0x03E0 (size: 0x8)
    FString DebugOrganizationName;                                                    // 0x03E8 (size: 0x10)
    class APalCharacter* R1AttackTarget;                                              // 0x03F8 (size: 0x8)
    float MinAIActionComponentTickInterval;                                           // 0x0400 (size: 0x4)
    bool bIsActive;                                                                   // 0x0410 (size: 0x1)
    bool IsSquadBehaviour;                                                            // 0x0411 (size: 0x1)
    bool IsNotSleepWildLife;                                                          // 0x0412 (size: 0x1)
    class UPalSquad* MySquad;                                                         // 0x0418 (size: 0x8)
    class UPalHate* HateSystem;                                                       // 0x0420 (size: 0x8)
    class UPalAIActionComponent* AIActionComponent;                                   // 0x0428 (size: 0x8)
    class UPalAIBlackboardBase* PalAIBlackboard;                                      // 0x0430 (size: 0x8)
    bool bOverwriteBlockDetectionParams;                                              // 0x04C0 (size: 0x1)
    FPalPathFollowingBlockDetectionParams BlockDetectionParams;                       // 0x04C4 (size: 0xC)
    TSubclassOf<class UPalAIBlackboardBase> PalBlackboardClass;                       // 0x04D0 (size: 0x8)
    FTimerHandle DeadBodyDeleteTimerHandle;                                           // 0x04E0 (size: 0x8)
    bool IsDeadBodyTimeDelate;                                                        // 0x04E8 (size: 0x1)
    bool IsSelfTimeDelate_FromSpawnTime;                                              // 0x04E9 (size: 0x1)
    FTimerHandle SelfDeleteTimerHandle;                                               // 0x04F0 (size: 0x8)
    bool IsSelfTimeDelate_FromSpawnTime_ForVisitor;                                   // 0x04F8 (size: 0x1)
    bool bShouldCheckStuckByTick;                                                     // 0x0500 (size: 0x1)

    void WaitForSeconds(float Time);
    void SimpleMoveToActorWithLineTraceGround(const class AActor* GoalActor);
    void ShowHateArrow();
    void ShowActionDebug();
    void SetInitialValue(bool IsSquad, bool NotSleep);
    void SetActiveAI(bool Active);
    void RPCDummy();
    TEnumAsByte<EPathFollowingRequestResult::Type> PalMoveToLocation(const FVector& Dest, float AcceptanceRadius, bool bStopOnOverlap, bool bUsePathfinding, bool bProjectDestinationToNavigation, bool bCanStrafe, TSubclassOf<class UNavigationQueryFilter> FilterClass, bool bAllowPartialPaths);
    void OnDeadTimerStart(FPalDeadInfo Info);
    void OnChangedActiveCharacter(const bool bActive);
    void OnChangeChangeImportance(EPalCharacterImportanceType Next);
    void NotifyTalkStart(class APalPlayerCharacter* TalkPlayer);
    void NotifyTalkEnd(class APalPlayerCharacter* TalkPlayer);
    void MoveToLocation_ErrorSupportMove(FVector GoalLocation);
    void MoveToDirectly(FVector GoalLocation);
    bool IsOnNavMesh_TargetLocation(FVector TargetLocation);
    bool IsOnNavMesh();
    bool IsLeader();
    bool IsExistPathForLocation_ForBP_HeightRangeCheck(const FVector Location, const float AcceptanceRadius, const float UpOffset, const float DownOffset, FVector& OutGoalLocation);
    bool IsExistPathForLocation_ForBP(const FVector Location, const float AcceptanceRadius);
    bool IsActiveAI();
    class APalCharacter* GetSquadLeader();
    class UPalSquad* GetSquad();
    class UPalAIBlackboardBase* GetMyPalBlackboard();
    class UPalAIBlackboardBase* GetLeaderPalBlackboard();
    bool GetIsSquadBehaviour();
    bool GetIsnotSleepWildLife();
    class UPalHate* GetHateSystem();
    class UPalAIActionComponent* GetAIActionComponent();
    bool FindReachablePathLocation(TArray<FVector> RequestLocationArray, FVector& OutGoalLocation);
    bool FindNearestNavmeshPointFromSelf(FVector& OutLocation);
    void DeleteSelfDeadBody();
    void CreatePalBlackboard();
    class AActor* CopyTargetFromOtherAI(const class AActor* FromAcotr);
    void AddTargetPlayer_ForEnemy(class AActor* PlayerOrPal);
    void AddTargetNPC(class AActor* NPC);
}; // Size: 0x528

class APalActionDummyTargetActor : public AActor
{
}; // Size: 0x290

class APalAmbientSoundAreaBase : public AActor
{
    int32 AmbientPriority;                                                            // 0x0290 (size: 0x4)
    TArray<class UAkAudioEvent*> DayAmbientEvents;                                    // 0x0298 (size: 0x10)
    TArray<class UAkAudioEvent*> NightAmbientEvents;                                  // 0x02A8 (size: 0x10)
    bool bIsOverlappedLocalPlayer;                                                    // 0x02B8 (size: 0x1)

    void OnEndOverlap(class UPrimitiveComponent* OverlappedComponent, class APalPlayerCharacter* PlayerCharacter);
    void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class APalPlayerCharacter* PlayerCharacter);
    class UPrimitiveComponent* GetAreaCollision();
    FPalAmbientSoundAreaData GetAmbientSoundAreaData();
}; // Size: 0x2C0

class APalAmbientSoundLineBase : public AActor
{
    class UAkComponent* AkComponent;                                                  // 0x0290 (size: 0x8)
    class UBoxComponent* ActivateTrigger;                                             // 0x0298 (size: 0x8)
    class UPalAmbientSoundLineObject* AmbinetSoundLineObject;                         // 0x02A0 (size: 0x8)

}; // Size: 0x2A8

class APalArenaTestManager : public AActor
{
    FPalArenaTestParameter TestParameter;                                             // 0x0290 (size: 0x50)
    TArray<class APalPlayerState*> PlayerStates;                                      // 0x02E0 (size: 0x10)
    class APalPlayerState* Player1;                                                   // 0x02F0 (size: 0x8)
    class APalPlayerState* Player2;                                                   // 0x02F8 (size: 0x8)

    void ToggleRandomPartyMode();
    void Start();
    void Setup();
    void SendClientStart();
    void SendClientSetup();
    void RidePlayer(class APalPlayerState* PlayerState, int32 RideIndex);
    void PlayBGM(EPalAudioStateGroup StateGroup);
    void OtomoInitializeTimer_Server();
    void OtomoInitializeTimer_Client();
    void LoadWaza_Client();
    bool IsOtomoActorInitialized(const class APlayerState* PlayerState);
    void InactivatePlayerOtomoPal();
    TArray<FTransform> GetPalSpawnTransform(EPalArenaPlayer ArenaPlayer);
    class UPalOtomoHolderComponentBase* GetOtomoHolder(const class APlayerState* TargetPlayerState);
    void GetOffAllPlayer();
    void EnemyCombatMode();
    void DelayRidePlayer();
    TArray<FPalDebugOtomoPalInfo> CreateRandomParty();
    void ActivatePlayerOtomoPal();
}; // Size: 0x318

class APalBackWeaponBase : public AActor
{
    bool InFirstOrSecondSlot;                                                         // 0x0290 (size: 0x1)
    bool IsEquipHand;                                                                 // 0x0291 (size: 0x1)
    FFlagContainer HiddenBackWeapon;                                                  // 0x0298 (size: 0x50)

}; // Size: 0x2E8

class APalBiomeAreaTriggerBase : public AActor
{
    EPalBiomeType BindBiomeType;                                                      // 0x0290 (size: 0x1)

    void OnOverlap(class AActor* OtherActor, EPalBiomeType BiomeType);
    void OnEndOverlap(class AActor* OtherActor, EPalBiomeType BiomeType);
    EPalBiomeType GetBiomeType();
}; // Size: 0x298

class APalBossBattleLevelInstance : public ALevelInstance
{
    FPalBossBattleLevelInstanceOnBossSpawnedDelegate OnBossSpawnedDelegate;           // 0x0320 (size: 0x10)
    void OnBossSpawnedDelegate(class APalCharacter* SpawnedCharacter);
    bool bIsLoaded;                                                                   // 0x0330 (size: 0x1)

    void SpawnBossSpawner(EPalBossType BossType, int32 JoinPlayerNum);
    void ResetBossLocation();
    void OnBossSpawnedDelegate__DelegateSignature(class APalCharacter* SpawnedCharacter);
    FTransform GetSequencerTransform();
    FTransform GetPlayerStartTransform();
    bool CheckLevelLoaded();
    void BossSpawned(class APalCharacter* SpawnedCharacter);
}; // Size: 0x338

class APalBossTower : public AActor
{
    FPalBossTowerOnChangeBossTowerEntryWaitUI OnChangeBossTowerEntryWaitUI;           // 0x0298 (size: 0x10)
    void OnChangeBossTowerEntryWaitUI(bool bIsCountDown, FDateTime TimeLimit);
    EPalBossType BossType;                                                            // 0x02A8 (size: 0x1)
    FGuid EntryWaitInfoHUDId;                                                         // 0x02AC (size: 0x10)
    class UPalBossBattleInstanceModel* InstanceModel;                                 // 0x02C0 (size: 0x8)
    FDateTime CombatTimeLimit;                                                        // 0x02C8 (size: 0x8)
    FGuid LocationInstanceId;                                                         // 0x02D0 (size: 0x10)
    TArray<class APalPlayerCharacter*> InDoorPlayerList;                              // 0x02E0 (size: 0x10)
    FTimerHandle TimerHandle;                                                         // 0x02F0 (size: 0x8)

    bool WriteBossDefeatRecord_ServerInternal(class APalPlayerCharacter* TargetPlayer);
    void ShowWaitInfo(const FVector TargetLocation, const FVector DisplayOffset, bool isWaiting);
    void RequestBossBattleStart(class APalPlayerCharacter* Player);
    void RequestBossBattleEntry(class APalPlayerCharacter* Player);
    void RemoveInDoorPlayer(class APalPlayerCharacter* Player);
    void OnRep_InstanceModel();
    void OnChangeEntryPlayer(TArray<class APalPlayerCharacter*> EntryPlayers);
    void OnChangeCombatTimeLimit(FDateTime NewCombatTimeLimit);
    void OnChangeBossTowerEntryWaitUI__DelegateSignature(bool bIsCountDown, FDateTime TimeLimit);
    void OnChangeBossBattleStateBP(EPalBossBattleState NewState);
    void OnChangeBossBattleState(EPalBossBattleState NewBossBattleState);
    bool IsEntered(class APalPlayerCharacter* Player);
    FTransform GetTopWarpPoint();
    TArray<class APalPlayerCharacter*> GetStartablePlayers();
    FTransform GetFrontWarpPoint();
    TArray<class APalPlayerCharacter*> GetForceWarpTargets();
    FTransform GetDeadItemDropPoint();
    FName GetBossBattleRowName();
    void CloseWaitInfo();
    void AddInDoorPlayer(class APalPlayerCharacter* Player);
}; // Size: 0x2F8

class APalBotBuilderLocationBase : public AActor
{
    int32 BuilderIndex;                                                               // 0x0290 (size: 0x4)
    bool bIsBuilded;                                                                  // 0x0294 (size: 0x1)

}; // Size: 0x298

class APalBoxSpawnerPlacementTool : public AActor
{
    FVector BoxExtent;                                                                // 0x0290 (size: 0x18)
    class UBoxComponent* BoxComp;                                                     // 0x02A8 (size: 0x8)

}; // Size: 0x2B0

class APalBuildObject : public APalMapObject
{
    FPalBuildObjectOnChangeState OnChangeState;                                       // 0x03D0 (size: 0x10)
    void OnChangeStateDelegate(EPalBuildObjectState State);
    EPalBuildObjectInstallStrategy InstallStrategy;                                   // 0x03F8 (size: 0x1)
    float InstallCapacitySlopeAngle;                                                  // 0x03FC (size: 0x4)
    float InstallCapacitySinkRateByHeight;                                            // 0x0400 (size: 0x4)
    class UPalBuildObjectVisualControlComponent* VisualCtrl;                          // 0x0408 (size: 0x8)
    FName BuildObjectId;                                                              // 0x0410 (size: 0x8)
    class UShapeComponent* OverlapCheckCollision;                                     // 0x0418 (size: 0x8)
    FComponentReference OverlapCheckCollisionRef;                                     // 0x0420 (size: 0x28)
    FBox LocalBounds;                                                                 // 0x0448 (size: 0x38)
    class UPalBuildObjectOverlapChecker* OverlapChecker;                              // 0x0480 (size: 0x8)
    TArray<class UMeshComponent*> AllMeshes;                                          // 0x0488 (size: 0x10)
    TArray<class UPrimitiveComponent*> VirtualMeshCollisions;                         // 0x0498 (size: 0x10)
    EPalBuildObjectState CurrentState;                                                // 0x04A8 (size: 0x1)
    FGuid WorldHUDId;                                                                 // 0x04AC (size: 0x10)
    FGuid buildProgressWorldHUDId;                                                    // 0x04BC (size: 0x10)
    FVector WorldHUDDisplayOffset;                                                    // 0x04D0 (size: 0x18)
    float WorldHUDDisplayRange;                                                       // 0x04E8 (size: 0x4)
    FVector buildProgressHUDDisplayOffset;                                            // 0x04F0 (size: 0x18)
    FVector2D buildProgressHUDDisplayOffsetScreen;                                    // 0x0508 (size: 0x10)
    float buildProgressHUDDisplayRange;                                               // 0x0518 (size: 0x4)
