#ifndef UE4SS_SDK_RiverSplineElement_HPP
#define UE4SS_SDK_RiverSplineElement_HPP

struct FRiverSplineElement
{
    class UStaticMesh* RiverSplineMesh_60_55DB51C74ADB81AE8B3C67B1E701AC70;           // 0x0000 (size: 0x8)
    class UMaterial* SplineMaterial_38_D0D297DF41688E686403848C672F8D41;              // 0x0008 (size: 0x8)
    float Spacing_16_A1850B9941C9F1CE594A6D8E4D2B6C72;                                // 0x0010 (size: 0x4)
    FVector Scale_17_0FF21A994C9965DF5D70EB8E0B857472;                                // 0x0018 (size: 0x18)
    FVector Offset_18_04ECFFEB41DE1C636D2E66B03104C5E7;                               // 0x0030 (size: 0x18)
    FRotator Rotation_19_8934B08D49E62A953A970696627EBA95;                            // 0x0048 (size: 0x18)
    float TangetScale_25_3E26B9A843F1DD460A8E648EA4512EF1;                            // 0x0060 (size: 0x4)
    float SplineStartOffset_50_DCE654714E7A2AF455D6C1A501032968;                      // 0x0064 (size: 0x4)
    TEnumAsByte<ECollisionEnabled::Type> CollisionType_56_7635CF7B41E05135A2703891F4BDC530; // 0x0068 (size: 0x1)
    bool CastShadow_59_F9E195C64ADC55FE40F00BA4A3EA0111;                              // 0x0069 (size: 0x1)
    bool Enabled_44_0E2207EB4FCC91374AFAF6A98B71185D;                                 // 0x006A (size: 0x1)

}; // Size: 0x6B

#endif
