#ifndef UE4SS_SDK_SplineAttachment_HPP
#define UE4SS_SDK_SplineAttachment_HPP

struct FSplineAttachment
{
    class UStaticMesh* StaticMesh_47_3E26B9A843F1DD460A8E648EA4512EF1;                // 0x0000 (size: 0x8)
    TSubclassOf<class AActor> Actor_43_55DB51C74ADB81AE8B3C67B1E701AC70;              // 0x0008 (size: 0x8)
    float Spacing_16_A1850B9941C9F1CE594A6D8E4D2B6C72;                                // 0x0010 (size: 0x4)
    FVector Scale_17_0FF21A994C9965DF5D70EB8E0B857472;                                // 0x0018 (size: 0x18)
    FVector Offset_18_04ECFFEB41DE1C636D2E66B03104C5E7;                               // 0x0030 (size: 0x18)
    float SplineOffset_52_C731D9EB439A6A122EE274AC46F153E8;                           // 0x0048 (size: 0x4)
    FRotator Rotation_19_8934B08D49E62A953A970696627EBA95;                            // 0x0050 (size: 0x18)
    bool OrientToSpline_45_8AE90114466411B69A364A9ACC68D82F;                          // 0x0068 (size: 0x1)
    bool Enabled_54_28B292F644AD049F1C817E98CAE7E1A8;                                 // 0x0069 (size: 0x1)
    bool InterpolateSplineScale_63_795808994F00156B5CE473897E183DE4;                  // 0x006A (size: 0x1)

}; // Size: 0x6B

#endif
