#ifndef UE4SS_SDK_ST_BossAnimations_HPP
#define UE4SS_SDK_ST_BossAnimations_HPP

struct FST_BossAnimations
{
    class UAnimSequence* Idle_2_1EBBA0384D935467F36F6CB60245AB11;                     // 0x0000 (size: 0x8)
    class UAnimSequence* Encount_4_CAEBC8464E94BDC737DE3B986D4A3E01;                  // 0x0008 (size: 0x8)
    class UAnimSequence* CommonWazaIn_18_DEFB1A724BF20D08613712AFAF536C51;            // 0x0010 (size: 0x8)
    class UAnimSequence* Commonwaza_6_17ED6C604B6AD2942DB495ADBF01265C;               // 0x0018 (size: 0x8)
    class UAnimSequence* CommonWazaOut_20_C830640E4A8C292A9A90DAAF448B5BCD;           // 0x0020 (size: 0x8)
    class UAnimSequence* UniqueWazaIn_8_CBE584EA46E3D7C383A579A852555702;             // 0x0028 (size: 0x8)
    class UAnimSequence* UniqueWaza_10_B46A727E400A2EB055FF7EA1BB989F16;              // 0x0030 (size: 0x8)
    class UAnimSequence* UniqueWazaOut_12_F2286E794F07E21A4D6DFBB8EBF34026;           // 0x0038 (size: 0x8)

}; // Size: 0x40

#endif
