#ifndef UE4SS_SDK_WBP_BossBattle_BossCutBase02_HPP
#define UE4SS_SDK_WBP_BossBattle_BossCutBase02_HPP

class UWBP_BossBattle_BossCutBase02_C : public UUserWidget
{
    class UWidgetAnimation* Anm_Open;                                                 // 0x0278 (size: 0x8)
    class UImage* BaseFlash;                                                          // 0x0280 (size: 0x8)
    class UImage* BaseGrd;                                                            // 0x0288 (size: 0x8)
    class UImage* BaseSplash_L;                                                       // 0x0290 (size: 0x8)
    class UImage* BaseSplash_R;                                                       // 0x0298 (size: 0x8)
    class UImage* Frame_B;                                                            // 0x02A0 (size: 0x8)
    class UImage* Frame_T;                                                            // 0x02A8 (size: 0x8)
    class UImage* Image_43;                                                           // 0x02B0 (size: 0x8)
    class UImage* Image_112;                                                          // 0x02B8 (size: 0x8)
    class UImage* ImageSymbol;                                                        // 0x02C0 (size: 0x8)
    class URetainerBox* RetainerBox_1;                                                // 0x02C8 (size: 0x8)
    class URetainerBox* RetainerBox_Symbol;                                           // 0x02D0 (size: 0x8)
    class UImage* Splash;                                                             // 0x02D8 (size: 0x8)
    class UImage* Splash_1;                                                           // 0x02E0 (size: 0x8)
    class UWBP_BossBattle_CutTri_C* WBP_BossBattle_CutTri;                            // 0x02E8 (size: 0x8)
    class UWBP_BossBattle_CutTri_C* WBP_BossBattle_CutTri_1;                          // 0x02F0 (size: 0x8)
    class UWBP_BossBattle_CutTri_C* WBP_BossBattle_CutTri_2;                          // 0x02F8 (size: 0x8)
    class UWBP_BossBattle_CutTri_C* WBP_BossBattle_CutTri_3;                          // 0x0300 (size: 0x8)

}; // Size: 0x308

#endif
